[
	{
		"ver": "0.0.2",
		"title": "Initial Release",
		"date": "2019-08-03",
		"txt": "- Initial release\n- Ability to import homebrew creatures, spells, feats, and items to the actor/item collections\n- Ability to import spells/items/backgrounds/races/feats/classes/subclasses to character sheets\n- Actor item cleaner\n- Minor UI tweaks, including \"x\" button on notifications"
	},
	{
		"ver": "0.0.2a",
		"title": "Slightly Higher-Grade Plutonium",
		"date": "2019-08-06",
		"txt": "- Added workaround for Plutonium sometimes loading after Foundry had already fully initialized, thus causing Plutonium to miss the part where it's supposed to hook into the UI.\n- The \"Import\" button is now kept fixed at the bottom of import list windows.\n- Added importer support for Better NPC 5e sheets.\n- Added support for Node.js versions as old as version 10 (current is 12), as 10 is the minimum Foundry requires.\n- Enabled importing class levels even if there are no features present at that level.\n- Added weapon bonuses to weapon damage (previously only applied to to-hit)."
	},
	{
		"ver": "0.0.2b",
		"title": "That Awkward Moment When You Both Try to Go Through the Door at the Same Time",
		"date": "2019-08-07",
		"txt": "- Fixed concurrency issues when mass-creating entities"
	},
	{
		"ver": "0.0.2c",
		"title": "No Face, No Case",
		"date": "2019-08-16",
		"txt": "- Added config editor, with \"streamer mode\" option"
	},
	{
		"ver": "0.0.2d",
		"title": "Foundry v0.3.5 Compatibility",
		"date": "2019-08-22",
		"txt": "- Compatibility update for Foundry 0.3.5"
	},
	{
		"ver": "0.0.3",
		"title": "Compendium Change Concepts Confuse Concerned Citizens",
		"date": "2019-09-01",
		"txt": "- Added built-in compendiums\n- Added Variant & Optional Rule importer"
	},
	{
		"ver": "0.0.3a",
		"title": "Prune > Dates",
		"date": "2019-09-08",
		"txt": "- A folder picker UI in the importer, including a (limited) range of \"dynamic\" options, i.e. if you select \"Challenge Rating\" in the creature importer, it'll put each creature in a folder according to their CR. Something similar existed in betteR20, although it was nowhere near as customizable--this iteration allows full control. Sadly, Foundry only supports three levels of folder nesting at time of writing, but the developer (Atropos) aims to expand this to at least five.\n- A \"Prune Folders\" option and button in the Directory Cleaner, which can be enabled or run independently to have the cleaner also remove any empty folders it finds.\n- A tweak to the included compendiums to add the (abbreviated) source to the name of each item.\n- And a few other minor QoL improvements and layout fixes."
	},
	{
		"ver": "0.0.3b",
		"title": "More Than 99 Problems",
		"date": "2019-09-14",
		"txt": "- A minor compatibility update for Foundry v0.3.(6/7) (with regards to the directory panel layout changes)\n- Creature scaling on import\n- A fix for creatures disappearing from the combat tracker when they were marked as hidden"
	},
	{
		"ver": "0.0.3c",
		"title": "Your Wires Are Showing",
		"date": "2019-09-16",
		"txt": "- A fix for AC sources being a mess of HTML on non-default sheets\n- A fix for all the strange numbers appearing down the right-hand-side of import lists\n- A fix for the CR Scaler dialogue being a funny size sometimes"
	},
	{
		"ver": "0.0.3d",
		"title": "A Coat of Red Paint",
		"date": "2019-09-22",
		"txt": "- Fresh compendium dumps, with Descent Into Avernus content.\n- Updated Bestiary files, again to add Descent Into Avernus content.\n- A fix for imported creatures always using Strength as their ability score modifier for all their attack rolls. As Foundry doesn't allow the specification of exact to-hit modifiers on NPC attacks, I had completely overlooked this--since 5e statblocks never specify the ability the creature is using for each attack, I'm doing some guesswork behind the scenes to figure it out. It should be accurate in the vast majority of cases, although there appears to be a Foundry bug where creatures can never have their attack proficiency disabled when creating them via the API, so e.g. Ghast's bite is busted."
	},
	{
		"ver": "0.0.3e",
		"title": "Eat Sleep Code Repeat",
		"date": "2019-10-29",
		"txt": "- The \"import\" button should now be available on any sheet, rather than those I manually specify\n- The import list \"select all\" checkbox now only selects/deselects visible rows\n- An update to background importing to support multiple features (needed for DIA backgrounds)\n- A fix for repeated requests not properly caching data (so opening the same importer repeatedly in the same session should now be quicker)"
	},
	{
		"ver": "0.0.3f",
		"date": "2019-10-29",
		"txt": "- Added workaround for a Foundry bug where full art would be used as tokens\n- Fixed a bug where items would fail to import\n- Fixed some minor layout bugs"
	},
	{
		"ver": "0.0.4",
		"date": "2019-11-16",
		"txt": "- Compatibility update for Foundry v0.4.x+. Not that this update is not backwards compatible with 0.3.x.\n- Added rollable table importer\n- Added option to import classes/subclasses to journal"
	},
	{
		"ver": "0.0.4a",
		"date": "2019-11-29",
		"txt": "- Added \"Spell Prepared Toggler\" tool to actors, accessible via a new \"Tools\" link in the actor window bar. This \"Tools\" link replaces the old \"Cleaner\" link, which is now instead accessed from this Tools sub-dialogue.\n- Fixed Silver Dragons failing to import due to a bug in rendering their lair actions\nv0.0.4b:\n- Fixed failing to load custom homebrew URLs"
	},
	{
		"ver": "0.5.0",
		"date": "2019-12-08",
		"txt": "- (Made version number more sensible)\n- (Added support for Rivet)\n- Journal/etc. cleaner tool can now delete rollable tables\n- Races can now be imported as items\n- Non-rollable tables can now be imported as rollable tables\n- Custom importer folder paths are now saved to game settings (and will be used when receiving data from Rivet)\n- A blank token is now used for creatures missing a token on import\n- Fixed creature (and therefore token) sizing on import\n- Improved script initialization to remove a benign error (thanks Red Reign)"
	},
	{
		"ver": "0.6.0",
		"date": "2020-01-02",
		"txt": "- Added Psionics importer, which creates spells\n- Class importer now imports saving throw/skill/weapon/armor/tool proficiencies\n- Added notifications when importing through Rivet\n- Fixed versatile weapons being imported with two damage +@mods\n- Token actors are now re-rendered on importing to their sheets, ensuring the imported items are shown\n- Fixed Necromancy spells failing to set their school\n- Class importer now skips Proficiency Versatility features"
	},
	{
		"ver": "0.7.0",
		"date": "2020-01-11",
		"txt": "- Compatibility update for Foundry v0.4.4+. Note that this update is not backwards compatible with 0.4.3.\n- Added a tool to bulk-move collection items to folders\n- Added config options for imported tokens, allowing e.g. bar attributes; name display modes to be customized\n- Spell/Item/Creature importers now try to use art from the SRD compendiums where none is available in 5etools\n- Added red coloration to \"Delete\"/\"Delete All\" collection rightclick\n- Shrunk collection UI buttons (now one row as opposed to two)"
	},
	{
		"ver": "0.7.1",
		"date": "2020-01-11",
		"txt": "- Fixed links to spells in e.g. creature Spellcasting traits failing to cast the appropriate spell\n- Added configuration options to choose compendiums from which the importers will attempt to source images\n- Fixed bug which prevented Background importer from displaying when importing to journal"
	},
	{
		"ver": "0.7.2",
		"date": "2020-01-20",
		"txt": "- Fixed item damage rolls failing to populate (note: compendiums not updated)\n- Fixed config dropdowns failing to display their current value"
	},
	{
		"ver": "0.8.0",
		"date": "2020-02-25",
		"txt": "- Importer:\n  - Ported 5etools filters for use in lists\n  - Added SHIFT-click to lists for multi-selection\n  - Homebrew files may now be uploaded directly (see the option in the source dropdown)\n  - Added spell targeting data for all AoE spells for use with the new template system (and the ability to specify homebrew spell targeting data)\n  - Fixed \"1 <X> damage\" (e.g. the \"Bite\" attack of a rat) being added as features instead of attacks\n  - Fixed failing to remember which importer was last used\n  - Fixed non-existent importers being selected when opening actor importer after collection importer\n  - Overhauled UI\n\n- Config:\n  - Added initial actor/item permission options for all importers\n  - Added \"fast animation\" token config option, which toggles Foundry's slow-sliding token animations\n  - Added \"import spells as prepared\" toggle\n  - Added option to disable 5etools link rendering in imported content\n  - Overhauled UI\n\n- Tools:\n  - Added SHIFT-click to lists for multi-selection (e.g. in collection cleaner)\n  - Overhauled UIs"
	},
	{
		"ver": "0.9.0",
		"date": "2020-02-29",
		"txt": "- Added config option to compact Plutonium window header buttons into a single dropdown button\n- Added support for homebrew subraces to race importer\n- Spell importer will now attempt to populate healing dice on healing spells\n- Added config option to convert spell ranges to metric (where possible)\n- Added filters to class importer (which apply to imported content, i.e. disabling the \"Class Feature Variant\" source will prevent any of its content from being imported)\n- Added tool proficiency import step to background importer\n- When using the item importer to import a pack to an actor, the pack is now split into, and imported as, its constituent items\n- Added support for hit dice to class importer\n- Added optional/variant feature importer\n- Added config-enable-able \"popout\" button for sheets, which pops them out into a separate window (warning: probably broken)\n- Added \"Compact Scenes\" config  option, which works similarly to the existing \"Compact Journal\" option\n- Fixed importing the same class multiple times (i.e. importing higher levels of the same class to level up) failing to re-use the existing class features item\n- Fixed creature importer failing to import non-attack actions as actions\n- Fixed Plutonium window header buttons failing to hide on window minimize\n- Fixed non-Foundry-standard condition immunities being rendered as HTML\n- Fixed class importer failing to set spell slots\n- Fixed some tables breaking the table importer\n- Fixed case where importer item thumbnail images would fail to render"
	},
	{
		"ver": "0.9.1",
		"date": "2020-03-08",
		"txt": "- Compatibility update for Foundry 0.5.x\n- Added multiclass support to class importer (if you have already imported a different class, the importer will now ask if you wish to multiclass/use as base class/ignore the new class)\n- Improved class importer handling of spellcasting slots in the presence of multiple classes (provided all classes were imported with Plutonium version 0.9.1+)"
	},
	{
		"ver": "0.9.2",
		"date": "2020-03-14",
		"txt": "- When importing a choice of skills/tools to a character, current skill/tool proficiencies are now shown in the \"choose\" menu\n- Added config option to convert item weights to metric\n- Fixed homebrew creature tokens failing to import in some cases\n- Fixed importer failing to remember which source was previously selected upon re-opening\n- Fixed drag-to-reorder being broken in import path editor"
	},
	{
		"ver": "0.10.0",
		"date": "2020-03-28",
		"txt": "- Importers can now import directly to compendiums\n- Rivet can now be used to import directly to an actor [Rivet is working again as of 5etools v1.102.1, which is now rolling out]\n  - The target actor can be chosen by right-clicking the actor in the directory, or from the new \"Rivet\" section of config\n- Added \"Source (Abbreviation)\" as an option to import folder path editor\n- (Fixed junk console warning complaining about \"source map\")"
	},
	{
		"ver": "0.11.0",
		"date": "2020-04-01",
		"txt": "- Added warning prompt when attempting to import a single high level of a class without importing the lower levels, to a sheet without an existing class\n- Added warning prompt when attempting to import a subclass (and no class) to a sheet without an existing class\n- Exploded class features on import, breaking down e.g. Fighting Style into all its constituent flavours\n- Added config option to \"fix\" Foundry's funny ESC key bindings:\n  - Foundry default: dismiss context menu -> close all UI windows -> de-select tokens/etc (GM only) -> toggle main menu\n  - the Giddy Special: un-focus current input -> dismiss context menu -> de-select tokens/etc (all users) -> close most recently used UI window -> toggle main menu\n- Added config option to add image thumbnails to the file browser (warning: slow)\n- Added config option to (attempt to) remove all animations from the UI (warning: fast)\n- Importer now avoids attempting to import to locked compendiums\n- Fixed various importers failing to import to compendiums\n- Fixed Race actor importer filters\n- Fixed spell \"at higher level\" choice popups failing to roll dice\n- Fixed backslashes/quotes breaking the \"rename\" functionality of the creature importer"
	},
	{
		"ver": "0.11.1",
		"date": "2020-04-01",
		"txt": "- Added \"Open Main Menu\" button to settings tab when ESC key fix is enabled\n- Added \"reset tab\" buttons to config editor\n- Imported classes and class features will now attempt to source art from the SRD compendiums"
	},
	{
		"ver": "0.12.0",
		"date": "2020-04-04",
		"txt": "- Added Bulk Permission Editor tool\n- Added folder paths and filtering to Directory Cleaner tool and Bulk Directory Mover tool\n- Added Condition/Disease importer\n- Import list windows are now full-height by default (fixing an issue where the list could have a scrollbar with very few items)"
	},
	{
		"ver": "0.12.1",
		"date": "2020-04-06",
		"txt": "- Overhauled config system to add player layer. This allows each player to change a limited subset of config settings (the editor can be accessed in the Settings tab), including, importantly, the Rivet import target actor\n- Added workaround for Bulk Permission Editor wiping pre-existing permissions (I _think_ this is a Foundry bug)\n- Added workaround for compendiums being inaccessible in some rare cases (another Foundry bug? Happened in my own game; no errors; couldn't repro it elsewhere)"
	},
	{
		"ver": "0.13.0",
		"date": "2020-04-18",
		"txt": "- (Compatibility update for 0.5.5)\n- Added Art Browser integration, accessible via the \"palette\" button in the scene controls menu. Features include:\n  - Drag-dropping tiles to the canvas, with configurable scaling\n  - Drag-dropping tokens to the canvas\n  - The ability to download entire image packs locally, provided the server-side mod is installed (more on this below)\n- Added server-side mod. Installation instructions can be found in the README. This enables things previously locked out by pesky browser security features, such as downloading images from websites that really don't want you downloading their images (lol). **This is entirely optional, and Plutonium will never _require_ you to mod the Foundry server.** It will, however, enable some additional bells and whistles, like the aforementioned mass image downloader.\n- Overhauled module internals/build system. This (hopefully) should not produce a visible difference in functionality, but should fix previous performance penalties incurred by running Plutonium on e.g. large maps with heavy use of dynamic lighting (thanks @ Felix for bringing this to my attention and providing sample data)\n- Fixed config \"reset tab\" button failing to take effect unless the settings were manually changed afterwards\n- Relaxed \"fast animations\" timing to hopefully prevent various timing-related bugs"
	},
	{
		"ver": "0.14.0",
		"title": "The drugs _do_ work",
		"date": "2020-04-19",
		"txt": "- Added (albeit highly shitty) Adventure/Book importer, similar to the \"legacy\" importer available in betteR20\n  - Currently doesn't split the text into millions of journal entries; let me know if the \"one chapter per entry\" approach is better or worse.\n  - Currently doesn't have the \"next journal entry/previous journal entry\" buttons at the top/bottom of each handout; will add these after receiving some feedback on the above.\n- Added \"Scene creation\" as an option for Art Browser drag-drop\n- Added Art Browser token sizing config options\n- Added config options for Art Browser button placement; it can be made visible under any/all of: the token, tiles, or main scene menus\n- Added (intentionally highly objectionable) display showing when the server-side mod is detected as active\n- Fixed broken \"View\" link in the Art Browser\n- Fixed Art Browser always attempting to leverage the server-side mod, instead of just where available\n- (Server) Fixed images failing to upload to an empty assets path"
	},
	{
		"ver": "0.14.1",
		"date": "2020-04-19",
		"txt": "- Fixed \"prepared spell\" casters failing to import their spell lists during class import\n- Added filters to Actor Feature/Spell Cleaner"
	},
	{
		"ver": "0.15.0",
		"title": "Delicious Dogfood",
		"date": "2020-04-27",
		"txt": "- Added \"Bulk Prototype Token Editor\" tool to Actors journal tools, with a handful of options for handling the most common repetitive token-updating tasks (as per my personal experience; ymmv/suggestions appreciated)\n- Creature importer:\n  - Weapons wielded by creatures now have additional data pulled in, adding e.g. weight, price, weapon properties, and art (where available)\n  - Creatures wearing armor now have this armor added to their inventory\n  - Added config option to scale the weight/price of items wielded by larger creatures, based on either the \"Barding\" rules in the PHB, or on an item from SKT (\"Gurt's Greataxe\"), these being the only two examples I know of \"official\" rulings on the matter. Open to suggestions/pointers in the direction of more data.\n  - Actions with names including \"X/Day\" (etc.) now correctly import this information to their sheet\n  - Added (heuristic) parsing of action activation conditions\n  - Added (heuristic) parsing of bonus action traits\n  - Fixed some damage rolls/types not being added to imported actions\n- Spell importer:\n  - Fixed dice formulas in \"At Higher Levels\" text\n  - Fixed some damage rolls/types not being added to imported spell\n- Added rudimentary filtering to the actor Prepared Spell Mass-Toggler tool\n- Added sortable \"Level\" column to the actor Prepared Spell Mass-Toggler tool\n- Added config option to toggle \"backend detected\" display (the green logo variant); logo change also now disabled when in Streamer Mode\n- Added config option to append page information to imported \"Source\" text, e.g. \"PHB\" -> \"PHB, p.123\"\n- Fixed some \"Choose Skills/Tools\" dialogues crashing the Backgrounds importer\n- Fixed \"table groups\" failing to import via rivet, and made them available in the Table importer\n- Fixed per-source Creature/Spell importers including entities from outside their source\n- Fixed double-scrollbar layout bug in modified file picker\n- (Developer) All patched methods now expose their originals as `_plutoniumCache_<originalMethodName>`"
	},
	{
		"ver": "0.16.0",
		"title": "Interfacial",
		"date": "2020-05-03",
		"txt": "- Importer:\n  - Overhauled importer UI\n    - Importers may now quickly be selected from a panel, rather than a dropdown\n    - Added search and (rudimentary) filtering for sources, and a list display\n    - Combined the \"folder\" and \"compendium\" import options into one always-visible area\n    - Added option to keep the importer list open, allowing e.g. filling out a character's spells then items without re-opening each time\n  - Re-opening the same importer list twice in a row should now be much faster\n  - Added colors to importer \"Source\" columns\n  - Added config option to set spell \"Preparation Mode\" when importing\n  - Added link to the current archive of converted Roll20 modules (the button next to the Adventure importer)\n  - Spell importer now loads targeting information from the SRD where available (as 5etools doesn't have a good representation of much of this data yet)\n  - An importer targeting an actor will now auto-close if the actor is deleted\n  - Spellcasting progression, skill choice number, and skill choices are now set on class sheet items when importing classes\n  - \"Always prepared\" spells are now imported as \"always prepared\" when importing classes\n  - Fixed Race importer failing to set \"Powerful Build\" flag; added \"Halfling Lucky\" and \"Savage Attacks\" flag support\n  - Feat importer now sets \"Alert,\" \"Elven Accuracy,\" and \"Observant\" flags when importing the appropriate feats\n  - Classes importer now sets \"Jack of All Trades\" and \"Remarkable Athlete\" flags when importing the appropriate sub/class levels\n\n  - Improved Creature importer\n    - Creature spells are now imported as innate/pact as appropriate\n    - Lair actions now import with their DCs/damages when available\n    - Fixed case where a creature could lose proficiency in its weapons (notably affecting Hobgoblin Warlord)\n    - Fixed case where a creature with no CR (notably ERLW's artificer pets) would fail to import their damage rolls\n    - Fixed case where a creature with only one total Foundry item on its sheet (e.g. one action, no traits) would crash the importer\n\n\n- Added \"Polymorpher\" tool in actor tools. Allows you to use the Plutonium importing UI to load and polymorph/wild shape directly into the loaded creature\n- Moved \"compact Plutonium header buttons\" option to general UI, and re-worked it to generally overhaul of Foundry's button header styling\n- Bulk token editor can now set bars to \"None\" (i.e. empty)\n- Split \"Compact Journal\" config options into one option for each directory\n- Moved \"hacky\" config settings into a new \"Experimental\" section. You are no longer allowed to complain when these intentionally don't work.\n- Added experimental config option to override source data/image URL\n- Improved layout of Bulk Permissions Editor, ensuring the \"creature name\" column is always visible when scrolling horizontally\n- Fixed some config dropdowns failing to display their current value\n- (Homebrew) Fixed crashes on missing race size/speed"
	},
	{
		"ver": "0.16.1",
		"date": "2020-05-05",
		"txt": "- Added workaround for incompatibility with Forge assets manager module\n- Item importer now imports containers as containers\n- Item importer now imports some items (those with bonuses to AC; those matching common equipment names like \"belt of...\") as \"equipment\" rather than \"loot\""
	},
	{
		"ver": "0.16.2",
		"date": "2020-05-06",
		"txt": "- Added earlier permissions check for players attempting to polymorph, immediately denying it with a helpful explanation\n- Added automatic player whisper to GM when attempting to revert a polymorphed actor, with a button prompt allowing the GM to one-click delete the orphaned transformed actor\n- Fixed subclasses failing to import in some cases\n- Fixed case where selected items could remain selected when re-opening an importer"
	},
	{
		"ver": "0.16.3",
		"date": "2020-05-06",
		"txt": "- Added further workaround for incompatibility with Forge assets manager module"
	},
	{
		"ver": "0.16.4",
		"date": "2020-05-07",
		"txt": "- Added \"All Players\" column to bulk permissions updater\n- Fixed Class importer failing to load highest chosen level in some cases\n- Fixed regression preventing file picker previews from loading"
	},
	{
		"ver": "0.17.0",
		"title": "Digital Crack",
		"date": "2020-05-17",
		"txt": "- (Compatibility update for 0.5.7)\n- Art Browser now opens in \"token\" mode if opened from the \"Basic Controls\" sidebar, and \"tiles\" mode if opened from the \"Tile Controls\" sidebar\n- Added mode-cycling button to the Art Browser, allowing token/tile/scene mode to quickly be switched between\n- Art Browser now remembers \"bad\" hosts per-session, and will avoid querying them for art (instead immediately using the modded backend/fallback) when drag-dropping\n- Added config option to dynamically name the browser tab after the scene, and add an optional suffix (rather than the usual \"Foundry Virtual Tabletop • A Standalone Virtual Tabletop Application\")\n- Wondrous items and poisons are now imported to a \"Wondrous\"/\"Poison\" folder if folderizing by item type, and no other type info is available\n- Adventure/Book importers now pull rollable tables directly from the text, rather than only those linked from the text\n- Added annoying \"disclaimer\" whisper message, requiring acknowledgement to prevent it from repeatedly appearing (acknowledgement currently saved per-server, will likely change to per-client eventually)\n- Removed prominent \"5etools\" labels\n- Fixed trusted players being able to see main importer/etc buttons\n- Fixed file browser crashes on names containing \"%\"\n- Fixed sheet items (usually, actions of imported creatures) failing to persist in rare cases, and thus disappearing on reload\n- Fixed crash on closing importer UI when parts of it had not completed loading\n- Added backend version number to modded backend display\n- (Updated backend mod to be compatible with Foundry 0.5.7 backend; please upgrade to 0.1.3 as required--also note the updated instructions for applying the mod)"
	},
	{
		"ver": "0.17.1",
		"date": "2020-05-18",
		"txt": "- Fixed \"tab name from scene\" crashing if there is no active scene"
	},
	{
		"ver": "0.17.2",
		"title": "Sweet Release",
		"date": "2020-05-22",
		"txt": "- (Compatibility update for 0.6.0)\n- All Wondrous items are now imported as equipment, if they do not have another non-loot type\n- Items are now imported as tweaked copies of their SRD versions, if available\n- Added support for \"Reliable Talent\" flag\n- Added experimental Multiattack roller (rolling a \"Multiattack\" action on a creature now _might_ roll some of its listed attacks)\n- Overhauled localStorage system to use Foundry's built-in \"client\"-type settings, where possible _[note that this will have reset many settings]_\n- Improved some 5etools hover window styling, and fixed Foundry-style `[[]]` tags from appearing within 5etools hover windows\n- Fixed Bulk Prototype Token Editor crashing on attempting to open configuration screen\n- Fixed Races importer crashing on attempting to load homebrew\n- Fixed error on attempting to bring an importer window to front"
	},
	{
		"ver": "0.18.0",
		"title": "Communist Manifest",
		"date": "2020-05-24",
		"txt": "- Added custom items to spells (thanks to Adriannom and co.)\n- Added custom icons to feats (thanks to Jinker)\n- Added experimental \"Enable Journal Embeds\" feature. When enabled, this allows you to rightclick a journal item and set an embedded link (Google Doc, YouTube video, etc.) which is then displayed as an embed in that journal entry. Note that this takes up the entire journal entry; any text which might have been in there will be hidden until you remove the embed (same process, but submit an empty URL field).\n- Multiattack auto-roller now handles a couple of additional formats\n- Fixed Item importer failing when importing to the Items directory\n- Fixed gold component values on imported spells"
	},
	{
		"ver": "1.0.0",
		"title": "Finishing Touches",
		"date": "2020-05-25",
		"txt": "- Added search bar to config\n- Added config option to \"Display Missing Health\" on tokens. This puts a small player-visible number on each token which has taken damage, showing how much health it's missing.\n- Added config option to disable Creature Importer Scale/Rename dialogue\n- Fixed Creature Importer failing to set spellcaster level"
	},
	{
		"ver": "1.1.0",
		"title": "Cocked and Locked",
		"date": "2020-05-31",
		"txt": "- Ammunition is now imported as a consumable, rather than a weapon (as per D&D 5e 0.9.2)\n- When importing a weapon that requires ammunition, the Item Importer will attempt to link that weapon to an existing consumable ammo item\n  - When importing items, weapons that require ammunition are now always imported last\n- Item Importer now uses base SRD item art if none is available for a specific variant (e.g. \"Longsword\" art will be used if \"Cool +1 Longsword\" does not exist in the SRD)\n- Improved Adventure/Book Importer error handling when dealing with mismatched contents and chapters\n- Added \"Open Default Importer\" buttons to Import Wizard, which open the main \"5etools\" importer with one click\n- Improve Race Importer spell handling; spells should now be imported with the correct ability scores and preparation mode\n- Made some content matching (i.e. looking for existing class items when levelling up a class) less strict (now matches on only name, as opposed to name + source). Old strict matching is now available as a config option.\n- Added config option to avoid splitting item packs when importing items to actors\n- Fixed non-attunable magic items being imported as attuned\n- Fixed Class Importer failing to fully reset when switching from one source to another\n- Fixed file upload in Adventure/Book Importer"
	},
	{
		"ver": "1.1.1",
		"date": "2020-06-01",
		"txt": "- Fixed Race Importer failing to populate sheet items\n- Fixed Art Browser font color"
	},
	{
		"ver": "1.1.2",
		"date": "2020-06-03",
		"txt": "- (Added Mythic Odysseys of Theros files _[no compendium update yet]_)\n- Multiattack roller now detects some additional formats\n- Fixed Creature Importer failing to import Orc War Chief damage"
	},
	{
		"ver": "1.1.3",
		"title": "For Real This Time",
		"date": "2020-06-04",
		"txt": "- Restored compatibility with \"dark mode\" module(s), hopefully\n- Added compatibility with \"Mindmap\" module\n- Fixed inner windows failing to scroll on Firefox"
	},
	{
		"ver": "1.2.0",
		"title": "Plutonium For All (Sort-Of)",
		"date": "2020-06-06",
		"txt": "- Plutonium is no longer limited (in its manifest) to the \"dnd5e\" system, and should successfully load under other systems. While it will still contain all the 5e-specific importers and tools, the system-agnostic tweaks and tools should all work.\n- Added \"Directory Deduplicator\" tool\n- Added \"Vision\" section to Bulk Prototype Token Editor\n- Fixed Item Importer handling of Wand of the War Mage and Holy Water\n- Fixed \"Display Missing Health\" token option breaking under certain conditions\n- Fixed Class Importer crashing when importing subclasses with multiple choices of spell set (e.g. Land Druid)"
	},
	{
		"ver": "1.3.0",
		"title": "More Buttons",
		"date": "2020-06-13",
		"txt": "- Added Popout support to Scene/Item/Journal/Table/Art Browser windows\n- Added \"preview\" (click and hold) and \"import\" buttons to Importer lists\n- Improved styling of 5etools hover windows\n- Improved Spell Importer damage parsing, and allowed damage to be specified manually (notably used to improve damage rolls of Magic Missile)\n- Fixed homebrew adventures/books failing to load their linked creatures/etc.\n- Fixed bug where Multiattack Roller would send one message per connected player\n- Journal entries can now be toggled between Text/Image mode when Journal Embeds are enabled (although you have to manually re-open the entry)"
	},
	{
		"ver": "1.3.1",
		"date": "2020-06-20",
		"txt": "- Added support for main site data changes"
	},
	{
		"ver": "1.4.0",
		"title": "Online Classes",
		"date": "2020-07-12",
		"txt": "- Class Importer:\n  - Overhauled to handle new classes data format, including better splitting of text into individual features\n  - Added support for choosing from between multiple features (e.g. Fighting Styles)\n  - Improved parsing of text to extract extra information, such as durations, dice rolls, action types, and proficiencies\n  - Class and Optional Feature importers now pull from Foundry's SRD compendiums (where available) to enhance imported data\n  - Added ASI/feat picker when gaining an \"Ability Score Improvement\" feature\n- Added warning when importing more than 100 entities (as this can severely impact game performance). This warning can be disabled in the config.\n- Added advanced config option to use \"local\" image files rather than those from the 5e.tools server; note that this requires the contents of the 5etools \"image\" zip (available from get.5e.tools) to be present in the module directory\n- Added advanced config option to disable \"local\" data loading, forcing all data to be loaded from the 5e.tools server, or a custom server URL if one is provided\n- Fixed Race importer not setting token vision\n- Fixed file importer failing to function fruitfully\n- Fixed \"quick import\" buttons in Importer lists failing when importing homebrew\n- Fixed \"Fast Animations\" config setting affecting non-token animations, which could subtly break other systems\n- (Hopefully) Fixed BetterRolls support for Multiattack Auto-Roller\n- (Hopefully) Fixed Pop Out failing due to missing CORS headers"
	},
	{
		"ver": "1.4.1",
		"date": "2020-07-13",
		"txt": "- Fixed features with optional tool proficiencies failing to import"
	},
	{
		"ver": "1.4.2",
		"date": "2020-07-19",
		"txt": "- Improved overlay z-index compatibility with Foundry windows, hopefully preventing incorrect window/overlay ordering\n- Improved Class Importer UI for Ability Score Improvements\n- Fixed rare Class importer crash"
	},
	{
		"ver": "1.4.3",
		"date": "2020-07-20",
		"txt": "- Fixed class features with non-homebrew sources in homebrew classes crashing the Class Importer\n- Moved the option to import creatures with CR scaling/renaming to a button in the Creature Importer\n- Added workaround for missing player permissions when selecting a feat in the Classes Importer ASI dialogue"
	},
	{
		"ver": "1.5.0",
		"title": "Get In",
		"date": "2020-07-26",
		"txt": "- Added Vehicle Importer\n- Class Importer now correctly sets hit dice on classes imported to the items directory (although the recommendation is still to use the on-sheet importer, as it has additional functionality)\n- Multiattack Roller now handles additional cases"
	},
	{
		"ver": "1.6.0",
		"title": "Spend It All",
		"date": "2020-08-29",
		"txt": "- Added support for D&D 0.9.5, specifically the \"physical damage\" resistance/etc. changes\n- Added starting equipment picker to Class Importer; either picking from the available default equipment, or using a shop UI to buy starting items\n- Class Importer now always orders classes before subclasses, even when sorting in reverse-name order\n- Class Importer will now prefer \"always prepared\" subclass spells over existing \"regularly prepared\" spells, switching matching spells to \"always prepared\" as required\n- Images imported from the Art Browser may now be placed as Journal Notes\n- Cancelling an import will now post an \"import cancelled\" message in the task manager UI, rather than an \"import success\" message\n- Fixed Class Importer failing to fill spellcaster spell slots on levelling up\n- Fixed Class Importer failing to fill Pact Magic spell slots\n- Fixed duplicate homebrew listings appearing in Importer source lists\n- Fixed extra curly braces being rendered in imported adventure/book texts\n- Fixed Item Importer failing to import items to folders\n- Fixed Item Importer failing to set range for melee weapons"
	},
	{
		"ver": "1.6.1",
		"date": "2020-08-30",
		"txt": "- Fixed various bugs related to an internal API change (adventure/book content failing to populate; Class Feature Variants failing to show in filters)\n- Fixed Class Importer failing to import Gloom Stalker level 3"
	},
	{
		"ver": "1.6.2",
		"date": "2020-08-30",
		"txt": "- Simplified Class Importer list selection when importing a class to an actor\n- Class Importer now greys out class levels an actor (probably) already has\n- Fixed importers getting stuck in actor/journal mode when switching between actor/journal importing"
	},
	{
		"ver": "1.6.3",
		"date": "2020-08-31",
		"txt": "- Added \"Skip\" buttons to various Importer (primarily Class Importer) dialogues\n- Added experimental UI config option to remove the minimum mouse movement distance required to start a freehand drawing\n- Fixed Class Importer failing to load class data when importing a homebrew subclass\n- (Regenerated compendiums)"
	},
	{
		"ver": "1.7.0",
		"title": "No Plan Survives Contact with your Friends",
		"date": "2020-09-13",
		"txt": "- Importers may now load multiple data sets simultaneously. This can be used to, for example, load a homebrew file alongside 5etools' data, presenting both in one list.\n- Added starting equipment import step to Background Importer\n- Added \"Equipment Shop\" option to character sheet menu, which presents a mostly-identical UI to the class/background starting equipment screen\n\n- Creature Importer\n  - Now splits out Versatile damage where appropriate (as opposed to adding it as a secondary damage roll)\n  - Added config option to choose which spellcasting trait takes priority for creatures with multiple spellcasting traits\n  - Can now parse saving throws in traits (previously, only actions were checked)\n  - Improved parsing of dragon breath weapon attacks, to include targeting information, and splitting multi-modal breath weapons into their individual sub-modes. And, they now have a different icon!\n  - No longer skips skill/save bonuses if they aren't a perfect match with expected proficiency/expertise values. It will now instead choose proficient or expertise depending on which is closer to the original score. (Note that this will result in discrepancies between the original creature's skill/save bonus and the imported creature's, which will be ironed out in a future update.)\n  - Fixed some cases of parsing damage which must be dealt to the creature as damage the creature can output (e.g. \"the grapple can be broken by dealing 6 slashing damage to [the creature]\")\n\n- Spell damage data is now loaded from the SRD compendium where available, as this hand-curated data is more reliably correct\n- \"Choose Skills\" dialogues now display the ability score each skill is linked to\n- Fixed barding being imported as loot, rather than equipment (armor)\n- Fixed Importers failing to de-select list items post-import\n- Fixed Class Importer failing to import items chosen from equipment sets in the equipment import step\n- Fixed Class Importer crash on missing equipment data\n- (Regenerated compendiums)"
	},
	{
		"ver": "1.7.1",
		"date": "2020-09-15",
		"txt": "- (Added content from Icewind Dale: Rime of the Frostmaiden)"
	},
	{
		"ver": "1.7.2",
		"date": "2020-09-16",
		"txt": "- Fixed Table Importer failing to load"
	},
	{
		"ver": "1.8.0",
		"title": "Insert Package Joke Here",
		"date": "2020-09-20",
		"txt": "- Replaced Adventure Importer \"Worlds\" repository link with \"Package Importer,\" a UI for directly importing pre-built modules/worlds. Massive thanks to @ Modnar for providing the modules, worlds, misc data, and infrastructure to allow this to happen.\n- Split Adventure/Book Importer \"Configure and Import\" UI into two tabs: one for the \"classic\" importer which pulls actors, items, and journal entries from 5etools; one which attempts to find an available module/world in the above Package Importer tool for the currently selected source. \n- Creature Importer now correctly handles pact magic slots\n- Fixed Class Importer default starting equipment failing to combine stacks of items\n- Fixed image paths containing apostrophes failing to render in chat cards/sheet item thumbnails"
	},
	{
		"ver": "1.8.1",
		"date": "2020-09-22",
		"txt": "- Fixed Table Importer failing to import"
	},
	{
		"ver": "1.9.0",
		"date": "2020-09-25",
		"txt": "- Added experimental Journal Entries Config option to allow \"@EmbedJournalEntry\" syntax\n- Importing 2nd-level Warlock in the Class Importer now presents an Eldritch Invocation selection dialogue\n- Eldritch Invocation images and data are now pulled from the SRD, where available"
	},
	{
		"ver": "1.10.0",
		"date": "2020-09-26",
		"txt": "- Added \"Import and Set Preparation Details\" alt-import button to Spell Importer. This functions similarly to the Creature Importer's \"Import with CR Scaling/Renames\" button, opening a UI which allows spell preparedness/preparation mode to be set as part of the import.\n- Added Spell Importer Config options to control spell preparedness/preparation mode when importing spells as items\n- Made the default config set more \"opinionated,\" i.e. more optional extras are enabled by default"
	},
	{
		"ver": "1.10.1",
		"date": "2020-09-27",
		"txt": "- Fixed Creature Importer and Vehicle Importer crash"
	},
	{
		"ver": "1.10.2",
		"date": "2020-09-27",
		"txt": "- Fixed Importer custom URL sources"
	},
	{
		"ver": "1.11.0",
		"date": "2020-10-02",
		"txt": "- The Race Importer now sets damage resistances, damage immunities, and condition immunities when importing a race to an actor"
	},
	{
		"ver": "1.12.0",
		"date": "2020-10-10",
		"txt": "- Tweaked UI for Race/Background Importer skill/language/tool proficiency popups, to reduce the number of popups, show more information, and help avoid double-picking the same proficiencies.\n- Race Importer now attempts to load race and race feature icons from the SRD compendium\n- Added advanced Config options to control whether or not bio/description text is imported when importing most entity types\n- Improved workaround for CR-less creature proficiency bonus detection, mitigating some cases where a creature's save/skill bonuses could become incorrectly inflated\n- Added workaround for DND5e 0.9.8 bug where levelling up a non-SRD class causes crashes to Class Importer\n- Added compatibility for 0.7.x token validation, avoiding case where token-less creatures/vehicles would crash the Creature/Vehicle importer"
	},
	{
		"ver": "1.12.1",
		"date": "2020-10-12",
		"txt": "- Pressing ESC now closes open Plutonium title dropdown menus\n- Restored compatibility with dnd5e system versions <0.9.8"
	},
	{
		"ver": "1.12.2",
		"date": "2020-10-13",
		"txt": "- Fixed Race Importer crash when a proficiency type is not defined on a race"
	},
	{
		"ver": "1.13.0",
		"date": "2020-10-18",
		"title": "Triskaidekaphobia",
		"txt": "- Added \"Duplicate Handling Mode\" to Importer config. This allows duplicate imports to be skipped/overwritten when importing, rather than filling your directories with junk copies.\n  - Functions in both directories and compendiums, but not within sheets (i.e. does not deduplicate sheet items when importing)\n  - Note that this involved sweeping changes to every importer. Expect bugs.\n- Table Importer now converts inline rolls to Foundry's [[/r ...]] format, allowing the sub-rolls to be rolled from chat cards\n- Fixed Class Importer Ability Score Improvement screen failing to handle Foundry's new numbers-as-strings data format\n- (Updated module `\"compatibleCoreVersion\"` to reflect current compatibility target)"
	},
	{
		"ver": "1.13.1",
		"date": "2020-10-21",
		"txt": "- Added Config options to control the default expanded/collapsed state of embedded journal entries\n- Added SHIFT-click to mass expand/collapse embedded journal entries\n- Fixed rare Race Importer crash, affecting races with notes in their entries "
	},
	{
		"ver": "1.14.0",
		"date": "2020-10-21",
		"title": "Interoperability",
		"txt": "- (0.7.x) Moved directory buttons to match new layout\n- (0.7.x) Added Config option to hide directory buttons\n- Fixed Polymorpher crash\n- Fixed Polymorpher list \"quick import\" buttons importing via main importer rather than polymorph importer\n- Fixed Embedded Journal URL option breaking quick-switching between \"Text\" and \"Image\" journal entry modes\n- Split README backend mod installation section into 0.6.x and 0.7.x parts\n- (Server) Added 0.7.x version of backend mod (and moved copies of `plutonium-backend.js` files to version folders)"
	},
	{
		"ver": "1.14.1",
		"date": "2020-10-23",
		"txt": "- (0.7.x) Fixed Art Browser crash during module initialization\n- (0.7.x) Fixed incompatibility with Dynamic Active Effects module when importing armor items to an actor\n- (0.7.x) Fixed sheet items missing from actors when imported to a compendium\n- Added Popout and Delete All buttons to compendium headers\n- Fixed incompatibility with Obsidian sheet"
	},
	{
		"ver": "1.14.2",
		"date": "2020-10-24",
		"txt": "- Fixed the Class Importer crashing when importing subclasses to the items directory\n- The \"Fast UI Animations\" Config option is no longer enabled by default, as it causes sheets to fail to correctly close for some users. If you have to refresh to be able to re-open a sheet after closing it, disable this option."
	},
	{
		"ver": "1.14.3",
		"date": "2020-10-24",
		"txt": "- Fixed Table Importer failing to convert \"00\" in d100 results to \"100\"\n- The Class Importer now exposes class/subclass source information as flags on created sheet items, adding potential for better integration with other modules"
	},
	{
		"ver": "1.14.4",
		"date": "2020-10-25",
		"txt": "- Improved compatibility with Dynamic Active Effects for creature ACs, avoiding cases where an incorrect AC value would be set by DAE from a creature's equipped armor\n- Fixed Item Importer failing to set image when importing to the items directory/compendiums"
	},
	{
		"ver": "1.14.5",
		"date": "2020-10-25",
		"txt": "- Fixed broken links in journal entries created by Adventure/Book Importer and Table Importer"
	},
	{
		"ver": "1.14.6",
		"date": "2020-11-08",
		"txt": "- Added support for dnd5e v0.99\n  - New speed data is now populated\n  - New Diamond Soul flag is now set when importing the appropriate Monk level\n  - Added workaround for Foundry crash on levelling a class sheet item\n- (0.70x) Fixed Streamer Mode failing to rename compendiums\n- Fixed cases where Importer filters were not being cleaned up correctly, resulting in e.g. the Sources filter being blank\n- Fixed Creature Importer handling bonus weapons which do not state the bonus in the weapon name, e.g. Githyanki Knight's Silver Greatsword\n- (Regenerated compendiums)"
	},
	{
		"ver": "1.14.7",
		"date": "2020-11-16",
		"txt": "- Spells imported as part of a race now include their usage limits\n- Added/improved Creature Importer parsing of some statblock elements to handle new formats introduced in TCE\n- Fixed Background Importer raising a (harmless) error on completing some import options\n- (Regenerated compendiums)"
	},
	{
		"ver": "1.14.8",
		"date": "2020-11-18",
		"txt": "- Fixed Class Importer failing to load chosen feats in the Ability Score Improvement UI\n- Fixed rare crash when importing text containing skill proficiencies"
	},
	{
		"ver": "1.15.0",
		"title": "All the Small Things",
		"date": "2020-11-23",
		"txt": "- Creature Importer\n  - Sheet items now use SRD compendium art where available\n  - Legendary resistances and legendary actions now consume the appropriate sheet resource when used\n  - \"Split\" breath weapons (found on e.g. good-aligned dragons) now reference their parent breath weapon, in order to correctly handle charge usage\n  - \"Eye Ray\" actions are now split into one sheet item per ray (rather than the previous single item for all rays)\n- Added custom handling when drag-dropping Plutonium-imported items (classes, races, backgrounds) to actor sheets. The UI flow found when importing an item directly to the sheet is now triggered, rather than Foundry's default of creating a sheet item with static information. Note that this change is not retroactive; previously-imported items will drag-drop as before.\n- Added rudimentary action/equipment/weapon import to Vehicle Importer\n- Improved Multiattack Roller compatibility with Midi QoL\n- Added config option to hide \"Import\" buttons to users below a certain role\n- Added \"Thumbnail Size\" slider to Art Browser\n- Art Browser now displays its current drop mode in the window title (in addition to displaying it on the cycler button in the UI)\n- Added deduplication step to Importer list, which hides duplicates when selecting overlapping sources\n- Fixed ESC presses \"closing\" popped-out windows\n- Popped-out windows now close immediately, rather than re-opening in the main window, when their containing browser window is closed\n- Fixed Polymorpher failing to load creature data\n- (Regenerated compendiums)"
	},
	{
		"ver": "1.15.1",
		"date": "2020-11-24",
		"txt": "- Fixed various races failing to import"
	},
	{
		"ver": "1.15.2",
		"date": "2020-11-27",
		"txt": "- Added Config option to disable Plutonium-specific drag-drop handling, or to prompt the user each time\n- Importing the Artificer via the Class Importer now prompts the user to load their spell list\n- Fixed importer incorrectly deduplicating content, resulting in only the first selected source being displayed when selecting multiple sources\n- Fixed skill imported skill proficiencies not matching the proficiencies selected"
	},
	{
		"ver": "1.15.3",
		"date": "2020-11-29",
		"txt": "- Fixed Adventure/Book Importer crash when attempting to deduplicate content"
	},
	{
		"ver": "1.16.0",
		"title": "Healthy Growth",
		"date": "2020-12-04",
		"txt": "- Added option to increase HP on levelling/adding class to Class Importer\n- Added Config option to use a creature's/vehicle's token image over its portrait image when populating its sheet portrait during import\n- Fixed Class Importer incorrectly handling drag-dropped subclass items\n- Fixed Shop send-to-right button functionality being bound to the \"preview\" button\n- (Electron) Fixed item drag-drop override causing further text input to fail until the app is minimized/re-maximized\n- (Server; Optional; v0.1.7) Improved error logging"
	},
	{
		"ver": "1.16.1",
		"date": "2020-12-09",
		"txt": "- (Server; v0.2.0) Added package importer, replacing the previously-default Foundry importer (removed in Foundry 0.7.8). Note that this was removed from Foundry due to security concerns; install the backend mod at your own risk.\n- When attempting to install a package via the Package Importer, if the modded backend is not detected, a list of manifest links will be presented for the user to manually install via Foundry's regular \"Setup\" flow. With the modded backend installed, this functionality can be force-enabled via a config option.\n- Fixed Class Importer crashing on missing hit dice (e.g. sidekick classes)\n- Fixed Creature Importer failing to recognise some area effect formats (e.g. abominable yeti)"
	},
	{
		"ver": "1.16.2",
		"date": "2020-12-12",
		"txt": "- Improved compatibility with Dungeon World game system\n- Fixed Class Importer skipping equipment import\n- Added compatibility with dnd5e v1.2.0"
	},
	{
		"ver": "1.16.3",
		"date": "2020-12-18",
		"txt": "- Updated Polymorph \"Wildshape\" mode to match latest dnd5e version\n- Fixed Importer crashing when importing certain non-SRD creatures\n- Fixed Importer crashing when used as a player\n- Importer is now tolerant of broken entity \"source\" data, improving compatibility with some modules\n- (Regenerated compendiums)"
	},
	{
		"ver": "1.17.0",
		"date": "2020-12-26",
		"title": "Forced to Use a Laptop Screen Over Christmas",
		"txt": "- Added UI Config option to \"Compact Chat.\" This hides the author header for messages from an author after their first (within a time limit), to mimic the functionality of most modern chat apps. This, unfortunately, hides the \"delete\" button, so you can hold down SHIFT while hovering over a message to reveal the header.\n- Improved Starting Equipment UI to allow items to be purchased with gold while also gaining default starting equipment. This is useful in cases where you already have a gold amount entered into a sheet (e.g. from a background), and add class levels afterwards.\n- Fixed Art Browser button show/hide Config options failing to hide the correct buttons \n- Fixed Class Importer crashing when cancelling level selection"
	},
	{
		"ver": "1.18.0",
		"date": "2020-12-29",
		"title": "Perfidious Packaging",
		"txt": "- Feat Importer can now modify ability scores \n- Feat Importer can now import spells associated with a feat\n- Improved Spell Importer handling of various additional spell source, to (hopefully) improve the accuracy of preparation modes and use counts\n- All importers will now ask the user for confirmation before modifying an actor's ability scores (previously, no-choice ability score increases would always be applied) \n- Migrated hard-coded \"is prepared spellcaster\" check in Class Importer to class data, to allow homebrew classes to import spell lists in the future\n- Added rudimentary language import step to Class Importer, which currently ensures Druids learn Druidic, and Rogues learn Thieves' Cant. This will be expanded in future to support subclasses (e.g. Draconic Sorcerer), and learning languages at higher levels\n- (Fixed issue with package compilation which prevented the previous release from actually releasing)"
	},
	{
		"ver": "1.18.1",
		"date": "2021-01-03",
		"txt": "- Overhauled Importer \"Additional Spells\" UI, used when races, feats, or subclasses provide additional spells during\n- Fixed a piece of flawed library code which had introduced about ten very subtle, but very nasty, bugs. The effect of these bugs was to either reduce import performance, or to partially delete to-be-imported data in some rare cases."
	},
	{
		"ver": "1.19.0",
		"date": "2021-01-11",
		"title": "Come Kill Me, I'm Verified",
		"txt": "- Added popout (to new window) buttons to popped-out sidebar tabs (e.g. Combat Tracker)\n- Added warning message when probably about to delete a non-transformed actor after a player clicks the \"Restore Transformation\" button on a transformed actor. Root cause of this behaviour still unknown.\n- Vehicle Importer now sets the actor's speeds to a reasonable interpretation of the vehicle's speed, within the restrictions of the sheet\n- Fixed Vehicle Importer crash on parsing certain speed types\n- Added support for gaining feats to Race Importer (i.e. Variant Human and Custom Lineage)\n- Fixed Creature Importer \"Rename\" functionality mangling text, when that text contains a longer word containing the creature's original name (e.g. \"imp\" in \"impeding\")\n- Added workaround for Item Importer failing to import \"equipment\"-type items as \"equipped\"\n- Improved Item Importer's classification of items as \"equipped\" or \"not equipped,\" now providing a reasonable guess based on item type\n- Fixed Compact Chat hiding skill names\n- Fixed Compact Chat incorrectly hiding headers in some cases\n- (Verified compatibility with dnd5e v1.2.2)"
	},
	{
		"ver": "1.20.0",
		"date": "2021-01-24",
		"title": "Stay Wrapped",
		"txt": "- Migrated Foundry/dnd5e patching to libWrapper\n- Added stub Plutonium settings to Foundry's \"Module Settings\" tab, with a button to open the main Plutonium Config\n- Added Config option to set minimum permission level required to use the Equipment Shop\n- Added support to Class Importer for gaining optional features at specified levels; currently used to prompt for choosing Eldritch Invocations when importing Warlock\n- Added support for \"characteristics\" (trait/ideal/bond/flaw) to Background Importer\n- Added Config option to import on-failing-save secondary attack damage (e.g. a the poison damage of a Giant Spider's bite) as \"Other Formula\" rather than a damage roll. This may improve compatibility with other modules, e.g. Midi-qol\n- Fixed Polymorph failing to add sheet items\n- Fixed various Importer UI bugs (e.g. Polymorph importer's buttons saying \"Import\" instead of \"Select\")\n- Fixed Creature Importer failing to locate sheet item icons (and slightly expanded those that it can locate, besides)\n- Fixed \"expanded spell list\" spells (i.e. Warlock subclass lists) importing as innate/always prepared spells\n- Fixed Multiattack Roller infinitely looping when detecting a \"multiattack\" action within the clicked multiattack action, and improved detection of some action types\n- Widened initial Art Browser window on narrow screens, to avoid hiding UI"
	},
	{
		"ver": "1.21.0",
		"date": "2021-02-06",
		"title": "Auspicious",
		"txt": "- Added support for choosing spell ability from a list of options presented by race [notably found in the UA2021: Gothic Lineages]\n- Added support for \"weighted\" ability scores [5etools' representation of those found in the UA2021: Gothic Lineages]\n- Added Polymorpher support for CR scaling/renaming [the button was previously displayed, but had no effect]\n- Reworked Importer list \"preview\" button (previously, an \"eye\" button you had to click-and-hold) to be an expandable drop-down set in-line in the list\n- Tweaked Importer list styling, adding borders and on-hover highlights to improve visual clarity\n- Added \"Find Active Effect Attribute Key\" button to rows in \"Effects\" tab of Configure Active Effect windows. This brings up a list of (hopefully) all available active effect attribute keys for the actor/item effect you're configuring. For those of you who use DAE, this is similar to the dropdown it provides for quickly selecting a key. As such, Plutonium's version  can be disabled in the Config for UI. [This was added mainly for my own benefit as I explore Active Effects, and may not be a permanent fixture]\n- Improved Starting Equipment/Equipment Shop UI, adding better visual hinting when gold has been rolled, and adding more navigation options\n- Improved compatibility with the Forien's Quest Log module\n- Improved Spell Importer dice parsing\n- Fixed Background Importer off-by-one error when rolling for characteristics\n- Fixed Equipment Shop failing to load its saved and/or default item list\n- Fixed Equipment Shop failing to correctly set an actor's currency on confirming a transaction\n- Fixed Package Importer list highlighting when clicking between selections\n- Fixed Item Importer splitting \"atomic\" collections of items (e.g. \"Bag of Ball Bearings (1,000)\") into their constituent items on import. If you still wish to import 1,000 individual Ball Bearing items, a Config option has been provided to disable this new behaviour.\n- Fixed Race Importer double-applying skill proficiencies in some cases \n- Added Rivet support for routePrefix'd game URLs [this update should have already been live in the Chrome and Firefox extension stores for some time]\n- (Added Rivet source to download)"
	},
	{
		"ver": "1.21.1",
		"date": "2021-02-06",
		"txt": "- (Compatibility/syncing with 5etools filter fix)"
	},
	{
		"ver": "1.22.0",
		"date": "2021-02-10",
		"title": "Better Late than Never?",
		"txt": "- Added Config option to populate item (as in, 5e items, not Foundry items) active effects on import\n- Added Config option to use alternate active effect calculations, which support Foundry's roll \"@variable\" syntax (familiar for any DAE users)\n- Added warning message when DAE is enabled, and automatic disable for some features which are known to cause conflicts (the two mentioned above, as well as the extra \"Active Effect Attribute Key Helper\" button shown when configuring active effects)"
	},
	{
		"ver": "1.23.0",
		"date": "2021-02-15",
		"title": "True Care, Truth Brings",
		"txt": "- Added active effect generation to Item Importer for damage resistance/immunity/vulnerability and condition immunity\n- Improved Item Importer and Creature Importer DAE compatibility (and as such, removed warning notifications when both are active)\n- Improved active effect config UI tweaks, by adding a \"Priority\" field and improving the visuals. The Config option to enable/disable the tweaks has been renamed to \"Expand Active Effect Config.\"\n- Innately cast spells imported by the Race Importer are now imported with their appropriate casting level baked in (for example, a Tiefling's Hellish Rebuke is now set to 3d10 fire damage rather than 2d10). [The dnd5e sheet doesn't allow casting level to be chosen for innate spells, so the damage roll was always missing a die. This \"workaround\" may be removed if this changes in future.]\n- In the Class Importer, a special \"Unarmed Strike\" weapon is now created when importing the Monk class\n- The Class Importer can now create active effects for increased movement speed; this is currently used to create an Unarmored Movement effect for Monk, and a Fast Movement effect for Barbarian\n- The Class Importer now creates \"Unarmored Defense\" active effects\n- Added Config option to import fluff images to creature biographies (Creature Importer) and vehicle descriptions (Vehicle Importer)\n- Added Config option to set attunement type for items which would import with attunement requirements in Item Importer\n- Added (GM only) Config option to scale the prices in the Equipment Shop\n- Added rudimentary Supernatural Gifts and Rewards Importer\n- Improved visual clarity of Config search results (the sidebar is now greyed out for sections which contain no results)\n- Fixed incorrect active effect key being used for items which increase spell attack\n- Fixed extended active effect parser crashing the module's loading process in the presence of a broken active effect\n- Fixed price info not being populated on creature equipment\n- Improved performance of list rendering [by making the buttons uglier!]\n- (Removed fallback Art Browser image loader, as this depended on an external website which has since become too restricted to be of use)\n- (Regenerated compendiums)"
	},
	{
		"ver": "1.23.1",
		"date": "2021-02-27",
		"txt": "- Added support for ability check bonuses to Item Importer active effects (i.e. Stone of Luck)\n- Added \"Base/Unarmored AC\" active effect when importing a class, calculated as 10 + Dexterity modifier\n- Added a Config option to include a class' table when the the Class Importer generates a description for a class items  \n- Improved compatibility with Drag Upload; some meaningless errors thrown by the Art Browser are now squashed if it is detected\n- Improved compatibility with Obsidian module; importing items with active effects should no longer brick your sheet\n- Fixed Creature Importer attempting to create active effects for ACs when importing to compendiums; as compendiums do not (yet?) cleanly support active effects, the AC is now instead imported as a static value\n- Fixed compatibility with DAE; active effect config enhancements will now be correctly disabled if DAE is detected  \n- Fixed Feat Importer failing to set sheet flags (for e.g. Observant)\n- Fixed interaction between \"Import: Use Strict Entity Matching\" and \"Import: Duplicate Handling Mode\" Config options; non-strict matching will now be correctly applied when searching for duplicates\n- Fixed Class Importer's ASI feat display\n- Fixed rare Class Importer crash when importing/rendering embedded tables\n- (Brew) Standardised usage of \"foundryData\" on entities, and and \"foundryX\" entities (e.g. \"foundrySpell\"), to work on just about anything that can be imported"
	},
	{
		"ver": "1.23.2",
		"date": "2021-02-28",
		"txt": "- Fixed crash when importing homebrew classes"
	},
	{
		"ver": "1.24.0",
		"date": "2021-03-12",
		"title": "Positive Effects",
		"txt": "- Added racial weapon/armor proficiency import to Race Importer\n- Race Importer can now set active effects; this is used to add natural armor effects\n- Feat Importer can now set active effects; this is used to add movement speed modification effects\n- Added support for choosing race (lineage) size to Race Importer\n- Added custom scaling spell formulas to various spells which don't cleanly fot into dnd5e's damage roll/scaling schema (thanks @ BaumMeister)\n- Added various feature selection steps to Class Importer (artificer infusions, arcane archer options, ...) \n- Fixed Race Importer clobbering damage resistance/vulnerability/immunity and condition immunity when setting unrelated values\n- Fixed Class Importer failing to respect \"required\" options in choice sets, e.g. Four Element Monk's \"Elemental Attunement\" discipline\n- Fixed Creature Importer failing to preserve original actor's folder when overwriting duplicates\n- Fixed Item Importer crash when drag-dropping a homebrew item, imported to the item directory, to an actor\n- Fixed Equipment Shop adding rolled gold to sheet as copper pieces\n- Fixed Config resetting empty-able dropdowns with non-empty defaults on reload\n- Fixed Rivet failing to find tabs with URLs containing trailing junk (e.g. \"#\" or \"?\")\n- (Regenerated compendiums)\n"
	},
	{
		"ver": "1.24.1",
		"date": "2021-03-17",
		"txt": "- Fixed Importer previews failing to render\n- Improved Item Importer detection of non-\"loot\" items\n- Improved Auto-Roll Multiattack parsing"
	},
	{
		"ver": "1.25.0",
		"date": "2021-03-28",
		"title": "Ensmoothening",
		"txt": "- Class Importer now imports effects from the SRD (e.g. Barbarian's Rage effect) where available\n- Item Importer now imports effects from the SRD where available [although none are currently available]\n- Spell Importer now imports effects from the SRD where available\n- Race Importer now imports effects from the SRD where available [although none are currently available]\n- Race Importer now uses race/base race image as a fallback when importing race features, reducing the number of features which are imported with a default Plutonium image\n- Item Importer now uses \"base item\" image as a fallback when importing magic items (e.g. Oathbow), reducing the number of items which are imported with a default Plutonium image\n- When opening the Creature Importer for a specific, official, adventure source, the red \"Adventure NPC\" filter will be automatically removed\n- Added Creature Importer Config option to append CR/type \"tag\" suffixes to creature names on import\n- Added a \"re-open last used importer\" button to the \"Plutonium Import\" button at the top of relevant directories\n- Reworked Equipment Shop \"gold remaining\" display to show both the actor's remaining gold, as well as the \"shopping basket\" total cost of all to-be-purchased items\n- GM-only Config settings are now hidden from players by default; added Config option to reveal GM-only Config settings to players as read-only [i.e., restoring the default implementation prior to this update]\n- Tweaked preferred handling order for ESC key when \"Fix ESC Key\" Config option is active; the game menu will now always be closed on the first ESC press\n- Added Config option to disable the additional \"Open Game Menu\" added to the settings tab when the \"Fix ESC Key\" Config option is enabled\n- Added Art Browser Config option to disable scene auto-activate and scene config auto-display when creating scenes\n- Added Config option to add a \"Delete\" button to the context menu for scenes in the navbar\n- Added \"Show Players\" option to drop-down menu on actor and item sheets\n- Fixed Adventure Importer failing to find all creatures from some official adventures\n- Fixed Item Importer failing to set \"adamantine\", \"focus\", \"magical\", and \"silvered\" item flags\n- Fixed filter-selection windows failing to correctly clean up (resulting in blank windows) when re-opening the same filter-select window\n- Fixed some minor layout issues in the Importer\n- (Homebrew) Item Importer now supports an optional `\"foundryType\"` field, in which you can manually specify the exact Foundry item type an item should be imported as"
	},
	{
		"ver": "1.25.1",
		"date": "2021-03-31",
		"txt": "- Table Importer now attempts to link to Plutonium compendium data when importing rows which contain creature/spell/item links\n- Table Importer now correctly substitutes Foundry dice expressions for encounter tables\n- Improved Class Importer detection of existing features\n- Improved Importer auto-generation of max feature uses (it can now detect and output variables/formulas in some cases)\n- Fixed various Importers adding source suffixes to items imported directly to sheets when the \"Add Page Numbers to Sources\" is enabled\n- Fixed Class Importer inflating ability scores when applying ASIs, in the case where the actor has active effects which increase their ability scores\n- (Regenerated compendiums)"
	},
	{
		"ver": "1.25.2",
		"date": "2021-04-01",
		"txt": "- Fixed Class Importer using CON score, rather than CON modifier, when calculating HP increases"
	},
	{
		"ver": "1.26.0",
		"date": "2021-04-11",
		"title": "Background Check",
		"txt": "- Added support for second personality trait in Background Importer, as, RAW, you get two!\n- Added support for \"Customizing a Background\" rules to the Background Importer\n- The Spell Importer can now import spells as spell scrolls when importing to an actor. To do so, use the \"Import as Spell Scroll(s)\" button at the bottom of the importer's spell list.\n- Added system version check as part of startup, which warns you when your version of dnd5e (if you're using dnd5e) is older than Plutonium expects [currently, it doesn't warn if your version is too new, but this might change once I begin tinkering with 0.8.x; Soon:tm:]\n- Added Config option to prefix Adventure/Book Importer journal entries with a \"sort order prefix,\" which is a short alphanumeric tag that should be friendly to both Foundry's default directory sorting, and any modules that do alphabetical directory sorting\n- Journal entries created by the Adventure/Book Importer now specify sort ordering, to better preserve their sort order between reloads\n- Creature Importer now adds \"Special Equipment\" items to creature statblocks during import\n- Added \"Download Image\" button to Art Browser images (as an alternative to \"Copy URL\"), which will download the image to your current \"User Art Directory\" (as defined in the Config). Note that this requires the backend mod to function. [No changes were made to the backend mod, so if you already have it installed, you do not need to update it to benefit from this functionality.]\n- Fixed Item Importer crashing when active effect population disabled\n- Dice expressions containing multiplication/division signs are now correctly converted to \"*\" and \"/\"\n- Improved active effect system error detection; processing all actors will no longer fail due to one broken actor, and any individual broken actors will now log their IDs to console"
	},
	{
		"ver": "1.26.1",
		"date": "2021-04-17",
		"txt": "- Improved speed of Directory Cleaner\n- Fixed Creature Importer failing to add spellcasting traits\n- Added \"show/hide all previews\" buttons to the top of various list views (Importer, Equipment Shop, others)\n- Added \"Source\" and \"Category\" filters to Equipment Shop"
	},
	{
		"ver": "1.27.0",
		"date": "2021-04-25",
		"title": "More Stuff",
		"txt": "- Adventure/Book Importer now parses and loads embedded rules, creating and linking to them as journal entries\n- Added rudimentary Vehicle Upgrade importer\n- Added rudimentary Object importer\n- Improved Importer activation/uses parsing, to hopefully set more activation/use info on created features\n- Reworked how Config options are handled if conflicting modules are detected; an auto-disabled option is now greyed out, and has a tooltip which provides info on which module is producing the conflict (this information is also logged to the console as a warning)\n- Disabled the \"Auto-Roll Multiattacks\" Config option if Midi QOL is detected, as the two are no longer compatible\n- Improved Multiattack Roller parsing, reducing some cases of excess rolling\n- Reworked compendium generation method, to better handle (i.e. bypass, because they break things) active effects\n- Fixed filter window appearing under modal window when selecting \"additional spells\" during imports, requiring the latter to be closed before the former could be accessed\n- Fixed subclass item names when importing to the items directory\n- Fixed Importer \"Custom URL\" inputs de-selecting during typing\n- (Regenerated compendiums)"
	},
	{
		"ver": "1.27.1",
		"date": "2021-04-26",
		"txt": "- Fixed Creature Importer crash"
	},
	{
		"ver": "1.27.2",
		"date": "2021-04-26",
		"txt": "- Improved Class Importer handling of skill/language/tool/weapon/armor proficiencies from higher-level features\n- Fixed Class Importer crash"
	},
	{
		"ver": "1.28.0",
		"date": "2021-05-01",
		"title": "Eldritch Horrors",
		"txt": "- Added Plutonium-specific flags to data available in roll formulas for sheet items. This is currently limited to the item's name, which can be accessed as `@name`, or as `@srd5e.name.<whitespace/etc.-stripped item name>`. This enables, for example, the following (quite hideous) expression for Agonizing Blast bonus damage: `+(@srd5e.name.eldritchblast ? @abilities.cha.mod : 0)`.\n- Optional Feature importer now imports additional spells, as specified by a given feature. For example, importing \"Armor of Shadows\" will add an at-will \"Mage Armor\" spell to your sheet.\n- Added hacky \"Spell Points\" Spell Importer config option, which sets all imported spells to \"at will\" and assigns them a sheet resource value according to their spell point cost\n- Creature Importer now tags a creature's attacks as \"magic\" if they have the \"Magic Weapons\" trait\n- Fixed Item Importer failing to set \"firearm\" property for firearms\n- Item Importer now imports explosives as consumables\n- Fixed Optional Feature Importer failing to load Eldritch Invocation, Fighting Style, and Metamagic images/info from the SRD compendium\n- Fixed Equipment failing to simplify coinage from backgrounds, resulting in stacks of copper being added to the sheet rather than a handful of gold\n- Fixed Class Importer failing to add \"static\" (i.e., pre-defined; without choices) proficiencies from within class features\n- Fixed a case where Importers could repeatedly overwrite the same sheet proficiencies with multiple sets of proficiency data, resulting in only the last proficiency set being added to the sheet\n"
	},
	{
		"ver": "1.28.1",
		"date": "2021-05-04",
		"txt": "- Added \"Update Permissions?\" popup when attempting to show an actor sheet that one or more players do not have permissions over\n- Fixed Feat Importer crash when populating active effects\n- Fixed Creature Importer failing to folderize when importing to directory, after importing to compendium in the same session\n- Fixed Importer setting invalid spell ability when importing feats/etc. with variable spellcasting ability\n- Fixed Creature Importer failing to parse sense ranges containing numerical separators"
	},
	{
		"ver": "1.28.2",
		"date": "2021-05-07",
		"txt": "- Reworked Package Importer to use the in-game (scene) loading bar\n- Reworked Class Importer's use of dnd5e flags, to use class-item-linked active effects rather than hard-setting the flag\n- Fixed Show Sheet failing for item sheets\n- Fixed crash when using DAE without configuring DAE's settings\n- Fixed Race/Feat Importer failing to set spell saving throw ability for additional spells"
	},
	{
		"ver": "1.29.0",
		"date": "2021-05-30",
		"title": "Gestaltery",
		"txt": "- Added Class/Subclass Feature Importer\n - This has been split out of the Class/Subclass importer, and sports a variety of improvements to the way additional data (proficiencies, damage imm./res./vuln., condition immunities, spells granted) are handled\n- Added \"Size\" display to Package Importer list [which is currently blank, and will be populated when the data is made available]\n- Added support for main site Summon Spell Level scaling to Creature Importer\n- Fixed \"Prepend Active Scene Name to Browser Tab Name\" config option failing to rename browser tab if the active scene name was edited\n- Fixed Backgrounds importer failing to recognize some characteristics tables (notably in GGR content)"
	},
	{
		"ver": "1.29.1",
		"date": "2021-06-01",
		"txt": "- Added \"x/y rows visible\" counts to importer lists\n- Increased icon spell/feat icon resolution (from 48px to 96px, to better match the size used when editing an item), and converted icons to `.webp`"
	},
	{
		"ver": "1.29.2",
		"date": "2021-06-03",
		"txt": "- Force-disabled Journal \"URL Embeds\" Config Option if \"Kanka-Foundry\" is active, as the two are mutually incompatible\n- Fixed Creature Importer incorrectly tagging mundane weapons as \"magical\"\n- Fixed ex-SCAG TCE cantrips missing icon art\n- Fixed Background Importer crash when customizing language/tool proficiencies"
	},
	{
		"ver": "1.30.0",
		"date": "2021-06-21",
		"title": "Extra Buttons",
		"txt": "- Added \"Level Up\" button to player character sheets which have at least one level [assuming some other requirements are also met, such as: Plutonium can find data source(s) for your current class(es)]\n- Added Deity Importer\n- Added Recipe Importer\n- Added \"Save List\"/\"Load List\" functionality to actor Prepared Spell Mass-Toggler\n- Added support for skill/tool expertise to appropriate Importers\n- Added basic support for Strixhaven subclasses to Class Importer\n- Added option to disable generic description text (what \"Versatile\" means, for example) to Item Importer Config\n- Added Class Importer support for homebrew prepared spell caster spell lists\n- Added \"Compact\" UI Config option for macros directory\n- Directory Cleaner, Directory Deduplicator, and Bulk Permission Editor now support the macro directory\n- (Homebrew) Added support for \"foundryData\" to `\"item\"`s, `\"variant\"`s, `\"reward\"`s, and `\"monster\"`s\n- (0.8.x) Added Config options to control how importers set token data (most fields can be set to \"use game setting\")\n- Reworked Psionic Importer to import as features instead of spells\n- Reworked Package Importer to only include modules, as worlds are community-created and external to Plutonium. Community-created modules can be found in the [Foundry Worlds](https://discord.gg/7RJFVjt5Bf) Discord.\n- Fixed Class Importer using post-effect HP, rather than base HP, when calculating HP increases when levelling up\n- Fixed Importers adding shield proficiencies as text\n- Fixed Item Importer incorrectly importing \"loading\" property\n- Fixed formatting of description text imported by Creature/Vehicle/Object Importer\n- Fixed dice rendering in \"scaled by spell level\" creature hover windows\n- Fixed Plutonium directory buttons being rendered multiple times in the presence of certain modules (notably Giffyglyph's 5e Monster Maker)\n- (0.8.x) Fixed Importers failing to delete effects when overwriting existing content\n- (0.8.x) Fixed Bulk Prototype Token Editor failing to open\n- (0.8.x) Fixed Config dropdowns visually resetting when opening the Config Editor"
	},
	{
		"ver": "1.30.1",
		"date": "2021-06-24",
		"txt": "- Improved Config layout, and added individual \"Reset\" button to each setting\n- Added glow effect to Level Up button when at/above appropriate XP for level up\n- Improved performance of Level Up button rendering when repeatedly rendering sheet in quick succession\n- Removed spammy \"could not find class\" notifications produced by the Level Up button\n- Fixed Config returning junk data in rare cases (the source of recent \"bad permissions\" errors on import)\n- Fixed Config failing to display \"throwable\" items after resetting\n- Fixed Class Importer displaying \"additional spell\" dialogue outside of levels where the additional spells could be gained\n- Fixed Class Importer giving too much HP when adding 1st-level multiclass\n- Fixed Level Up button being activating on pressing `return` within sheet fields\n- Fixed Rules importer failing to create journal entries"
	},
	{
		"ver": "1.31.0",
		"date": "2021-06-25",
		"title": "Tags: #fixes #breaking #>using-the-compendiums",
		"txt": "- Removed built-in compendiums\n- Added 5etools \"@tag\" syntax equivalent, formulated as `@<tagName>[<name>|<source>|<...>]` (e.g. `@creature[goblin]`). This is used by the Table Importer, as a more flexible alternative to referencing built-in compendiums, when populating rows\n- Fixed Config returning junk data in even rarer cases (the _real_ source of recent \"bad permissions\" errors on import)\n- Fixed Level Up button \"Add New Class\" option adding all subclasses\n- Fixed Level Up button handling of second+ homebrew multiclass when levelling up"
	},
	{
		"ver": "1.31.1",
		"date": "2021-06-27",
		"txt": "- Improved Level Up button styling when using Tidy5e Sheet\n- (Restricted Level Up button to supported sheets only; currently, these are the default dnd5e sheet, and the Tidy5e sheet)\n- Fixed Level Up button disappearing/failing to render on sheet re-render\n- Fixed Config search result count display"
	},
	{
		"ver": "1.32.0",
		"date": "2021-07-11",
		"title": "The Boring Stuff",
		"txt": "- Added Config option to prefer rendering links as `@<tag>[...]`s, which is now the default. This means that, instead of rendering links to 5etools, Foundry-like actor/item/etc. document links will be rendered instead.\n- Note that these are not _true_ Foundry document links, and, as such, there's magic going on behind the scenes to make them behave sensibly. If anything is missing, or doesn't quite work how you'd expect, do let me know.\n- Added a config option to enable 5etools-link-like hover capabilities to these fake Foundry document links [disabled by default, as I found it felt more annoying than helpful]\n- Added Config option to split imported adventure/book content \"by contents\" or \"by heading,\" as opposed to the default/existing \"by chapter\"\n- Added Config option to make Class Importer create a default \"Unarmed Strike\" weapon when importing a class\n- Added cantrip selection step to Class Importer for spellcaster classes\n- Added folder path hierarchy display to Import Wizard \"Folder Path\" customizer\n- Added \"Feeling Lucky?\" button to Importer lists\n- Added GM-only \"Edit Config\" button to Equipment Shop, reducing the number of clicks required to e.g. set shop prices\n- Added various \"publication year/date\" options to Adventure and Book Importer pre-defined folder options\n- Added Export/Import buttons to Config Editor, which allow the entire config to be exported/imported between games\n- Added Spell Importer option to import as spell scrolls when importing to a directory/compendium (previously, this was limited to spells imported directly to actors)\n- Restored the Package Importer's ability to import worlds [as I have been informed that there should no longer be any scary copyright-infringing core worlds in the package index]\n- Fixed import de-duper handling of existing content when importing temporary entities\n- Fixed (harmless) error when SHIFT-clicking an actor `@<tag>[...]` link as a user with insufficient permissions to create actors\n- Fixed various subclass/race/background/etc. sources missing from spells, especially for homebrew\n- Fixed rare scene crash on \"missing health\" display trying to de-reference non-existent tokens\n- Deferred Creature Importer metadata loading until after main module load, to improve performance, and allow the error to be handled gracefully (instead of locking you out of e.g. the Config)\n- Fixed Config Editor failing to correctly reset/display reset state of empty strings\n- Fixed Background Importer crashing when trying to process @item tags in default starting equipment display text\n- Fixed rare text mangling when rendering embedded journal entries\n- (Brew) Fixed Class Importer failing to de-dupe classes in list views when loading homebrew subclasses\n- (Brew) Fixed Creature Importer crashing on poorly-formatted actions\n- (0.8.x) Reworked Race Importer token vision to be more aggressive in overwriting default values\n- (0.8.x) Fixed entities being imported to both directory _and_ compendium when importing to a compendium\n- (0.8.x) Removed un-needed directory render calls, which were inexplicably causing newly-created macros to open for everyone\n- (0.8.x) Fixed crash when opening the Bulk Prototype Token Editor \"Configure Editor\" window"
	},
	{
		"ver": "1.32.1",
		"date": "2021-07-11",
		"txt": "- Fixed journal entries failing to load when containing certain @tags\n- Fixed case where a hover window could become stuck open"
	},
	{
		"ver": "1.32.2",
		"date": "2021-07-12",
		"txt": "- Fixed crash when loading non-5e systems, and fixed opening Config Editor on non-5e systems [no guarantees that compatibility with non-5e systems will be continued in the future; use at your own risk]\n- Fixed Class Importer double-importing spells granted by features\n- Fixed crash when importing optional features via the Class Importer\n- (0.8.x) Fixed crash when loading with \"Disable Game Canvas\" Foundry setting enabled\n- (0.8.x) Fixed drag-dropping @tag items to sheets"
	},
	{
		"ver": "1.32.3",
		"date": "2021-07-12",
		"txt": "- _Really_ fixed crash when importing optional features via the Class Importer"
	},
	{
		"ver": "1.32.4",
		"date": "2021-07-18",
		"txt": "- Fixed Creature Importer crashing when attempting to import fluff images when fluff text is unavailable\n- Fixed Class Importer handling of homebrew optional feature progression\n- Fixed handling of nested importable + non-importable tags when rendering descriptions\n- Fixed compatibility with Module Sets module"
	},
	{
		"ver": "1.33.0",
		"date": "2021-07-18",
		"title": "Enhanced Coverage",
		"txt": "- Added rudimentary \"Actions\", \"Languages\", \"Cults & Supernatural Boons,\" and \"Other Character Creation Options\" importers [these are primarily useful in that they teach the importer how to handle `@action`, `@language`, ... `@tag`s, fixing various \"broken\" links]\n- Fixed the Class & Subclass Feature Importer failing to handle clicking on `@classFeature` and `@subclassFeature` `@tag`s\n- Re-implemented Adventure/Book Importer duplicate handling [previously disabled as it was incompatible with fine-grained section splitting]\n- Fixed rare case where Importer could fail to detect existing folder with a given name if the name was numeric\n- Fixed hovering skill/sense names failing to show a hover window (especially in 0.8.x)"
	},
	{
		"ver": "1.34.0",
		"date": "2021-07-27",
		"title": "Friend to Pareto",
		"txt": "- Added support for `@sense[...]`/`@skill[...]` tags\n- Added compendium \"Visibility Toggler\" tool, which allows compendium visibility to be set en-masse\n- Added option to adjust the threshold at which the token \"Display Missing Health\" option switches from white to red text (i.e., when is a creature considered \"bloodied\")\n- Added capability for Bulk Permission Editor to skip updating a row if it detects no changes would be made, and improved update performance\n- Fixed Spell Importer using different icons between sheet items and active effects\n- Fixed Creature Importer not converting `@tag`s to Plutonium equivalents in biographies\n- Fixed Importer crash when importing journal entries or rollable tables to compendiums when \"Duplicate Handling Mode\" is set to None\n- Fixed compatibility with Permission Viewer module [for the moment; unsure if the module itself is working as intended, or if the incompatibility is a symptom of a minor UI bug]\n- (0.8.x) Fixed Bulk Prototype Token Editor setting junk \"Display Name\" and \"Display Bars\" values"
	},
	{
		"ver": "1.35.0",
		"date": "2021-07-31",
		"title": "Divergence",
		"txt": "- (0.8.x) Added initial support for dnd5e 1.4.x\n  - AC Active Effects have been replaced with the built-in AC auto-calculation where possible, in both the Item and Creature Importers\n  - Tool items are now given subtypes as appropriate, and instruments/gaming sets are now imported as tools\n  - The Vehicle Importer now sets land, air, and water types\n  - The Class Importer now sets available class proficiencies on imported class items\n  - Importers now break down weapon proficiencies, and some tool proficiencies, into their respective individual types. [Notably in need of improvement is the handling of tools and tool proficiencies. This requires a major overhaul of various Plutonium systems and 5etools' data (and, by extension, homebrew), which would otherwise have significantly delayed this update. More to come Soon:tm:.]\n- Added `homebrew` directory, from which homebrew is automatically loaded by appropriate Importers\n- Added a \"Variants\" dropdown to the Creature Importer's \"Import with ...\" dialogue. This currently only lists \"Dragons as Innate Spellcasters\" variants, but will be expanded in future to allow other variant creature imports.\n- Fixed drag-drop \"Use Importer?\" prompt not appearing for actions, backgrounds, conditions/diseases, cults/boons, races, and spells\n- Fixed unused \"expanded\" additional spell choices appearing in Class Importer flows"
	},
	{
		"ver": "1.36.0",
		"date": "2021-08-07",
		"title": "Tweaking",
		"txt": "- Added source abbreviations as (hidden) searchable text to Importer source lists (so searching e.g. \"PHB\" now works)\n- Added Config option allowing additional local homebrew files to be specified (beyond those listed in `homebrew/index.json`)\n- Added Config option to force Importer to render dice as plain text (e.g. \"1d6\") instead of inline rollers (e.g. \"[[/r 1d6]]\")\n- Improved compatibility with Twilight UI (thanks @ arcanist)\n- Fixed Table Importer handling of structured \"rollable column\" data [most of the tables use plain text, but some tables embedded in e.g. Curse of Strahd use a fancier data structure]\n- Fixed nested Importers not correctly resetting their internally-tracked actor\n- Fixed Class Importer \"prepared spell\" import step failing to filter out existing prepared spells in some cases\n- Fixed various dice/etc. button formatting issues in text rendered by the Importer\n- Fixed journals with a URL set failing to re-open when closed and re-opened\n- (Brew) The Vehicle Upgrades Importer now creates active effects even when importing to a directory\n- (Brew) Fixed expand/collapse buttons on `\"dataX\"` headers, and removed spurious Rivet button from `\"dataX\"` names"
	},
	{
		"ver": "1.37.0",
		"date": "2021-09-04",
		"title": "Text Message Breakup",
		"txt": "- Added \"Save Imported Images to Server\" (disabled by default) and \"Save Imported Tokens to Server\" (enabled by default) Config options, which download any images referenced during import, and upload them to your Foundry server\n- Added \"Prefer Foundry/System Images\" and \"Prefer Foundry/System Tokens\" Config options, which set the preferred order in which images and tokens should be sourced \n- Reworked Background, Feat, and Race Importer handling of proficiencies, to better support choices such as \"choose one language proficiency or one tool proficiency,\" and to make full use of dnd5e's new (tool) proficiency changes\n- Item Importer now classifies more bonus-providing items as \"equipment\" instead of \"loot\"\n- Reworked Polymorpher to import a temporary actor to the Actors directory before applying it to the chosen sheet. This ensures AC calculations are correct, and should be a more robust method for ensuring all sheet values are correctly applies as the dnd5e system evolves. [The downside of this, is that crashes/bugs can now leave a junk actor in your directory, so if that happens, please report it as a bug!]\n- Added \"Class Level\" scaling support to Creature Importer \"Scale and Rename\" screen, for various (mainly) TCE creatures\n- Added support for `@class[...]` tags\n- Creature Importer will now attempt to roughly parse and set targeting information for creature actions\n- Table Importer now adds table headers to an imported table's \"description\" field, providing additional context for the table's rows\n- Table Importer now converts all `@tag`s, rather than only those that take up a full table row\n- Creature Importer now adds links from any \"Legendary Actions\" feature to the creature's legendary actions. This is achieved by way of a custom `@ActorEmbeddedItem` syntax, which functions much like Foundry's `@Actor` syntax, but with two \"name/ID\" parts instead of one. For example, `@ActorEmbeddedItem[Big Bad][Sword of Cutting]` would link to, and open, the \"Sword of Cutting\" item on \"Big Bad\"'s character sheet.\n- Added Mythic Action import step to Creature Importer\n- Added Config option to choose which resource the Psionics Importer uses for Psi Points\n- Background Importer will now use available fluff images to set the image for imported backgrounds/background features\n- (Brew) Added support for `foundryFlags` to (hopefully) all importers\n- Added inline list previews to Vehicle and Object Importers\n- Improved Creature Importer detection of \"physical\" damage immunity/resistance/vulnerability\n- Added leading operand to item skill/save/etc. bonuses, to prevent them from being concatenated together when applied from active effects\n- Fixed Item Importer failing to correctly set rarity\n- Fixed Background Importer failing to strip `@tag`s from characteristics text\n- Fixed \"Use Modded Package Installer\" being missing from Config Editor, which prevented it from ever being used\n- Fixed Feat Importer double-importing skill/language proficiencies when a choice of proficiencies was available\n- Fixed Multiattack throwing a junk error when the last of a consumable item was used"
	},
	{
		"ver": "1.38.0",
		"date": "2021-09-12",
		"title": "Tabulated Misdeeds",
		"txt": "- Import Wizard may now be opened from tables headers; when opened from a table, the Importer will add imported entities to that table as compendium link rows (the entities themselves are stored in auto-generated compendiums)\n- Creature Importer now uses \"parent\" action image for certain sub/linked actions, notably dragon breath weapon modes\n- Added Config setting to specify Importer image/token assets directory\n- Renamed module in Module Management app when Streamer Mode is enabled\n- Improved compatibility with Tidy5e's dark mode\n- Fixed token images failing to save locally unless \"Save Imported Images to Server\" option was also enabled\n- Fixed Table Importer duplicating rows when updating an existing table\n- Fixed Vehicle Importer crash when importing infernal war machines\n- Fixed Class Importer crash when importing Bladesinger Wizard\n- Fixed Spell Importer doubling up damage/etc. dice for SRD spells in rare cases\n- (Brew) Added expertise support to Race Importer\n- (Updated required dnd5e version to 1.4.3; using a lower version will display a warning notification)"
	},
	{
		"ver": "1.38.1",
		"date": "2021-09-13",
		"txt": "- Fixed Art Browser \"Drag-Drop Images As\" Config option being mis-labelled in Config Editor"
	},
	{
		"ver": "1.39.0",
		"date": "2021-09-22",
		"title": "Voted Least Likely to Be What You Need",
		"txt": "- Added rudimentary Trap and Hazard Importers\n- Added \"Avoid Disabling Animations for Ruler Movement\" Token Config option, which attempts to suppress the \"Disable Animations\" option (if enabled) when moving a token along a ruler path (when using `CTRL+drag` -> `SPACE`)\n- Added \"Wrap Long Folder Names\" UI Config option\n- Added a \"Create Named Token\" macro (as part of a compendium), which allows you to click on the scene and enter a name, and will create a Roll20-esque \"nameplate\" token at the clicked point\n- Added SHIFT-click to Importer list inline preview buttons, which previews fluff info (where available)\n- Added fine-grained permission Config options for all Plutonium-added tools\n- Added metric support for ranges to Item Importer, and for token vision ranges to Creature/Object/Vehicle Importers\n- Bulk Prototype Token Editor can now toggle token \"Link Actor Data\"\n- Reworked sheet header buttons to always prefer the \"compact\"/burger style, finally removing the ugly \"Tools\"/\"Import\" buttons\n- Added sort order display/carets to Importer lists\n- Added \"NPC HP Roll Mode\" Token Config option, which, when set, will modify how token HP is assigned on creation. Token HP may be rolled according to HP formula, or maximized, or minimized.\n- Added rudimentary bug report form to Config Editor; clicking the \"Report a Bug\" button will present you with a form similar to the one available from DiscordCrawler, with much of the required information pre-filled\n- Added Art Browser Config option to prefer saving files to the server over referencing external URLs \n- Added \"Allow Popout Chaining\" UI Config option, which, when enabled, will attempt to automatically pop out windows opened from already popped-out windows (previously, these were always opened in the main window)\n- (Brew) Renamed local homebrew `index.json` file to `index.template.json`, to avoid accidental overwrites\n- (Brew) Switched local homebrew from \"opt out\" to \"opt in;\" the `index.json` file is now only loaded if the \"Load Local Homebrew Index\" Import Config option is enabled\n- Fixed popped-out windows failing to close on main window close/refresh\n- Fixed Polymorpher requiring GM-only \"create/delete folder\" permissions; added prompt message to allow the GM to delete temporary actors used by player polymorph flow\n- Fixed \"Delete [Scene]\" navbar context option not being added on initial load\n- Fixed Config failing to automatically add a trailing slash to user-entered Base Site Url\n- Fixed Class Importer importing shield proficiencies as text, rather than \"Shield\" proficiency\n- Fixed Class Importer converting existing proficiencies to text when applying additional proficiencies\n- Fixed case where Tool/Config buttons could be double-added to directories"
	},
	{
		"ver": "1.39.1",
		"date": "2021-10-04",
		"txt": "- Item Importer can now apply speed-modifying active effects for items which adjust speed\n- Improved Popout compatibility with the \"Monk's Enhanced Journal\" module [and made Popout more tolerant of non-standard applications]\n- Tweaked Creature Importer \"rename\" functionality, to catch more potential replace-able names\n- Made initial loading process more tolerant to crashes caused by failing to apply various config options\n- Added missing \"x\"/clear button to Config search bar\n- Fixed rare crash when drag-dropping a token to canvas when \"NPC HP Roll Mode\" is enabled\n- Fixed Table Importer crashing on \"<X> or less\" rolls\n- Fixed Foundry-item-typed entities failing to import when shift clicking `@<tag>[...]`s"
	},
	{
		"ver": "1.39.2",
		"date": "2021-10-05",
		"txt": "- Fixed broken `Array` methods, which were generating a variety of fun bugs."
	},
	{
		"ver": "1.39.3",
		"date": "2021-10-05",
		"txt": "- Migrated system support to dnd5e 1.5.x\n  - The Item Importer can now set \"base item\" and \"critical hit threshold/damage\" fields\n  - The Creature Importer can now correctly import non-standard saving throw/skill bonuses (previously, only exact proficiency levels were allowed)\n- Enabled scrollbars on popped-out windows\n- Token scale can now be edited via the Bulk Prototype Token Editor\n- Default token scale can now be set as a Config option for the Creature/Vehicle/Object Importers\n- Added \"Never Download\" Art Browser Config option, which forces the art browser to refer to art only by URL, and if it can't, display an error (instead of downloading the image to the server)\n- Added Config option to force the Psionic Importer to use the old \"import as spells\" method\n- Improved compatibility with the Obsidian module\n- Fixed crash when attempting to load spells from a homebrew source that does not include any spells (notably, when applying spell lists during the import of e.g. homebrew Cleric subclasses)\n- Fixed Class Importer being unable to import to NPCs [note that this is not guaranteed to work perfectly, but it wasn't supposed to be completely broken, either]"
	},
	{
		"ver": "1.39.4",
		"date": "2021-10-18",
		"txt": "- Added \"Import (Spells)\" Config option to \"Apply Class Filter when Opening on Actor\", which will apply e.g. the \"Wizard\" filter when the Spell Importer is opened from a sheet with (only) Wizard levels\n- Added \"Import (Spells)\" Config option to \"Auto-Detect Actor Spell Preparation Mode\", which makes the Spell Importer attempt to create a spell with a preparation mode appropriate to the spellcasting type of the actor it is being imported to, e.g. Pact Magic for Warlocks\n- Added support for \"@Folder[...]{...}\" tags (similar to Foundry's existing \"@Actor[...]{...}, etc.\", which, when clicked, will switch to the tab the folder is in, expand it, and scroll to it (and provides a brief flare animation to mark the folder)\n- Loot imported by Rivet is now displayed as a chat message, whispered to the GM\n- Class Importer now populates the \"Saving Throw\" field on Class items\n- The Bulk Permission Editor can now reset player permissions to \"Default\"\n- (Brew) Added \"Import\" Config option to \"Avoid Loading Homebrew Indexes on Startup\", which may _slightly_ improve load times, but also removes all the homebrew from the Importer source lists\n- (Brew) Importers now display a warning when attempting to open with no content\n- Fixed crash, due to attempting to create the same folder multiple times, when importing loot via Rivet"
	},
	{
		"ver": "1.39.5",
		"date": "2021-10-18",
		"txt": "- Fixed Adventure/Book Importer being un-openable due to \"no content\" message"
	},
	{
		"ver": "1.40.0",
		"date": "2021-10-27",
		"title": "Smash and Grab",
		"txt": "- Ported main site Loot Generator; this can be found in the Plutonium \"Tools\" menu in the items/journal directories\n - Loot can be imported to the item directory, a journal entry, or a compendium\n - Loot can be drag-dropped to a scene to place a loot journal note\n - Loot can be drag-dropped to an actor to import to that actor\n- Spell metric unit conversion now correctly converts areas, and now supports converting miles to kilometres\n- Improved Importer detection of some proficiency-based feature use types\n- Fixed system version checker aggressively throwing junk warnings when using new system versions\n- Fixed \"Welcome\" message being (ironically) un-dismissible if Streamer Mode was enabled"
	},
	{
		"ver": "1.40.1",
		"date": "2021-10-27",
		"txt": "- Fixed crash when importing FTD creatures with lair actions"
	},
	{
		"ver": "1.40.2",
		"date": "2021-10-31",
		"txt": "- Added support for FTD's additional lair actions/regional effects when importing dragons\n- Fixed Loot Generator failing to display loot in chat when importing via Rivet\n- Fixed crash when attempting to import un-importable class/subclass features via Class & Subclass Feature Importer [by removing them from the list!]"
	},
	{
		"ver": "1.41.0",
		"date": "2021-11-14",
		"title": "Spice of Life",
		"txt": "- Added (most) official creature variants to the lists available when using the Creature Importer's \"Import With... Variants\" option\n- Creature Importer now displays variant creatures in its list view; this can be disabled via a Config option\n- Reworked Race Importer handling of certain races (mostly dragonborn) to better support choosing between different flavors of a race/subrace\n- Race Importer now displays race flavors in its list view; this can be disabled via a Config option\n- Added spell point add/update step to Class Importer, if \"Use Spell Points\" Config option is enabled\n- Added \"custom resource\" (to support modules which add more sheet resource) and \"sheet item\" (which auto-generates and uses charges on a sheet item) spell points Config options\n- Added \"Convert Speeds to Metric\" Config options for Creature/Race/Object/Vehicle Importers\n- Added module-wide \"Prefer Metric (Where Available)\" Config option\n- Added \"Row Cleaner\" tool to table title menu\n- The Table Importer can now import tables as journal entries, as opposed to rollable tables\n- Added (non-retroactive) support for drag-dropping loot generator journal entries to actor sheets, which will add all the loot listed in the journal entry to the target actor\n- Streamer Mode now changes the \"atom\" icon in import buttons to a D&D logo\n- Disabled the Class Importer's ability to change character XP; this functionality is now hidden behind a Config option\n- Added Config options which set specific \"disabled\" and \"transfer\" values on active effects for spells imported by the Spell Importer; setting these values may improve compatibility with some automation modules\n- Fixed Babele renames breaking compendium image/data lookups (hopefully)\n- Fixed Equipment Shop failing to handle multiple item sources\n- Fixed Creature Importer failing to apply dragon spellcasting variants\n- Fixed Config'd data compendiums being used only when searching for images, and not when searching for data"
	},
	{
		"ver": "1.41.1",
		"date": "2021-11-16",
		"txt": "- Fixed some creatures failing to import under certain bio import settings\n- Fixed crash when attempting to find certain compendium items when Babele is active"
	},
	{
		"ver": "1.42.0",
		"date": "2021-11-23",
		"title": "Press 1 for Sales or 2 for Support",
		"txt": "- Added \"Font Size Multiplier\" Token Config option; this scales the size of token nameplates/tooltip text\n- Added Import (Creature) Config option to import ACs as static values (i.e. a custom formula = the statblock's AC value)\n- Added \"Named Creature\" option to Creature Importer renamer, which, if enabled, will remove leading \"The\"s from e.g. \"The goblin\"\n- Attempting to open an already-open sheet which is popped-out will now bring the sheet's window to the front\n- Added an \"import to selected tokens\" macro to the built-in Macros compendium, which will open the Import Wizard, targeting the selected token(s)\n- Added \"Import with Custom Types\" alt-flow to the Item Importer, which allows the Foundry type of each item to be manually specified\n- Added Import (Spells) Config Option to include a \"Classes\" section in imported spell descriptions\n- Fixed case where Creature Importer renames could treat the word \"target\" as the creature's name\n- Fixed crash when attempting to import a vehicle/object\n- Fixed Spell Importer \"Import as Spell Scroll/etc.\" button having no effect\n- Fixed Popout popping an owned document sheet into a new window on every edit\n- Added warning message when using Popout if your browser is blocking the popout window(s)\n- Fixed non-GM players being unable to view the temporary sheets created when clicking `@<tag>[...]`s\n- Added (highly experimental) \"Minimize Actor/Item Re-Renders\" UI Config option. This attempts to remove some UX breakage caused by Foundry's sheet re-rendering on data change.\n- (Brew) Fixed pure `\"baseitem\"`/`\"magicvariant\"` brews failing to be shown in the Item Importer's source list\n- (API) Added \"srd5e.importComplete\" hook call on the completion of each import"
	},
	{
		"ver": "1.42.1",
		"date": "2021-11-30",
		"txt": "- The Item Importer can now \"stack\" items imported to an actor onto existing items in that actor's inventory. This can be configured to \"always\" stack (e.g., importing Longsword twice will result in one Longsword item with a quantity of two); \"sometimes\" stack (which will only stack consumables, loot, etc.); or \"never\" stack (the old behaviour, where each import results in a new item added to the actor's inventory).\n- Improved Spell Importer parsing of numerical \"at higher level\" values\n- Split out \"Use Spell Points\" Import (Spell) option to have a distinct setting for NPCs\n- Added (optional) \"Rivet active\" display to the Foundry logo in the top-left of the screen if Rivet is detected\n- Fixed non-GM users being unable to view temporary actors shown when clicking on `@<creature|vehicle|object>[...]`s\n- Fixed Spell Importer failing to set distance units\n- Fixed dismissing the \"use importer?\" prompt when drag-dropping a Plutonium-imported item to a sheet failing to cancel the standard drag-drop\n- Fixed Streamer Mode failing to re-obfuscate names in the Module Management window when changing tabs\n- Fixed module conflicts caused by \"popout\" actor/item checks\n- Fixed Background Importer failing to load selected sources in \"feature from another background\" picker"
	},
	{
		"ver": "1.43.0",
		"date": "2021-12-08",
		"title": "Partial Credit",
		"txt": "- The Adventure/Book Importers may now import maps (where available). [Note that the full-fat version of this has about as much coverage as the \"Dynamic Viewer\" on 5etools, i.e., not a lot.]\n- The Item Importer now populates ammo attack/damage bonuses\n- Added Config Option to make (Foundry) applications resizable by default\n- Fixed Spell Importer crash when importing spells in certain preparation modes\n- Fixed Race Importer crash when opening the importer without the default 5etools source selected\n- Fixed Bulk Permission Editor failing to set default permissions\n- Fixed active scene name not being cleared from tab name when deleting the active scene\n- Fixed Creature Importer adding an invalid \"custom\" language to creatures with non-standard languages, which would display as a small grey line on the sheet"
	},
	{
		"ver": "1.43.1",
		"date": "2021-12-11",
		"txt": "- Moved adventure/book map importing to freestanding Map Importer\n- Improved performance of adventure/book map importing\n- Fixed Map Importer throwing harmless error on missing map region data\n- Reworked \"Save Imported Images/Tokens to Server\" and \"Use Local Images\" Config options\n  - \"Use Local Images\" option now uses a (configurable) \"assets\" directory outwith the module directory\n  - \"Saved Image/Token Directory\" is now \"Image/Token Directory\"; this directory is used both for local image saving, and for local image serving\n  - (\"Save Imported Images to Server\" and \"Save Imported Tokens to Server\" may now be used alongside \"Use Local Images\")\n- Reworked 'Local Homebrew' Config options\n  - Now uses a (configurable) \"assets\" directory outwith the module directory\n  - If \"Use `index.json` for Local Homebrew\" is disabled, the configured directory will be listed directly using Foundry's built-in file API. Note that this requires file browse permissions, which are not the default for un-trusted players.\n- Fixed local homebrew not being loaded/available during some operations\n- Improved Importer detection of \"action\" vs \"bonus action\"\n- Fixed Spell Importer \"Class/Subclass\" filters behaving inconsistently when browsing homebrew with custom class spell lists"
	},
	{
		"ver": "1.43.2",
		"date": "2021-12-17",
		"txt": "- The Map Importer can now folderize by chapter name, or map name\n- The Background Importer can now apply feats when importing to an actor [to support Strixhaven backgrounds]\n- Fixed \"Compact Scenes Directory\" UI Config option failing to compact scene folders"
	},
	{
		"ver": "1.43.3",
		"date": "2021-12-19",
		"txt": "- Customizing a background's feature now changes (where appropriate) the feats/spells that background applies\n- Fixed various inconsistencies in table styling in imported entries"
	},
	{
		"ver": "1.43.4",
		"date": "2021-12-22",
		"title": "The Ninth Degree",
		"txt": "- The Creature Importer now sensibly handles multiple spellcasting traits with different attributes\n- Fixed junk @tags appearing in names of maps imported via the Map Importer\n- Fixed Background Importer crash when drag-dropping a background from the items directory/a compendium\n- Fixed Background Importer failing to strip @tags from characteristics when clicking rows in the characteristic tables directly (rather than rolling)\n- (Brew) Simplified Importer handling of class/subclass spellcasting data, allowing more\n- (v9; Server; v0.4.0) Added v9 version of backend mod"
	},
	{
		"ver": "1.44.0",
		"date": "2021-12-30",
		"title": "Keyed Up",
		"txt": "- Creature Importer now uses \"Natural Armor\" armor type where appropriate (the old \"custom formula\" version can be enabled via Config option, as it has some valid use cases)\n- Added Importer (Creature) Config option to wrap attack details in \"secret\" blocks, which has the attacks mimic the look-and-feel of SRD creatures\n- Added active effects to e.g. TCE Artificer companion creatures to scale HP/saves/skills (where appropriate) based on your character\n- Added (effectively player-only) option to auto-refresh non-character sheets which use `@srd5e.userchar. ...`, ensuring changes to your character are mirrored to e.g. Artificer companions in a timely manner\n- Added actor name to various tools (Importer, Equipment Shop, etc.), to easily identify which sheet is being targeted [primarily for visibility when using v9 hotkeys, see below]\n- Tweaked Creature Importer parsing of HP, saving throws, and skills, to optimistically import more data from non-standard data formats\n- Fixed Polymorpher crash\n- Fixed Art Browser failing to cycle mode on \"Drag-Drop Images As...\" button press\n- (v9) \"Plutonium\" strings in the \"Configure Controls\" UI are now obfuscated when Streamer Mode is enabled\n- (v9) Added (optional) keybinds for:\n  - Opening the Importer\n    - [Optionally in a specific mode]\n    - For your character [optionally in a specific mode]\n    - On the currently-viewed sheet [optionally in a specific mode]\n  - Opening the Equipment Shop, either for your character or on the currently-viewed sheet\n  - Opening the Polymorpher, either for your character or on the currently-viewed sheet\n  - Opening the Config\n  - Opening the Loot Generator\n  - Opening the Art Browser\n  - Setting your Rivet target, either to your character, to the currently-viewed sheet, or to nothing (clearing the Rivet target and returning to importing to directories)\n  - Opening the \"Report a Bug\" form(!)\n- (v9) Fixed Art Browser being unable to create tiles\n- (v9) Fixed Art Browser buttons failing to hide when \"Add Button To\" Config option was adjusted"
	},
	{
		"ver": "1.45.0",
		"date": "2022-01-04",
		"title": "I'll Take One Lift",
		"txt": "- Added school-based default spell icons to Spell Importer, for spells which lack an existing icon\n- The Creature Importer now optimistically parses more non-numerical ACs, and avoids using `ac.base` in calculations (which caused the AC editor window to display an incorrect value)\n- Added sound clip import to Creature Importer when \"Monk's Little Details\" module is active\n- The Bulk Prototype Token Editor can now set actor sheet image to equal token image (previously, it could only set the token image to equal the sheet image)\n- The Class Importer can now add resources and have features use them; note that this is only implemented for Battle Master Fighter Maneuvers, but will be expanded in future\n- The Class Importer now adds an active effect to automatically set the \"prepared spells\" total for the Tidy5e sheet\n- The Item Importer now imports \"recharge\" information (where available)\n- A synthetic (i.e., un-linked token) actor can now be set as the Rivet target using the new \"Set as Rivet Target\" option in the sheet dropdown menu. In v9, this can be bound to a hotkey.\n- (v9) Added UI Config option to compact cards directory\n- (Brew) Added support for a `\"foundryImg\"` property to many entity types, which will override the default image for an actor/item/etc. with the provided URL\n- Fixed macro compendium only appearing under `dnd5e` (as opposed to, for instance, `dnd5eja`)\n- Fixed Token HP Roller attempting to set token HP as a non-GM\n- Fixed Spell Importer defaulting spells of level >9 to \"Cantrip\" (they now default to level 9 instead)\n- Fixed CSS conflict with the \"Item Piles\" module"
	},
	{
		"ver": "1.45.1",
		"date": "2022-01-05",
		"txt": "- Added \"sheet item\" and \"custom\" modes to Import (Psionic) Config \"Psi Points Resource\" option, to bring it in line with the Spell Importer\n- Way of the Four Elements Monk Elemental Disciplines which add spells now link the use/charge consumption of those spells to your Ki sheet item (where available)\n- (v9) Fixed crash when loading with Permission Viewer enabled\n- (Brew) Fixed homebrew subraces crashing the importer"
	},
	{
		"ver": "1.46.0",
		"date": "2022-01-14",
		"title": "Resources, Online",
		"txt": "- Added \"resource\" handling to Class Importer, which can create and/or make use of sheet items for resources (such as Ki, Sorcery Points, and Superiority Dice) when importing features. Features which consume resources (e.g. a Monk's \"Flurry of Blows\") may then link their resource consumption to the appropriate resource sheet item.\n- Class Importer now creates links between sheet items when splitting a single feature (e.g. \"Ki\") into a parent and multiple sub-features (e.g. \"Ki\", \"Flurry of Blows\", ...), such that the child features can be accessed via `@ActorEmbeddedItem` from the parent\n- Improved Class Importer SRD icon matching for various features, including spellcasting and channel divinity\n- Various Importers will now default to \"special\" activation cost for items which have e.g. limited uses and no specific action cost, to avoid other information being automatically hidden by the item UI\n- Added \"Reset All Settings\" button to Config\n- Added `@ActorEmbeddedItem` tag generation when drag-dropping an actor's sheet item to a text editor\n- Fixed `@Folder` links breaking text rendering for player who did not have access to the linked folder  \n- (Brew) `\"img\"` may now be used in `\"foundry<Property>\"` objects, and will set the Foundry \"img\" field (usually the icon) of the appropriate document on import\n- (Brew) Fixed Class/Subclass Feature Importer, Rewards Importer, and Psionics Importer failing to add custom flags when specified in e.g. `\"foundryFlags\"`\n- (Brew) Fixed various `\"foundry<Property>\"` types failing to be properly applied, as the importer did not consider them valid\n- (Brew) Fixed Importer parsing of `@damage` tags failing to account for display text\n- (Enabled Rivet import for classes)"
	},
	{
		"ver": "1.47.0",
		"date": "2022-01-23",
		"title": "Is It On the List?",
		"txt": "- Added \"World Data Source Selector\" tool. This allows the GM to curate the list of sources which are available (if the new Data Source \"Enable Data Source Filtering\" Config option is enabled) throughout the module (Importers, Actor Polymorpher, etc.)\n  - Added \"Force Select All for <Players|GMs>\" Data Source Config option, which ensures that all available sources are selected throughout the module. Note that this _can_ be used without the \"Enable Data Source Filtering\" Config option recommended, to forcibly select _every_ available source, although this is not recommended for performance reasons. With these options are enabled, source selection screens will be silently skipped where possible.\n- Added \"World Content Blocklist\" tool; this is a port of the 5etools Blocklist, and works similarly\n- Added \"Importer Image Preloader\" tool, which finds and downloads all images available in the current version of the site to your Config'd \"Image/Token Directory\" [this aims to be equivalent to downloading the (long-dead) images zip and manually creating an `img` from it]\n- The Import Wizard \"Open Default Importer\" buttons are now \"Open Last-Used Importer\" buttons, which will open the importer using the previous selection of sources made. If the \"Force Select All\" Data Source Config option(s) are enabled, this will instead open the importer with all sources selected.\n- (v9) Added \"Import All\" option to compendium title menu [this is the same functionality as a regular right-click -> import all]\n- Added drag-and-drop support for list items in Creature, Objects, and Vehicles Importers. Dropping a list item to the canvas imports the dropped entity, and creates a token for it at the drop point. Note that setting the \"Duplicate Handling Mode\" Importer Config option to \"Skip Duplicates\" is highly recommended when using this feature!\n- Added \"Delete Message\" context menu option to chat messages\n- Tweaked/improves various UI elements, notably adding missing red coloring for various \"delete\" buttons\n- Parallelized loading of homebrew in various source selection apps, greatly improving performance when loading many homebrew files\n- Fixed various Importers downloading item images during item pre-load step, causing _all_ item images to be downloaded\n- Fixed Spell Importer treating non-feet units as feet when applying metric conversions\n- The Level Up sheet button now prefers the most-recently-released non-UA version of a class when trying to determine the actor's classes, if no previous import data is present\n- Importer metric conversion now round to a max of 3 decimal places\n- Fixed Tidy5e Sheet \"dark\"-compatible styling being applied to non-sheet apps\n- Improved custom actor active effect error handling; more information (such as the affected actor's name/ID) is now logged, to (hopefully) assist debugging\n- (Server; v0.4.1) (v9) Added optional Electron addon, to enable popout windows when running inside the Electron app (although this is still not recommended!)"
	},
	{
		"ver": "1.47.1",
		"date": "2022-01-26",
		"txt": "- Fixed Importer failing to read custom files/URLs\n- Fixed Class Importer failing to respect World Content Blocklist class entries\n- Fixed rendering of long strings in Config string pickers\n- (v9) Fixed \"Delete Message\" showing twice in chat message context menus; renamed to \"Delete\" to match Foundry standard \n- (Server; v0.4.2) (v9) Fixed crash when running in the Electron client _without_ the \"\"\"optional\"\"\" Electron addon"
	},
	{
		"ver": "1.47.2",
		"date": "2022-01-30",
		"txt": "- Fixed World Content Blocklist failing to blocklist subclasses\n- (v9) Fixed \"number\"-type active effects no longer applying their values in v9.245\n- (v9) Fixed incompatibility with Better Rolltable\n- (Added Manifest+ conflict info)"
	},
	{
		"ver": "1.47.3",
		"date": "2022-02-03",
		"txt": "- Fixed Creature Importer duplicating creature items in rare cases\n- Fixed \"Base Site URL\" Import Config Option failing to apply to image URLs\n- Fixed Rivet failing to import base items/generic variants/specific variants\n- (v9) Fixed _non_ \"number\"-type active effects _which are still actually numbers_ no longer applying their values in v9.245\n- (Added handling for MPMM data)"
	},
	{
		"ver": "1.47.4",
		"date": "2022-02-05",
		"txt": "- Added more active effect keys to the \"Find Active Effect Attribute Key\" app (notably, the missing AC keys, as well as various global attack/damage bonuses which are not visible on the sheet)\n- Fixed \"Open Last-Used Importer\" button opening the importer for the currently active mode, rather than the clicked-on mode\n- Fixed Class & Subclass/Class & Subclass Feature Importers inserting broken links when a feature has been filtered out\n- (v9) Improved compatibility with Token Magic FX module [note that this is probably still broken in v0.8.x; sorry, legacy users!]\n- (v9) Fixed journal entries directory failing to compact when the \"Compact Journal Entries\" UI Config option is enabled"
	},
	{
		"ver": "1.47.5",
		"date": "2022-02-08",
		"txt": "- (v9) Fixed token effects/bars failing to render"
	},
	{
		"ver": "1.48.0",
		"date": "2022-02-26",
		"title": "Dragon Drop",
		"txt": "- Added drag-drop functionality:\n  - Importer list items may now be drag-dropped to text areas; sheets; sidebars; compendiums; and the canvas\n  - `@<tag>[...]`s may now be drag-dropped to text areas; sheets; sidebars; compendiums; and the canvas\n    - Note that drag-dropping `Item`-typed entities to the canvas currently requires module support to function, e.g. the Item Piles module _[requires Item Piles v1.5.0+]_\n- Loot Generator drag-drop to canvas now uses Item Piles where available _[requires Item Piles v1.4.6+]_\n- Added token selection/customization to Creature Importer's \"Customize Import\" screen (previously the \"Scale CR\"/etc. screen)\n- Improved Creature Importer parsing of various list-style actions (eye rays, \"choose\"/\"random\" actions, etc.), including the generation of a parent action in which all the options are listed/linked\n- Item Importer filters now hide \"Generic Variant\" items by default, and show \"Specific Variant\" items instead\n- Improved item image finding in Item Importer, allowing fallback on base items/basic items for magic items/specific variants\n- The Item Importer now tries to parse and add various weapon \"additional damage\" dice/types\n- Added \"School\" as Spell Importer folder option\n- Active effect config options are now forcibly set to Midi QOL-compatible values when Midi QOL is running\n- Split \"Metric\" Importer Config options into \"Distance/Speed\" and \"Weight\" options, to better support the system-wide metric weight option. Additionally, when the system-wide metric weight option is enabled, metric weights will always be used by the Importer.\n- Fixed Class Importer application of tool proficiencies; previously, proficiencies would be added to the \"Special\" free-text input, instead of ticking the appropriate box\n- Fixed Class Importer setting `undefined` level requirements for imported optional features\n- Fixed Loot Generator items failing to import when Importer \"Skip duplicates\" Duplicate Handling Mode is enabled\n- Fixed Importer trying to create folders as a player in some rare cases\n- Fixed Creature Importer adding ammo requirements to ranged weapons\n- Fixed Creature Importer failing to fully populate skill/save information when importing temporary entities (e.g. when clicking an `@creature[...]` tag)\n- (v9) Fixed Active Effect evaluation of `null`, `true`, and `false`\n- (Brew) The Background importer now supports more proficiency categories"
	},
	{
		"ver": "1.48.1",
		"date": "2022-02-27",
		"txt": "- Fixed Item Importer crashing when importing some items"
	},
	{
		"ver": "1.48.2",
		"date": "2022-03-10",
		"txt": "- Added \"Select Class Sources\" screen to \"Add New Class\" flow of Level Up button, allowing e.g. homebrew classes to be selected when adding a new class\n- Fixed \"current uses\" being set to 0 when importing \"innate\" additional spells\n- Fixed Class Importer always choosing the first set of additional spells when adding spells from subclasses\n- Fixed \"Fix ESC Key\" Config option throwing an error when ESC is pressed with no active canvas\n- Fixed Item Importer failing to set correct ACs for some magical SRD items\n- Fixed Background Importer crash when cancelling feature import\n- Fixed Level Up button being added to sheet twice in rare cases\n- (v9) Fixed \"Compact Chat\" Config option setting chat font size to a fixed value, breaking the application of Foundry's \"Font Size\" slider\n- (v9) Removed \"Delete\" chat message context option, as this is now part of Foundry\n- (v9) Fixed Rivet failing to display rolls in chat"
	},
	{
		"ver": "1.48.3",
		"date": "2022-03-10",
		"txt": "- Improved detection of reaction/per-rest feature data\n- Fixed Adventure/Book importer failing to open\n- Fixed player Config resetting on reload"
	},
	{
		"ver": "1.48.4",
		"date": "2022-03-16",
		"txt": "- Fixed Class Importer failing to apply blocklist to spellcaster cantrip/prepared spell lists\n- Fixed Config compatibility overrides being applied too late for players\n- (v9) Fixed included compendium name containing a `.`, rendering it useless in the latest Foundry version"
	},
	{
		"ver": "1.49.0",
		"date": "2022-03-23",
		"title": "Bug Hunt",
		"titleAlt": "Creating More Bugs!",
		"txt": "- Improved Creature Importer handling of multi-part versatile dice (e.g. \"1d10 slashing damage plus 1d6 cold damage\")\n- An additional image loader has been added to serve the \"Save Imported Images/Tokens to Server\" Config option, to bypass CORS issues when loading tokens/images from some URLs. This loader requires the backend mod to be installed in order to function.\n- Added UI Config option to suppress \"Missing roll data\" warning notifications \n- Fixed Item Importer crash when attempting to stack items with the \"Use Strict Entity Matching\" Config option enabled\n- Fixed inversion of source selection screen \"Select All\" checkbox states\n- Fixed Trap Importer crashing when trying to import\n- (Brew) Expanded `foundry<X>` usage\n  - More entity types (hopefully, all of them!) will now load/respect `foundry<X>` `effects`, `flags`, and `data`\n  - Effect flags, duration, etc. may now be specified\n- (v9) Fixed use of outdated scene progress bar API crashing various tools\n- (Server) Added generic binary data fetching endpoint (used as a workaround for loading troublesome tokens; see above)"
	},
	{
		"ver": "1.49.1",
		"date": "2022-04-02",
		"txt": "- Improved Creature Importer support for \"PB\" in dice expressions\n- The Creature Importer now optimistically parses partially-numerical saving throw values (similar to the current best-effort parsing for HP and AC)\n- Added popout buttons to Importer windows\n- Added inline \"Preview\" and \"Import\" to Maps Importer list\n- Popout windows will now use the width/height of the app's window, where available, rather than a default pre-set value\n- Reworked drag-drop of background, class/subclass, and race items to drastically reduce the amount of junk data stored in flags, and fix crashes triggered by drag-dropping some imported homebrew items\n- Reworked Psionic Importer to share more standardised Importer internals; this _should_ increase the reliability and preciseness of its parsing!\n- \"Display Missing Health\" text is now hidden for a token when that token is converted to a \"blood splat\" by the Monk's Little Details module\n- Fixed Psionic Importer failing to consistently display discipline mode names with the inclusion of point cost, concentration, etc.\n- (v9) Switched from `Text` to `PreciseText` when rendering missing token health, fixing the blurriness\n- (Brew) Fixed Creature Importer crash when importing some formats of `\"type\": \"list\"`"
	},
	{
		"ver": "1.49.2",
		"date": "2022-04-03",
		"txt": "- Fixed crash when attempting to import a background"
	},
	{
		"ver": "1.49.3",
		"date": "2022-04-19",
		"txt": "- Optional Feature and Feat Importers may now set senses (darkvision, blindsight, etc.)\n- Race Importer may now set more sense types [mainly for homebrew]\n- Added Config options to convert race speeds to metric\n- Added \"Set Folder Path\" button to Maps section of Adventure/Book Importer\n- (v9) Importers may now use Midi QOL reaction types when Midi QOL is active\n- Fixed rendering of `@classFeature[...]` and `@subclassFeature[]` @tags\n- Fixed Class/Subclass Feature Importer adding some active effects twice\n- Fixed Spell Importer failing to apply class filter when opening on caster sheet\n- (Brew) Added support for alternate tokens using `tokenUrl`"
	},
	{
		"ver": "1.49.4",
		"date": "2022-04-21",
		"txt": "- Fixed various issues caused by Item Importer over-zealously matching SRD compendium items (e.g. converting \"Arrow +3\" to \"Arrow\" for the purposes of finding stats and/or stacking with existing sheet items) \n- (v9) Fixed crash when importing creatures with Midi QOL active\n- (Brew) Fixed Class Importer crash on malformed starting gold expression"
	},
	{
		"ver": "1.50.0",
		"date": "2022-05-01",
		"title": "Systemic Advancement",
		"txt": "- Migrated system support to dnd5e 1.6.x\n  - Note that dnd5e 1.5.x is **no longer supported**.\n  - Note that Foundry v0.8.x is **no longer supported** either, as dnd5e 1.6.x requires Foundry v9+.\n  - Hit points/hit dice in advancements are not *yet* supported, but this may come in the future, if/when class items support more hit dice formats. Until then, the Class Importer will continue to set hit points/hit dice as it has always done.\n  - Features in advancements are not fully supported, and this is unlikely to change in the future, as importing features on-the-fly is preferable for a variety of reasons. The Class Importer will track imported features using advancements, allowing these to be easily removed when down-levelling, but levelling up should still be done via the Class Importer (or Charactermancer!).\n- Imported Optional Features may now import other Optional Features (e.g. the \"Superior Technique\" fighting style may now import Battle Master Maneuvers)\n- Converted all remaining \"5etools-style\" modal windows to Foundry applications, for a more consistent UI\n- Fixed Class Importer failing to load all available spells when prompting to add cantrips/fill spellbook\n- Fixed crashes around/rendering of @quickref tags\n- Token vision is now more consistently set across Creature Importer and Race Importer (with the former gaining better support for metric, and the latter gaining support for all truesight/tremorsense) "
	},
	{
		"ver": "1.50.1",
		"date": "2022-05-02",
		"txt": "- Fixed crash when importing spells/opening the Spell Importer"
	},
	{
		"ver": "1.51.0",
		"date": "2022-05-08",
		"title": "Boxcraft",
		"txt": "- Added \"Rectangular Select ...\" tools to scene Measurement Controls, Lighting Controls, and Ambient Sound Controls, and made the \"Select Notes\" tool support standard click-drag box select\n- Added \"Replacement Data Compendiums\" Config option to Item/Spell Importers. If populated, the importer will check the compendiums provided for an existing version of an item/spell during import, and use the existing version if it finds one. This effectively allows e.g. spells imported to creature statblocks by the Creature Importer to be customized, or starting items imported by the Class Importer to be customized.\n- Setting a creature's token URL to a path ending in \"*\" (i.e., a wildcard) during the \"Customize Import\" phase of the Creature Importer will now correctly set the token \"Randomize Wildcard Images\" value for that creature\n- Added \"Class Starting Gold\" Equipment Shop Config option, which allows the GM to set a fixed value of starting gold to be used for purchasing starting equipment, instead of using the value set by the class\n- Added \"Open Last Used Importer (<entityType>)\" as bindable hotkey option (functionally identical to clicking the \"heart\" button in a directory)\n- Added \"Select Existing Folder Path\" dropdown to Importer \"Folder Path\" UI\n- Fixed Supernatural Gifts & Rewards imports crashing\n- Fixed Spell Importer crashing when \"Auto-Detect Actor Spell Preparation Mode\" option is enabled\n- Removed unnecessary URL encoding of various image URLs, notably those used in the Map Importer\n- Fixed table rolls of the form `9x-0` failing to convert to `9x-100` in some cases\n- Fixed Adventure/Book Importers importing inline content (tables) multiple times"
	},
	{
		"ver": "1.52.0",
		"date": "2022-06-01",
		"title": "Scrub Up",
		"titleAlt": "Noob Down",
		"txt": "- Added libWrapper as a hard dependency. Previously, the libWrapper shim was included and relied upon as a fallback if the module itself was not present. This has been phased out in favor of relying on the full module, allowing Plutonium to make better use of libWrapper's features.\n- When opening the Import Wizard, the \"Open Importer\" button is now focussed, allowing you to hit enter to quickly open the active importer\n- When opening an Importer, the search field is now focussed. Hitting enter will import the topmost list item.\n- Advancements are now briefly suppressed when drag-dropping a Plutonium-imported class/subclass item to sheet, allowing the Class Importer to catch and handle the drop event. This prevents 20th-level classes being imported without prompting when drag-dropping a class item to a sheet. Note that older Plutonium-imported class/subclass items may have an incomplete set of flags, and should be re-imported to fully re-enable \"import on drag-drop\" functionality.\n- Added option to display missing token health beneath token, rather than as an overlay. This option is force-enabled if running Levels, as a workaround for Levels displaying tokens above the overlay in some cases.\n- Added the option to choose creature size to the \"Create Named Token\" macro\n- Folder paths are now sorted alphabetically in the Import Wizard \"Folder Path\" selector\n- Fixed Creature Importer failing to set correct token dimensions in some cases (notably, when an import overwrites an existing creature)\n- Fixed Creature Importer failing to set correct spellcasting info in some cases (notably, when an import overwrites an existing creature)\n- Fixed Background Importer resetting unused characteristics fields during import\n- Fixed discrepancies between Class Importer class/subclass identifier generation and dnd5e's identifier generation\n- Fixed regression where `srd5e.userchar.classes` object was missing from `srd5e.userchar` object\n- Fixed regression where hover+DEL failed to delete measured templates, lights, etc.\n- Fixed Creature Importer crash when attempting to add a weapon from a replacement data compendium to a creature\n- Fixed Item Importer merging an item into an existing stack of items which have a different item type\n- Fixed Importers failing to combine proficiency + expertise from the same feature in some cases\n- Fixed Class & Subclass Feature Importer double-adding page number to feature source\n- Fixed Spell Importer failing to correctly set spell point resource usage when using spell points\n- Fixed Class Importer prompting to import all wizard spells when importing the wizard class to an actor\n- Fixed over-zealous wiping of HUD elements when adjusting HUD font size, which was breaking compatibility with Hover Distance (if not others)\n- Fixed Equipment Shop \"Class Starting Gold\" Config option adding the gold to _all_ shop instances, rather than only those opened by the Class Importer\n- (Brew) Fixed Race Importer failing to load base race addon data when importing a subrace\n- (Brew) Fixed rare case where additional proficiencies from a subclass could be ignored"
	},
	{
		"ver": "1.52.1",
		"date": "2022-06-01",
		"txt": "- Fixed console spam due to over-eager destruction of missing HP display HUD elements"
	},
	{
		"ver": "1.52.2",
		"date": "2022-06-02",
		"txt": "- Fixed crash when importing an actor to a compendium\n- Fixed Class Importer sheet item drag-drop handler killing other event handlers\n- Fixed scaling \"dice\" of flat-number spells (e.g. Aid)\n- Fixed rare case where a spell imported from an \"additional spells\" list could have a broken saving throw"
	},
	{
		"ver": "1.52.3",
		"date": "2022-06-06",
		"txt": "- Added \"Enabled, but Use 99 Slots\" spell points Config option. This avoids setting all spells to \"At Will,\" while preventing you from running out of slots, making organisation easier and providing better compatibility with other modules/sheets.\n- Fixed Race Importer crash when importing a race which does not have a subrace\n- Fixed Optional Feature importer crash when importing to a directory/compendium\n- Fixed Item Importer failing to fully set ranges from SRD\n- Fixed infinite prompt cycle when drag-dropping an item which has a replacement in a \"replacement data compendiums,\" when that replacement was also imported by Plutonium"
	},
	{
		"ver": "1.53.0",
		"title": "Idiotsyncrasies",
		"date": "2022-06-29",
		"txt": "- Improved the Creature Importer's \"Rename To\" function\n  - Improved acquisition of shortened name from statblock. Additional sentence forms are now supported, as well as names containing dashes (e.g. \"The yuan-ti ...\").\n  - Improved output casing (\"The Creature is ...\" -> \"The creature is ...\")\n  - Added \"Rename To (Short)\" field, allowing the creature's \"short name\" (used when replacing text in actions/etc., and in some auto-generated text) to be specified\n  - Improved interaction with the \"Secret Attack Descriptions\" Config option; previously, the creature's original name would be displayed in generated description text\n- Improved sourcing of SRD tokens/portraits when using \"Prefer Foundry/System <Tokens|Art>\" Config option(s), allowing for the case where an SRD token image is preferred for the token, but a 5etools token image is preferred as the sheet portrait\n- Added early check with better error message when libWrapper is missing\n- Filter modals now use native Foundry application windows, rather than 5etools-style overlays\n- Fixed Level Up failing to pick up subclass items from sheet\n- Fixed custom `srd5e.userchar.classes` roll data failing to populate\n- Fixed Map Importer failing to find nearest header name for nameless maps\n- Fixed rendered `@skill` and `@sense` tags failing to function after page reload\n- Fixed collection cleaner failing to count documents in deleted folders towards total number of documents deleted\n- Fixed Creature Importer population of attack bonuses for creatures with no CR\n- Fixed directory tool menu failing to filter to tools appropriate for the current directory\n- Fixed content GM-only messages (e.g. \"would you like to revert this player's polymorph?\") showing for sending player; the message is still shown, but is now a \"blind\" message\n- Fixed \"Open Game Menu\" button failing to be added to the Settings tab in some cases _[note that this can be Config'd off as usual]_, and clicking it while the game menu is already open now closes the game menu \n- Fixed junk warning message when modified active effect system attempted to parse an empty dice expression\n- (Brew) Added validity check and error messages when attempting to load a brew which has invalid sources; previously, this would either silently fail, or appear to function but cause crashes within Importers\n- (Brew) Fixed race condition resulting in infinite loading screen when attempting to load certain brew dependency structures\n- _[(v10) Added initial v10-compatible version (Patron-only, until Foundry v10 stable is released)]_"
	},
	{
		"ver": "1.54.0",
		"date": "2022-07-17",
		"title": "Nerfed",
		"txt": "- Spells cast at higher levels will now use the correct amount of spell points\n- Improved compatibility with Obsidian, avoiding crash/errors during initial load\n- Added \"Hidden Importers\" Config option, allowing unwanted importers to be hidden in the Import Wizard\n- Slightly re-ordered Import Wizard importer list, prioritizing <entity> importers over <entity feature> importers\n- Added rudimentary Background Feature and Race & Subrace Feature Importers, hidden by default\n- Added IDRotF map grid data (thanks @ Tevomato)\n- Fixed folder selection in macro Bulk Directory Mover tool\n- Fixed Class Importer importing to both compendium and directory when attempting to import to a compendium\n- _[(v10) Updated v10 version to compatibility with v10 dev 3 (Patron-only, until Foundry v10 stable is released)]_"
	},
	{
		"ver": "1.54.1",
		"date": "2022-07-21",
		"txt": "- Added Spelljammer support to Vehicle Importer\n- Fixed ESC key failing to open game menu after opening a filter window"
	},
	{
		"ver": "1.54.2",
		"date": "2022-07-24",
		"txt": "- Added \"Hide Subclasses in Class Importer\" Config option\n- Fixed Vehicle Importer failing to set Spelljammer ship token sizes\n- _[(v10) Updated v10 version to compatibility with v10 testing 1.1 (Patron-only, until Foundry v10 stable is released)]_"
	},
	{
		"ver": "1.54.3",
		"date": "2022-08-12",
		"txt": "- Creature Importer now classifies \"Recharge\" attacks as `feature`s rather than `weapon`s, allowing the recharge button to function\n- Split \"Enable Data Source Filtering\" Config option into \"player\" and \"GM\" options\n- Split Item Importer \"Attunement\" Config option into \"importing to directory\" and \"importing to actor\" parts, to better match the behaviour of the dnd5e system. The default when importing to a directory is now \"requires attunement,\" whereas the default when importing to an actor is \"attuned.\"\n- Setting an actor which is already the Rivet import target as the Rivet import target will now un-import-target that actor\n- Fixed active effect parser handling of spellcasting bonus expressions (e.g. \"+1+1\")\n- Fixed Item Importer failing to set custom types when using the \"Import As <type>\" customization\n- Fixed Class Importer crash when importing a class which has no subclasses (e.g. a Sidekick class)\n- Fixed World Data Source Selector list \"select all\" checkbox only _visually_ selecting all\n- Fixed Class Importer failing to apply filters to descriptions on items imported to directories/compendiums\n- Fixed Importers often resetting filters on open (especially first open)"
	},
	{
		"ver": "1.54.4",
		"date": "2022-08-17",
		"txt": "- Tweaked Creature Importer parsing of some attacks (those with multiple ranges; those with multiple different damage rolls) to better support automation modules\n- Added support for Spelljammer: Adventures in Space content\n- Fixed rare crash on non-string active effect expressions"
	},
	{
		"ver": "1.54.5",
		"date": "2022-08-21",
		"txt": "- Added \"Maintain Images when Overwriting Duplicates\" Config option, which maintains the image and token image of a document when overwriting it using the \"Update Existing\" Importer Duplicate Handling Mode\n- Improved Creature Importer detection of damage rolls with no explicit damage type\n- Added warning when too many sources have been auto-selected (usually due to a bad \"Data Sources\" Config setup), with a configurable warning threshold\n- Fixed Creature Importer handling of versatile weapons\n- Fixed Class Importer double-importing active effects"
	},
	{
		"ver": "1.54.6",
		"date": "2022-08-28",
		"txt": "- Added \"Split Conditional Damage Actions\" Creature Importer Config option which, when enabled, will split attacks with a conditional damage component (\"plus <damage> damage if <condition>\") into two separate sheet items; a \"Base\" item rolling only the base damage, and a \"Full\" item rolling the base plus conditional damage\n- Added warning display/button to Config when Config options which are incompatible with other loaded modules are detected; clicking this button will \"fix\" the affected Config options, eliminating further console warning spam\n- [(v10) Updated v10 version to compatibility with v10 testing 5 (Patron-only, until Foundry v10 stable is released)]"
	},
	{
		"ver": "1.54.7",
		"date": "2022-08-28",
		"txt": "- Fixed Importers failing to apply blocklist to specific item variants"
	},
	{
		"ver": "1.55.0",
		"title": "Tendies",
		"date": "2022-09-01",
		"txt": "- (v10) Added support. This comes with a variety of changes in the v10 build:\n    - Replaced `@EmbedJournalEntry[journal]{displayName}` syntax with `@EmbedUUID[JournalEntry. ... .JournalEntryPage. ...]`. This (much like `@ActorEmbeddedItem`) will work in any text, and if the \"Enable Page Embeds\" Config option is enabled, embedded pages will be rendered as collapsible inline regions within other pages.\n    - Replaced \"Enable URL Entries\" Config option and associated journal entry context option with custom \"Embedded URL\" journal entry and journal page sheets. _[Usage of the journal entry version (as opposed to a journal page within a regular Foundry journal entry) is recommended, as Foundry's rendering of journal pages does not allow for maintaining embedded page state when changing page.]_\n    - Added \"Fast Tooltips\" UI Config option, which drastically cuts down the tooltip fade animation duration, and slightly reduces the tooltip activation delay\n    - Added \"Treat Journal Entries as Folders\" Config option. If enabled (the default), journal-entry-creating Importers will treat the final folder path part as a journal entry name, and create pages within that journal as though it were a \"folder.\" For example, when using the default Deity Importer folder path (\"Deities\") and importing Bane and Tyr, a single journal entry, named \"Deities,\" will be created in the journal root, containing a page for Bane and a page for Tyr. (Subsequent imports will add more pages to the same journal entry, assuming the \"folder\" path is not changed.)\n    - Removed `@Folder[...]` link syntax in favor of built-in `@UUID[Folder. ...]` link syntax\n      - Added \"Show Folder Linked by @UUID[Folder.] on Click\" Config option to allow tabbing/scrolling to a folder and highlighting it on link click\n    - Removed `ActorEmbeddedItem[...][...]{...}` link syntax in favor of built-in `@UUID[Actor. ... .Item. ...]` link syntax\n      - Added \"Roll Items Linked by @UUID[Actor.Item.] on Click\" Config option allow actor-owned items to be rolled on link click\n    - Added \"Show Parent Icon/Name For Child @UUIDs\" Config option to add the parent document icon/name to a link to a child document (e.g. `@UUID[Actor.My Character.Item.Big Sword]` will render as `[a][i] My Character / Big Sword` rather than the default `[i] Big Sword`)\n    - Added token \"Animation Speed\" Config option, providing a configurable speed multiplier as an alternative to the \"Disable Animations\" option\n    - Removed adventure/book journal splitting modes in favor of Foundry's built-in journal functionality\n- The Creature Importer now sets Monk's Little Details \"bloodsplat color\" based on creature type\n- The Creature Importer now splits out swarm \"... if the swarm has half of its hit points or fewer.\" damage as a second item when the \"Split Conditional Damage Actions\" Config option is enabled\n- Fixed SRD effects receiving the wrong `disabled`/`transfer` values when using automation modules"
	},
	{
		"ver": "1.55.1",
		"date": "2022-09-02",
		"txt": "- (v10) Fixed Creature Importer crash when setting token flags\n- (v10) Fixed embedded URL journal entry pages failing to render\n- (v10) Fixed standalone embedded URL journal entry styling"
	},
	{
		"ver": "1.55.2",
		"date": "2022-09-06",
		"txt": "- (v10) Fixed Actor Polymorpher failing to open\n- (v10) Fixed some unintended styling changes introduced by Foundry's v10 styling updates\n- (v10) Fixed various uses of deprecated methods which were missed in earlier migrations\n- (v10) Fixed active effects being double-applied on game load\n- (v10) Fixed rendering crash when attempting to load a non-existent compendium link\n- (v10) Fixed \"Report a Bug\" dialogue being bugged\n- (v10) Fixed \"Fix ESC Key\" Config option breaking ESC key\n- (v10) Fixed Creature Importer failing to fully populate sheet items when importing to a compendium"
	},
	{
		"ver": "1.55.3",
		"date": "2022-09-08",
		"txt": "- Fixed Equipment Shop failing to load\n- (v10) Spelljammer ships now correctly use the \"Space Vehicle\" type\n- (v10) Updated module.json conflict/etc. info to \"Module Management+\" v2.x structure"
	},
	{
		"ver": "1.55.4",
		"date": "2022-09-19",
		"txt": "- Fixed Background Importer crashing when dropping a background to a sheet\n- Fixed Class Importer crashing when using the \"Level Up\" button on a sheet to select a new sub/class\n- Fixed some dice rolls not being rolled via the Foundry dice/chat system\n- Fixed Creature/Vehicle Importers failing to correctly folderize created actors when one or more actors in the selected list triggered an overwrite (due to usage of the \"Update existing\" Duplicate Handling Mode)\n- Removed legacy Importer Sorcery Point/Ki Point usage parsing (which would occasionally output features which consumed sheet resources) in favor of using existing Sorcery Point/Ki Point sheet item methods\n- Fixed \"undefined\" prerequisites on optional features not imported in relation to a class\n- Disabled extended active effect parsing in the presence of the \"Rolldata Aware Active Effects\" module (which achieves the same effect), to avoid crashes when resolving active effect values\n- (v10) Fixed rendering of @tags in Adventure/Book Importer"
	},
	{
		"ver": "1.56.0",
		"title": "Google It",
		"date": "2022-10-02",
		"txt": "- (v10) Added Quick Insert integration.\n  - This can be disabled in the new \"Integrations (Quick Insert)\" Config tab\n  - This has a few limitations, partly due to Quick Insert having a limited dev API, and partly due to Plutonium content not _really_ existing in the world at time of search. It is currently best suited for adding creatures to the scene, and adding items to sheets.\n  - Results respect the Blocklist if in use, and the World Data Source Selector if the \"Force Select All for ...\" Config option(s) are enabled\n  - Homebrew results will appear _if and only if_ a brew is selected in the World Data Source Selector, and the appropriate \"Force Select All for ...\" Config option is enabled.\n- (v10) Improved support for dnd5e 2.0.3\n  - The Creature Importer now correctly sets Silvered/Adamantine/Magical \"Physical Bypasses\"\n  - The Item Importer now populates charge \"Recovery Formula\", and charge-based items now use the \"Charges\" Limited Uses type.\n- Fixed Creature Importer failing to import spellcasting traits if those traits were marked as \"actions\" instead of \"traits\" (as is the case for MPMM and later sources)\n- Fixed folder restyling breaking compendium folders as managed by the Compendium Folders module\n- (v10) When dropping a @tag which resolves to Foundry items to a sheet, the referenced entity is no longer imported to the items directory; instead, a temporary import is used, and the item added to the sheet directly\n- (v10) Fixed Spell Importer failing to set item ownership on import\n- (v10) Fixed crash when dropping a tile from the Art Browser\n- (Brew) Fixed races failing to appear in the Blocklist"
	},
	{
		"ver": "1.56.1",
		"date": "2022-10-04",
		"txt": "- (v10) Added Quick Insert \"Hidden Categories\" Config option\n- (v10) Fixed dropping Quick Insert links to text areas/chat producing invalid links"
	},
	{
		"ver": "1.56.2",
		"date": "2022-10-09",
		"txt": "- (v10) Temporary document sheets created by Plutonium will now display a compendium-document-like \"Import\" button in the header (assuming the user has permissions to create documents of that type). This is notably useful when accessing content via Quick Insert.\n- (v10) Plutonium Quick Insert indexes now respect Quick Insert \"Document Type\" permission settings\n- (v10) Importers which create journal entries will no longer attempt to create images from \"fallback\" (i.e., generic black-and-white) images\n- (v10) Importers which create journal entries will no longer add expand/collapse buttons to headers, in favor of/to avoid conflicts with header links in the journal entry sidebar"
	},
	{
		"ver": "1.57.0",
		"date": "2022-10-22",
		"title": "Health Benefits",
		"txt": "- Added \"Roll (Custom Formula)\" HP Increase Mode to Class Importer. This can be controlled by the GM using the new \"Hit Points Increase Mode\" and \"Hit Points Increase Custom Roll Formula\" Config options, or controlled by the player if these are left unset.\n- Added flavour text/speaker actor to Starting Equipment gold roll\n- The Creature Importer will now use ability-based save DCs for sheet items (rather than flat values), where possible. This can be turned off using the \"Prefer Flat Saving Throws\" Config option.\n- Fixed World Content Blocklist failing to open due to mis-named template file\n- Fixed Race Importer setting invalid token vision ranges for races with blindsight/tremorsense/truesight \n- Fixed rare case where token vision range could be set to an invalid value when using \"Prefer Metric Distance/Speed\" Config option\n- Added \"Custom Backend Endpoint\" Config option\n- (v10) Fixed crash when using the Bulk Directory Mover\n- (v10) Fixed crash when clicking document links in some cases\n- (v10) Fixed temporary document ownership being set to an unnecessarily permissive default value\n- (v10) Fixed crash when clicking \"Show Players\" button\n- (v10) Fixed canvas crash when box-selecting and moving multiple light sources\n- (Brew) Fixed Creature Importer failing to load homebrew `legendaryGroup`s\n- (Brew) Fixed Class Importer failing to load class feature `ref`s found in subclass features, and subclass feature `ref`s found in class features"
	},
	{
		"ver": "1.58.0",
		"date": "2022-11-05",
		"title": "Treasonous Days",
		"txt": "- Fixed case where Importers could fail to apply custom effects if custom data/flags were not also present\n- Fixed Rivet \"Whisper Rolls\" setting failing to have any effect\n- Fixed drag-dropping a Plutonium-imported document to a sheet killing the drag-drop process if Plutonium could not find the original entity\n- (Brew) Fixed over-zealous filtering of brew data, which could result in custom item types/properties failing to load\n- (Brew) Fixed crash when force-typing an item as `backpack` without the requisite item data\n- (v10) Revised the way many Importers apply custom active effects when importing directly to an actor; effects are now preferentially applied to their origin item rather than the actor (e.g. importing a barbarian's \"Rage\" feature should now attach effects to the \"Rage\" item, rather than the actor itself)\n- (v10) Race items created by the Race Importer now include race fluff\n- (v10) When importing a race to an actor using the Race Importer, an umbrella item is now created for the race, which includes: summary information (ability score improvements, size, speed); fluff; and links to all race feature sheet items created during the import\n- (v10) Fixed creatures created by drag-dropping Plutonium actors from Quick Insert using overly-permissive ownership\n- (v10) Fixed crash when importing a vehicle upgrade to an actor\n- (Server; v10) Added \"custom login\" script/style addon. If installed, this allows you to place a `login.<css|js>` in a world's directory; these files are then loaded and served when viewing the login screen, allowing custom login styling to be created on a per-world basis. _See the module README for more!_\n- (Server; v10) Added \"custom world\" script/style addon, similar to the \"custom login\" addon, above, but which loads `world.<css|js>` from a world's directory when the world is active. Note that a creating a small module to house world-specific CSS/JS is preferable to using `world.<css|js>`.\n- (Server; v10) Split out largely-unused \"package operations\" into own optional addon, removing needless security holes otherwise created by installing the backend mod"
	},
	{
		"ver": "1.58.1",
		"date": "2022-11-06",
		"txt": "- Fixed crash when importing a prepared spellcasting class"
	},
	{
		"ver": "1.58.2",
		"date": "2022-11-09",
		"txt": "- Added 'Add \"@items\" to Roll Data' Actor Config option, which, if enabled, allows references of the form `@items.big-sword.system.attackBonus` in sheet item fields\n- (Brew) Migrated support for `chooseData` to `chooseSystem`, removing the deprecated conversion path\n- (Brew) Added support for `chooseFlags`\n- (Brew) Added support for externally specifying active effect icons, by setting an `img` field"
	},
	{
		"ver": "1.58.3",
		"date": "2022-11-09",
		"txt": "- (Literally nothing)"
	},
	{
		"ver": "1.58.4",
		"date": "2022-11-23",
		"txt": "- Added \"Player Character\" checkbox to Creature Importer customizer, which attempts to convert an imported creature to a `\"character\"`-type actor\n- The health attribute used by the Token \"Display Missing Health\" Config option may now be customized\n- Improved compatibility with the Status Icon Counters module\n- Fixed drag-dropping imported items to a sheet, using the standard Foundry import, erroneously preserving IDs (which made it impossible to drop multiple copies of the same item to a sheet)\n- Fixed blocklist failing to be applied to optional features referenced in class/subclass/other features\n- Fixed crash when building roll data in non-dnd5e systems\n- Fixed documents temporary-imported with Rivet failing to render their sheets\n- Fixed positioning of Rivet/backend presence displays when video chat is in use\n- (Brew) Added support for subclass features outwith known \"gain subclass feature\" levels\n- (Brew) Added fluff support to Feat Importer\n- (Brew) Added fluff support to Object Importer\n- (Brew) Fixed rendering of group-selection dropdown in expertise picker"
	},
	{
		"ver": "1.58.5",
		"date": "2022-12-04",
		"txt": "- Added support for list syntax (`text: ...`, etc.) to importer lists, providing parity with site list pages\n- Added \"Text\" toggle to Adventure/Book Importers, allowing the creation of journal entries to be skipped\n- (Server) Added \"Enable/Disable Canvas\" buttons to login script sample"
	},
	{
		"ver": "1.58.6",
		"date": "2022-12-20",
		"txt": "- Fixed Race Importer crash when handling fluff text/images\n- Fixed Importers failing to strip @tags from tool/language proficiencies when adding to sheet\n- Fixed inconsistent sheet ownership when loading temporary documents via Quick Insert"
	},
	{
		"ver": "1.58.7",
		"date": "2022-12-22",
		"txt": "- Switched to \"indented italics\" instead of \"greyed-out text\" for entity version names in Importers\n- Fixed Level Up button failing to identify character class"
	},
	{
		"ver": "1.59.0",
		"date": "2022-12-26",
		"txt": "- Added Prerelease Content system\n- (Brew) Fixed Importers failing to correctly load dependencies from custom URLs/uploaded files"
	},
	{
		"ver": "1.59.1",
		"date": "2022-12-27",
		"txt": "- Fixed Importer crash when opening \"Additional Spells\" dialogue(s)"
	},
	{
		"ver": "1.59.2",
		"date": "2023-01-01",
		"txt": "- Added support for ability scores to Background Importer\n- (Brew) Added support for local prerelease content (matching functionality for local homebrew)"
	},
	{
		"ver": "1.59.3",
		"date": "2023-01-04",
		"txt": "- Fixed crash when opening Class/Subclass Importer after opening Class/Subclass Feature Importer\n- Fixed local prerelease/homebrew content failing to load"
	},
	{
		"ver": "1.59.4",
		"date": "2023-01-04",
		"txt": "- Fixed crash when loading spell data"
	},
	{
		"ver": "1.60.0",
		"date": "2023-01-11",
		"title": "Counting Down",
		"txt": "- Added support for dnd5e v2.1.0\n- The Class Importer now populates HP advancements where available\n- Added compatibility for Tidy5e sheet dark mode styling in popped-out sheets\n- Added support for splitting out \"extra damage if <creature> has advantage\" actions to Creature Importer\n- The Map Importer deduplication check now includes a partial image path comparison, to avoid excessively duplicating scenes with the same name but different images. Note that this only applies to scenes created from this version onwards.\n- Fixed crash when selecting additional spells from feats\n- Fixed Quick Insert integration always being enabled, even when disabled in the Config"
	},
	{
		"ver": "1.61.0",
		"date": "2023-01-15",
		"title": "A Harsh Mistress",
		"txt": "- Switched to a bundling approach for module script files, greatly reducing the number of HTTP requests required upon initial load (from ~250 to 1)\n- Fixed various feature which make use of dice rolls, and post the results to chat in the background, failing to disable the roll sound\n- (Brew) Added \"Clear Plutonium Flags\" directory document context menu option (disabled/not visible by default, and must be enabled in the \"Tools\" Config) which, if used on a directory document, will remove all `\"plutonium\"` flags from that document"
	},
	{
		"ver": "1.61.1",
		"date": "2023-01-15",
		"txt": "- Fixed some Importers failing to open"
	},
	{
		"ver": "1.61.2",
		"date": "2023-01-19",
		"txt": "- Fixed Map Importer list failing to visually differentiate between \"primary\" and \"extra\" sources\n- Fixed \"Compact Macros\" Config option having no effect\n- Fixed crash when opening the World Content Blocklist\n- Fixed crash when using Whistler's Item Rolls Extended (WIRE) and an actor with no active effects\n- (Brew) Added support for setting `\"foundrySceneRoot\"` and `\"foundrySceneFlags\"` on `image` entries. These are used by the Map Importer to add to the root data of an imported scene, and to add flags to an imported scene, respectively."
	},
	{
		"ver": "1.62.0",
		"date": "2023-01-26",
		"title": "Location, Location, Location",
		"txt": "- Added Foundry scene grid sizing/scaling data to the remaining 1395(!) maps which did not otherwise have this data (thanks @ Lyra)\n- Added Grid Type and Grid Unit filters to Map Importer\n- Added 'Use \"Pathfinder Token Pack: Bestiaries\" Tokens/Portraits' (experimental) Creature Importer Config option. If enabled, the Importer will attempt to source tokens from the \"Pathfinder Token Pack: Bestiaries\" module, if the module is available.\n- Added Rivet \"Minimum Permission Level\" Config option\n- Added Folder and Player filters to the Bulk Ownership Editor tool\n- Added \"Move Token Name Onto Token\" Token Config option\n- Compendiums may now be set as the Rivet import target, either by right-clicking the compendium in the directory, by using the menu in a compendium's header, or by manually inputting the compendium's ID into the appropriate Config field\n- Rolls logged to chat by Rivet now match the value rolled in the site\n- Table rolls sent via Rivet now include the full text/row result of the roll, rather than just the number rolled\n- Fixed handling of compendium-sourced tokens with scaling values other than \"1\"\n- Fixed Map Importer setting \"legacy hex\" flag on imported hex-grid scenes\n- Fixed crash when attempting to drag Map Importer rows\n- Fixed Rivet-whispered roll chat messages being formatted as a regular whisper, rather than a dice-roll whisper\n- Fixed Spell Importer failing to handle rare type of cantrip scaling (notably found in Green-Flame Blade)\n- Fixed Quick Insert integration rendering `undefined` tooltips\n- Fixed Quick Insert integration always setting \"Owner\" ownership for imported temp documents"
	},
	{
		"ver": "1.63.0",
		"date": "2023-02-03",
		"title": "Deck Insertion",
		"txt": "- Added Deck Importer\n- Added chat notification with link to the Automation Addon module <https://github.com/TheGiddyLimit/plutonium-addon-automation>, which is displayed if judged relevant (i.e., MidiQOL is running)\n- The Creature Importer can now parse damage rolls in non-action features\n- The Creature Importer can now set MidiQOL's \"No Dam Save\" flag when generating a sheet item, if judged appropriate\n- Added Item Importer 'Treat Extra Damage as \"Other Formula\"' option, which functions similarly to the existing 'Treat \"Alternate\" Attack Damage as \"Other Formula\"', but for imported items. This is automatically enabled when using the Automation Addon.\n- Improved compatibility of \"Compact Header Buttons\" styling with the Monarch module\n- Fixed tag system clobbering non-5etools tags (notably improving compatibility with the Mastercrafted module)\n- Fixed Adventure/Book Importer failing to folderize journals when not using the \"Treat Journal Entries as Folders\" option\n- Fixed Item Importer parsing too _much_ text in some cases (treating e.g. meta-references/notes as part of the main text), and too _little_ text in other cases (ignoring text from magic variants)\n- Fixed Item Importer regression where full SRD-image-fetching process wasn't being run\n- (Server) Fixed hook usage in custom login sample _[note that this does not require you to make any changes to your backend mod installation]_\n- (Brew) Improved support for Foundry-specific `magicvariant` data"
	},
	{
		"ver": "1.63.1",
		"date": "2023-02-04",
		"txt": "- Fixed Importers failing to fully apply Automation Addon `system` changes in some cases\n- Fixed Importer crash on attempting to create an item with proficiency-based uses in a world using \"proficiency dice\" rules\n- (Brew) Added Deck Importer support for per-card back image\n- (Brew) Fixed Deck Importer failing to set \"suite\" and \"value\" on imported cards"
	},
	{
		"ver": "1.63.2",
		"date": "2023-02-05",
		"txt": "- Fixed rendering of @tags in text"
	},
	{
		"ver": "1.63.3",
		"date": "2023-02-12",
		"txt": "- Reworked and improved performance of roll data generation with \"Add @items to Roll Data\" option enabled _[automatic, under the Automation Addon]_, which was otherwise causing lag when opening sheets\n- Switched to user-specific ownership when creating temporary documents from the Quick Insert integration, hopefully fixing various permission/sheet-opening issues for good\n- Updated compatibility with Tidy5e \"Prepared Spells\" field in the Class Importer, and added support for Tidy5e \"Multiclass Spellbook Filter\" to the Spell Importer\n- Fixed generic Foundry \"mystery man\" image being used as no-image fallback in actor Importers, instead of the intended \"blank token\" image\n- (Brew) Added support for `\"resource\"`s to the Creature Importer"
	},
	{
		"ver": "1.63.4",
		"date": "2023-02-13",
		"txt": "- Fixed many Importers crashing when attempting to render a player-opened temporary document via Quick Insert\n- Fixed Actor Importers failing to set player permissions on temporary documents imported via Quick Insert\n- Fixed sheet items being un-rollable from temporary documents\n- Fixed crash when importing temporary actors with spellcasting traits"
	},
	{
		"ver": "1.63.5",
		"date": "2023-02-21",
		"txt": "- Switched to `@attributes.prof` over `@prof` in generated expressions, to improve compatibility with \"proficiency dice\" variant rule\n- The Item Importer will now add any non-standard attunement requirements to the item's description, even if the \"Include Damage, Properties, Rarity, and Attunement in Description\" Config option is disabled\n- Fixed crash when using Token Action HUD due to un-linked dragon breath weapons"
	},
	{
		"ver": "1.63.6",
		"date": "2023-02-21",
		"txt": "- Added Foundry scene grid sizing/scaling data to Keys from the Golden Vault maps\n- Resetting a Config option as a player now resets to \"use GM's value,\" rather than \"factory default.\" This also fixes a minor UI bug where player-editable Config options would appear as \"set to a non-default value\" for players unless specifically overridden. _[Note that the default value for a player Config option was, and still is, implicitly the GM's value.]_\n- Fixed \"Fix ESC Key\" finding and closing some unwanted applications (notably, Token Action HUD's overlay) when pressing ESC\n- Fixed \"Fix ESC Key\" crash when pressing ESC on some module-specific canvas layers\n- Fixed dice pool sheet items having no activation type\n- Fixed Class Importer adding too much HP to advancements when rolling HP\n- Fixed Tidy5e \"prepared spell\" effect using wrong change mode\n- Removed defunct \"World/Module\" button from Adventure/Book Importers"
	},
	{
		"ver": "1.63.7",
		"date": "2023-03-12",
		"txt": "- Updated Monk's Little Details integrations for compatibility with split-out modules\n- Fixed Creature Importer crash when parsing certain data structures"
	},
	{
		"ver": "1.64.0",
		"date": "2023-03-30",
		"title": "Built Different",
		"titleAlt": "Built Exactly the Same",
		"txt": "- Added Content Updater tool, which allows previously-imported content to be checked versus the latest available version, and updated (either fully or partially)\n- Added (optional) patch to document loading system, improving compatibility between Plutonium-added Quick Insert content, and Monk's Enhanced Journals/Active Tile Triggers modules\n- Fixed loading of subclasses in Level Up button\n- Fixed Class/Subclass Feature Importer failing to copy some SRD effects to imported items\n- Fixed root IDs failing to be scrubbed from Importer-made copies of existing compendium documents "
	},
	{
		"ver": "1.64.1",
		"date": "2023-04-17",
		"txt": "- The Race Importer now (once again) imports speed directly to an actor's sheet, rather than as an active effect, to better enable _further_ active effects which rely on a non-zero speed existing\n- Added partial support (currently limited to spells and items) for diffing embedded documents on non-Plutonium-imported documents to the Content Updater. This allows, for example, spells and items imported to a player character to be updated using the Content Updater.\n- Improved Feat Importer parsing, allowing more usage constraints/recharge information to be correctly set\n- Added fallback path for badly-flagged classes to Level Up button, hopefully re-enabling the button in most cases (although do note that this does not work particularly well for homebrew classes/subclasses)\n- DFreds Convenient Effect's \"Custom Effects\" item is now treated as a special item which should not be modified/deleted by directory tools\n- Fixed deprecation warning when setting module compatibility settings\n- Fixed \"not supported\" error when attempting to import the \"Concentration\" status via Rivet\n- Fixed silent spellcasting failure when using MidiQOL with Plutonium's \"Spell Points\" options\n- Fixed sheet rendering performance when Level Up button is enabled and a non-Plutonium-imported class is present on a sheet\n- (Brew) Fixed crash when stripping `@tags` in class starting equipment "
	},
	{
		"ver": "1.64.2",
		"date": "2023-04-20",
		"txt": "- Added more fields to the Content Updater's default \"ignore\" list\n- Fixed Optional Feature and Spell Importers failing to fetch SRD effects from compendiums\n- Fixed crash when opening the Bulk Prototype Token Editor\n- Fixed crash when opening the Polymorpher\n- Fixed wrong changelog displaying in-client"
	},
	{
		"ver": "1.65.0",
		"date": "2023-04-29",
		"title": "11th Hour",
		"txt": "- Added compatibility for MidiQOL to \"Auto-Roll Multiattacks\" Config option, allowing both to be used in tandem\n- Added \"Time Between Multiattack Rolls\" Config option, allowing artificial delay to be imposed between each roll in an auto-rolled multiattack\n- Drag-dropping an image from the Art Browser will now show a (very) rough indication of image loading progress in the scene progress bar\n- Added \"Drag-Drop Position Anchor\" Art Browser Config option, which now defaults to \"Center\" (rather than the old \"Top-Left\" implicit default)\n- Dropping an image from the Art Browser now activates the layer the image was dropped into\n- Added \"Create Token from Image URL\" macro\n- Refined and simplified logic for applying token \"Display Missing Health\" text/tweaking token text, to improve compatibility with other token-affecting modules\n- Fixed Content Updater crash when updating embedded documents belonging to non-Plutonium-imported documents\n- Fixed Creature Importer failing to change creature name in actions/etc. when renaming an already-named creature (such as Strahd von Zarovich)\n- Tweaked Importers to activate directory tabs _after_ importing content, rather than before, to slightly mitigate slowdown caused by viewing the imported-to directory while a large import is running\n- (Server) Added \"custom setup\" script/style addon. If installed, this allows you to place a `setup.<css|js>` in your data folder; these files are then loaded and served when viewing the setup screen, allowing custom styling. _See the module README for more!_ _[Note that this is mostly intended for removing adverts in v11, but has been back-ported to v10 for general use.]_\n- _[(v11) Added initial v11-compatible version (Patron-only, until Foundry v11 stable is released)]_"
	},
	{
		"ver": "1.66.0",
		"date": "2023-05-02",
		"title": "Another Dimension",
		"txt": "- Added rudimentary 3D Canvas integration (note that the \"3D Canvas\", \"3D Canvas Mapmaking Pack\", and \"3D Canvas Token Collection\" modules must be active for this integration to activate)\n  - The Creature Importer will now set a token's \"3D Model\", if a token is available in the 3D Canvas Token Browser\n  - When using the \"Customize and Import\" flow of the Creature Importer, a path to a 3D Model can be set, either by choosing from the list of options for that creature, or by specifying a custom path\n  - Added a \"Has 3D Model\" filter to the Creature Importer\n- Fixed \"Display Missing Health\" text appearing on tokens when the option is disabled\n- Fixed Content Updater crash when attempting to analyze non-Plutonium-imported sub-documents\n- Fixed Creature Importer failing to correctly set damage immunity/resistance/vulnerability \"Physical Bypasses\" when multiple bypasses were available\n- Fixed Creature Importer failing to rename creatures within lair action/regional effect text"
	},
	{
		"ver": "1.66.1",
		"date": "2023-05-02",
		"txt": "- Added 3D Canvas integration support to the Vehicle Importer\n- Added \"Customize and Import...\" option to Vehicle Importer, allowing tokens and 3d models to be customized during import\n- Fixed various cases where Importers were being improperly initialized, which resulted in 3d models failing to be set in certain situations (besides other minor bugs)"
	},
	{
		"ver": "1.66.2",
		"date": "2023-05-11",
		"txt": "- (Brew) Added \"Additional Font\" auto-loading when importing content containing custom `@font` tags\n- (Brew) Added support for recent homebrew schema changes (table `\"colLabelGroups\"`; vehicle `\"hpNote\"` tags; etc.)"
	},
	{
		"ver": "1.67.0",
		"date": "2023-05-25",
		"title": "Legs",
		"txt": "- (v11) Added support for v11\n- The Creature Importer can now import to existing actors. When doing so, the name/portrait/token image of the original actor is preserved (unless it is a default image); this can be adjusted via the \"Customize and Import\" flow.\n- Overhauled \"progress bar\" app, improving styling and allowing sub-task information to be shown (for example, when importing a spellcaster via the Creature Importer, log messages from the Spell Importer are now visible; when importing class to an actor via the Class Importer, log messages from the Class Feature Importer are now visible; etc.).\n- Added Babele integration for SRD content. If enabled, and Babele is active, Plutonium will attempt to translate names and descriptions during import.\n- Added \"Maximum\" and \"Minimum\" predefined HP modes to Class Importer\n- Added \"Has Plutonium Flags\" to directory tool filters, allowing imported content to be easily filtered in/out\n- Added `\"srd5e.importComplete\"` hook support for class and subclass imports\n- Added warning to Art Browser if the backend mod is not detected\n- Added list of compatible backend mod versions to the module, which are checked against the backend mod (if installed). A notification will be shown if a version mismatch is found.\n- Fixed Race Importer failing to show versions as distinct from base entity\n- Fixed Spell Importer failing to apply customizations when importing to directory\n- Fixed Creature Importer lowercasing \"Type\"/\"Type (With Tags)\" folder names\n- Fixed Config values sometimes failing to save when programmatically changed en-masse\n- Fixed Compendium Visibility Toggler tool appearing in every directory menu _except_ for the one in the compendiums tab\n- (v11) Added \"Embedded URL\" journal page type, with the same functionality as the old \"Embedded URL\" sheet for \"Text\"-type pages\n- (v11) Added \"Compact Compendium Packs\" UI option\n- (v11) Added support for \"None\" token disposition in Importer Configs and Bulk Prototype Token Editor\n- (v11) Reworked \"Compendium Visibility Toggler\" tool to \"Compendium Ownership Updater\", allowing compendium ownership to be updated en-masse\n- (Brew) Added support for `\"foundrySystem\"` on `\"monster\"`-, `\"vehicle\"`-, `\"object\"`-, and `\"trap\"`-type entities\n- (Brew) Custom content (either loaded from file, or from custom URL) is now dynamically assigned as either \"prerelease\" or \"homebrew\" based on the contents of the file, rather than always being considered \"homebrew\"\n- (Brew) Fixed Feature Importers double-importing damage immunities/vulnerabilities/resistances and condition immunities\n- (Brew) Added support for `\"preparedSpellsProgression\"` on classes"
	},
	{
		"ver": "1.67.1",
		"date": "2023-05-25",
		"txt": "- (v11) Fixed manifest using v10 manifest/download links, instead of v11 versions"
	},
	{
		"ver": "1.68.0",
		"date": "2023-05-27",
		"title": "Retooling",
		"txt": "- Added support for dnd5e v2.2.x (and removed support for previous version(s))\n- Improved Class Importer handling of tool proficiencies"
	},
	{
		"ver": "1.68.1",
		"date": "2023-05-28",
		"txt": "- Removed manifest conflict listing for Babele\n- (Brew) Fixed internal spell source lists failing to update when loading successive brews"
	},
	{
		"ver": "1.69.0",
		"date": "2023-06-14",
		"title": "Local Man Can't Stop Stealing",
		"titleAlt": "nice",
		"txt": "- Added port of D&D Beyond Importer icon set, greatly expanding the number of documents which import with pretty icons (notably, non-SRD classes/subclasses, non-SRD items, and creature features)\n- Importers now skip rendering directories in some cases, improving performance of temporary imports, and greatly improving performance of large imports\n- Improved compact compendium styling in the presence of long names\n- Added Importer button to compendium title menu; this opens the importer targeting the compendium\n- Fixed Content Updater crash on un-loadable entities\n- Fixed temporary documents, e.g. those created by clicking an `@<tag>[...]`, failing to set correct ownership when created by a user with some document creation permissions\n- Fixed Importers failing to open when targeting rollable tables\n- Fixed Item Importer active effect settings for potions, especially in the presence of automation modules\n- Fixed display of scene thumbnails when using compact scene styling\n- Fixed Importer crash when attempting to load additional data for some features "
	},
	{
		"ver": "1.69.1",
		"date": "2023-06-15",
		"txt": "- Fixed Importer Wizard failing to render folder configuration\n- Fixed Importer Wizard allowing Importers to be opened against document-type-mismatched compendiums "
	},
	{
		"ver": "1.69.2",
		"date": "2023-06-18",
		"txt": "- Reduced log spam when failing to parse ATL effects \n- Fixed Importer crash when attempting to load empty file/URL source\n- (Brew) Fixed loading performance regression"
	},
	{
		"ver": "1.69.3",
		"date": "2023-06-18",
		"txt": "- Fixed module failing to load\n- (Brew) Fixed Class Importer failing to convert `@tags` in fluff"
	},
	{
		"ver": "1.70.0",
		"date": "2023-07-02",
		"title": "Do Not Call Up That Which You Cannot Put Down",
		"txt": "- Added integration for the \"Foundry Summons\", causing per-source Plutonium compendiums to be available for selection in Foundry Summons' settings\n- Added buttons to open the World Data Source Selector and World Concent Blocklist from the appropriate Config tab\n- Fixed Importer crash when attempting to find images for imported features\n- Fixed Bulk Ownership Editor crash when attempting to set journal ownership\n- Fixed Feature Importers failing to clean up temporary IDs in some cases, leading to broken links in rendered text\n- Fixed token status visual effects (e.g. invisibility) failing to apply\n- Fixed inconsistency when SHIFT-clicking `@UUID[Actor.Item.]` links"
	},
	{
		"ver": "1.70.1",
		"date": "2023-07-03",
		"txt": "- Fixed Foundry Summons integration failing to persist and load selected \"Summoning Sources\"\n- (v10) Fixed crash when applying active effects"
	},
	{
		"ver": "1.70.2",
		"date": "2023-07-23",
		"txt": "- Improved compatibility with the \"Token Action HUD\" module\n- Fixed Creature Importer handling of secondary damage/\"other formula\" damage (generally in the presence of the 'Treat \"Save Halves\" Additional Attack Damage as \"Other Formula\"' Config option or the 'Treat \"Alternate\" Attack Damage as \"Other Formula\"' Config option)\n- Fixed Creature Import Customizer token picker having no \"Select File\" button\n- Fixed Class Importer failing to detect renamed classes (e.g. those renamed by Babele) when levelling up\n- Fixed subrace blocklist failing to be applied\n- Fixed Hazard Importer failing to populate text\n- Fixed Quick Import integration crash when attempting to index some homebrew data\n- (v11) Fixed Importer failing to access and create directories when attempting to save images\n- (Brew) Added Importer support for \"anyExotic\" language proficiencies"
	},
	{
		"ver": "1.70.3",
		"date": "2023-08-04",
		"txt": "- Improved compatibility with the \"Simple Calendar\" module; the alternate window-closing flow used when the \"Fix ESC Key\" Config option is enabled will now ignore any persistent Simple Calendar windows\n- Fixed Creature Importer crash when attempting to rename a creature with few/no actions/etc.\n- Fixed Item Importer failing to correctly set item proficiency in some cases\n- (Automation) Added optimistic effect-generating fallback for spells with no well-defined effects\n- (Automation) Expanded data passed to Automation Addon, (hopefully) improving integration results in some cases"
	},
	{
		"ver": "1.70.4",
		"date": "2023-08-07",
		"txt": "- Fixed spell range data failing to populate\n- Fixed Replacement Data Compendiums always preferring SRD renames, rather than the original name\n- (Automation) Improved Creature Importer flag determination logic for MidiQOL \"No Dam Save\" and \"Full Dam Save\""
	},
	{
		"ver": "1.70.5",
		"date": "2023-08-13",
		"txt": "- Added support for dnd5e v2.3.x (and removed support for previous version(s))\n- Added \"Level Up\" button support for sheets added by the \"Compact DnDBeyond 5e Character Sheet\" module\n- Improved compatibility with the \"Remote Highlight UI\" module, hopefully avoiding crashes during import\n- Fixed Creature Importer crash when attempting to rename a creature during customization"
	},
	{
		"ver": "1.70.6",
		"date": "2023-08-16",
		"txt": "- (\"Show Parent Icon/Name For Child @UUIDs\" Config option is now off by default)"
	},
	{
		"ver": "1.70.7",
		"date": "2023-08-20",
		"txt": "- Added \"you are about to override\" warning to Actor Importers when attempting to import an actor to an existing actor's sheet\n- Added support for main site changes (Illegal Drug item type; reward fluff)  \n- Active effect evaluator now falls back on default Foundry type path if no type for a field is defined in the game system model\n- Fixed active effect evaluator over-eagerly evaluating untyped values\n- Fixed active effect evaluator failing to load custom types before initial evaluation of active effects"
	},
	{
		"ver": "1.70.8",
		"date": "2023-09-06",
		"txt": "- Added \"Level Up\" button to level-zero character sheets, avoiding the need to use the Class Importer directly on newly-created sheets (this can be disabled using the 'Display \"Level Up\" Button on New Characters' Config option)\n- Moved various data-source-related Config options from the \"Import\" section to the \"Data Sources\" section\n- \"Fixed\" Tidy5e sheet integration \"prepared spells\" active effect crashing when importing some classes _([the effect is no longer added])_\n- (v11) Fixed Bulk Prototype Token Editor using v10 bar options, instead of the improved v11 options (notably, the superior AC bar property)\n- (v11) Fixed crash when using the Actor/Item sheet \"Show to Players\" button"
	},
	{
		"ver": "1.70.9",
		"date": "2023-09-11",
		"txt": "- Fixed Config failing to populate missing values on load, which could result in a broken Config Editor when loading a saved config\n- Fixed Spell Importer failing to convert \"untyped\" damage rolls\n- Fixed Spell Importer failing to convert some healing expressions\n- Fixed Spell Importer failing to populate some flags when run with Automation Addon"
	},
	{
		"ver": "1.71.0",
		"date": "2023-09-19",
		"title": "Ten Lives out of Nine",
		"txt": "- Reworked adventure/book importers\n  - Internal `@adventure`/`@book`, and `@area` tags, in imported adventures/books are now converted to UUIDs linking to the exact header in the imported content\n  - Adventures/books now always import as a journal entry with the adventure/book's title as the journal entry name (rather than optionally being importable into an existing journal entry)\n  - \"Update existing\" Duplicate Handling Mode for adventures/books has been simplified, and now includes an \"are you sure?\" prompt\n- Added 'Allow \"&quot;\"Header Anchors\" in Notes' Config option. If enabled (default), a \"Header Anchor\" may be specified when creating or editing a map note. When opening a journal entry via a map note with a Header Anchor set, the journal entry will scroll to that header.\n  - Drag-dropping a header from a journal entry's contents to the canvas will autofill this field with the appropriate anchor\n- Added class/subclass/level folder path options to Class & Subclass Features Importer\n- Fixed Item Importer over-zealously trimming spellcasting focus description text when \"Include Damage, Properties, Rarity, and Attunement in Description\" Config option is disabled\n- Fixed empty sheet menus displaying as a near-invisible empty menu; a help message will now be displayed instead"
	},
	{
		"ver": "1.71.1",
		"date": "2023-09-23",
		"txt": "- (Brew) Added support for `\"foundryTokenScale\"` on entities with tokens"
	},
	{
		"ver": "1.71.2",
		"date": "2023-10-18",
		"txt": "- Added 'Disable the \"Level Up\" Button Until Character Has Enough XP' Config option\n- Fixed Creature Importer failing to override ammo requirements for imported creature weapons in the presence of \"Replacement [Item] Data Compendiums\"\n- Fixed Background Importer crash when importing custom features\n- Fixed Item Importer preferring generic variant images over base item images for imported weapons\n- (v11) Compendium \"Delete All [Contents]\" option now also removes folders\n- (Brew) Added support for \"weaponSimpleRanged\" and \"weaponMartialRanged\" in starting equipment\n- (Brew) Improved specificity of error when failing to load local files\n- (Brew) Fixed Importer crash when attempting to save entity with invalid image URL\n- (Brew) The Level Up Button will now respect custom changes to `CONFIG.DND5E.CHARACTER_EXP_LEVELS`"
	},
	{
		"ver": "1.71.3",
		"date": "2023-10-22",
		"txt": "- The Content Updater may now update `name`/`img`/`source` (disabled by default; enable via the \"Configure Skipped Fields\" option in the Content Updater)\n- Fixed Level Up button being incorrectly disabled in some cases\n- Fixed Map Importer placement of area markers on scaled maps (thanks @ Funnbot)\n- Fixed Adventure/Book Importer producing broken links to subheadings\n- (v10) Added explicit version check on startup, and restricted manifest to v10 only\n- (Brew) Fixed some hoverables failing to load when hovered in a session other than the session the content was imported in (`@homebrew` tags, `@footnote` tags, etc.)"
	},
	{
		"ver": "1.71.4",
		"date": "2023-10-29",
		"txt": "- Added \"Deselect All\" and \"Select By...\" buttons to the Content Updater, to allow a specific field _[ :^) ]_ to be easily updated\n- Added map grid data for all remaining maps (thanks @ Lyra)"
	},
	{
		"ver": "1.71.5",
		"date": "2023-11-07",
		"txt": "- Fixed Content Updater crash when attempting to Analyze worlds containing certain document structures\n- Fixed Prepared Spell Mass-Toggler crash when opening"
	},
	{
		"ver": "1.71.6",
		"date": "2023-11-07",
		"txt": "- (Update dependencies)"
	},
	{
		"ver": "1.71.7",
		"date": "2023-11-09",
		"txt": "- Increased app rendering timeout duration _[an unreasonably short test value was being used, which could partially or completely prevent workflows from running on slower internet connections/hardware]_"
	},
	{
		"ver": "1.71.8",
		"date": "2023-11-15",
		"txt": "- Tweaked scrollbar CSS on Firefox (\"thin\" scrollbars should now be used in Plutonium windows)\n- Added \"Display Sources\" Config option to Quick Insert integration (enabled by default); this replaces the generic \"Plutonium\" marker in the results with a source abbreviation\n- Fixed Quick Insert integration crash when attempting to index \"cards\" documents\n- (Brew) Added fluff support to Trap Importer"
	},
	{
		"ver": "1.72.0",
		"date": "2023-11-20",
		"title": "Tenminus Est",
		"txt": "- Added support for dnd5e v2.4.x (and dropped support for previous v2.3.x)\n  - The Race Importer now creates a \"race\"-type item, and sets some advancements, when importing a race\n  - The Class Importer now populates skill/save advancements, in addition to the advancements previously populated\n  - The Background Importer now makes better use of advancements\n  - Added Config option to disable \"Template Prompt\" checkbox to various Importers (most notably the Spell Importer)\n  - The Item Importer now uses the new \"dusk\"/\"dawn\" recharge types, where appropriate\n  - The Item Importer now sets \"Loot\" item subtypes, where appropriate\n  - Various other minor migrations\n- Dropped support for Foundry v10\n- Fixed Importers failing to set feature type on imported features (with the exception of \"monster feature\", which is (not) yet set)\n- Fixed wrong changelog showing when using \"Avoid Loading Local Data\" option\n- Fixed player \"Restore Transformation\" press failing to prompt the GM to delete their ex-transformed actor\n- (Brew) Improved automatic parsing of cantrip text, reducing reliance on `\"scalingLevelDice\"`"
	},
	{
		"ver": "1.72.1",
		"date": "2023-11-23",
		"txt": "- Updated Bulk Prototype Token Editor to better reflect system token options\n  - Added \"Unlinked\" section with \"Append Number to name of Unlinked Tokens?\" and \"Prepend Adjective to name of Unlinked Tokens?\" options\n  - Replaced \"Dim\"/\"Bright Vision\" with \"Vision Range\" and \"Vision Mode\" options\n  - Added \"(No update)\" option for \"Has Vision\"\n  - Split \"Light\" section from \"Vision\" section\n- Importers (notably the Creature Importer) can now set Detection Modes on imported tokens, and correctly set Vision Range/Vision Mode\n- Fixed \"ADD\" active effects missing leading operator\n- Added map grid data for CoA/DSotDQ/BMT/SATO/TDCSR maps (thanks @ Lyra)"
	},
	{
		"ver": "1.72.2",
		"date": "2023-12-03",
		"txt": "- The Creature Importer can now set \"Advantage on Initiative\" flag for creatures with appropriate traits\n- Fixed Item Importer using \"UPGRADE\" for speeds, where \"OVERRIDE\" was required to have any positive effect\n- Fixed crash when attempting to drag-drop a Plutonium entity to a sheet \n- (Automation) Increased specificity of data passed to Automation Addon during import, allowing correct active effects/etc. to be chosen in more cases\n- (Automation) Fixed crash when attempting to import a table"
	},
	{
		"ver": "1.72.3",
		"date": "2023-12-06",
		"txt": "- Importers will now set token vision saturation to \"-1\" if the imported entity only has darkvision, simulating the \"can't discern color\" aspect. The new \"Token Vision Saturation\" Config option(s) can be used to control this behaviour. _[Note that under default Foundry rendering this should not affect color viewed in lit areas.]_"
	},
	{
		"ver": "1.73.0",
		"date": "2023-12-22",
		"title": "Feature-Rich",
		"titleAlt": "(Detrimentally)",
		"txt": "- Reworked actor Importers, to split out \"feature\" Importers\n  - Added Creature Feature Importer, and (hidden/API-only) Object Feature Importer, Trap Feature Importer, and Vehicle Feature Importer\n  - Added more metric conversion options to above importers; notably, the Creature Feature Importer can now import metric ranges/AoEs\n  - Added per-\"feature\" Importer Config options; notably, the Creature Feature Importer has a new \"Scale to Target Actor CR\" option (enabled by default), which will attempt to scale features imported to an actor to that actor's CR. This uses a stripped-down version of the CR Scaler _[ymmv]_.\n  - Improved Content Updater handling of features created by the above importers (although the initial diff may require some features to be re-imported)\n- Reworked Creature Importer equipment handling to produce more consistent results, and improve (although not perfect) handling of equipment used in a creature's actions/etc.\n- Added `dnd5e` system requirement to module manifest\n- Reworked Loot Generator currency handling when drag-dropping to an NPC sheet\n  - Dropping currency (either as loot including currency, or an individual generated currency item) to an NPC sheet now creates (or updates, if it exists) a sheet item detailing the currency _[this avoids the case where, using e.g. the default `dnd5e` sheet, currency would be visually \"lost\" when dropped to an NPC sheet]_\n  - The \"Import Currency as Sheet Item for NPCs\" Config option can be used to toggle between the \"sheet item\" and \"regular currency data\" modes\n  - Fixed sheet drop handling of generated currency items\n- Reworked Adventure/Book Importer progress flow, to display everything in one progress bar, and to enable more granular \"Cancel\" requests\n- Reworked Adventure/Book Importer journal map note creation to better re-use existing map note images\n- Fixed Class Importer failing to add Unarmored Defense active effects\n- Fixed Adventure/Book Importers failing to import maps when the main adventure/book text was not selected\n- Fixed Other Options & Features Importer crash when importing an entity with \"senses\" data\n- Fixed Adventure/Book Importers wrapping images in link tags, breaking Foundry's default \"click journal image to pop out\" flow\n- Fixed Item Importer showing every item as requiring attunement\n- Fixed Table Importer crash when importing table groups\n- Fixed Map Importer incorrectly scaling regions (and therefore mis-positioning journal pins) in some cases\n- Fixed race condition when loading icons, resulting in inconsistent icons being applied for sheet items in some cases\n- Fixed Content Updater crash when attempting to create embedded documents\n- Fixed Psionics Importer crash when running with default resource config (although existing config may need to be reset for this to take effect)"
	},
	{
		"ver": "1.73.1",
		"date": "2023-12-30",
		"txt": "- Added map grid info for maps in Heroes' Feast: Saving the Childrens Menu, Grim Hollow: Lairs of Etharis, and Dungeons of Drakkenheim (thanks @ Lyra)\n- Added \"Deduplicate Nested Feature Selection\" Class & Subclass Features Importer Config option; when set to \"Deduplicate\" (the new default), the importer will ignore selected features which are already part of another, also selected, feature\n- Added \"Spell Scroll Price Mode\" Spell Importer Config option, which allows control over the price of imported scrolls\n- Fixed Loot Generator failing to create map notes on drag-drop\n- Fixed alignment of Loot Generator map notes\n- Fixed rendering of `@cite` tags\n- Fixed Map Importer mis-positioning of map notes when combining multiple positional transformations\n- Fixed rare Importer crash when spell selection was skipped\n- Fixed minor compatibility issue with \"Beaver's Crafting Module\""
	},
	{
		"ver": "1.73.2",
		"date": "2024-01-03",
		"txt": "- (Automation) Added workaround for some scaling class advancements failing to match identifiers expected by integrations"
	},
	{
		"ver": "1.74.0",
		"date": "2024-01-06",
		"txt": "- The Content Updater may now be run on compendiums. This is disabled by default, and must be enabled via the Content Updater's \"Configure\" button. Note that locked compendiums are ignored.\n- Improved Item Importer usage of ported D&D Beyond Importer icon set, providing better icons for ~450 items _[a number bloated by all the specific variants included; realistic number unknown]_\n- Fixed Content Updater crash when attempting to update a very large number of documents\n- (Switched to `mirror-2` as the primary image source and secondary data source)"
	},
	{
		"ver": "1.74.1",
		"date": "2024-01-10",
		"txt": "- Added \"Auto-Roll Multiattack Names\" Config option, allowing \"Auto-Roll Multiattack\" customization for actions not specifically called \"Multiattack\"\n- Added \"Level Up\" button compatibility for kgar's Tidy5e sheet"
	},
	{
		"ver": "1.74.2",
		"date": "2024-01-25",
		"txt": "- Hover links may now be drag-dropped to the window to import the linked entity\n- Fixed Art Browser failing to load\n- Fixed Creature Importer failing to import variants as features when \"Import Variants as Features\" Config option is enabled\n- Fixed crash when fetching entity name with Babele module active\n- Fixed Level Up Button being displayed on level 0 sheets when 'Display \"Level Up\" Button on New Characters' Config option is disabled\n- (Brew) Fixed non-site paths incorrectly receiving `img/` prefix when saving to local"
	},
	{
		"ver": "1.74.3",
		"date": "2024-02-01",
		"title": "Not That Update",
		"txt": "- Added \"Hide Sheet Menu Button\" UI Config option\n- Added level filtering to optional feature selectors in Importers (e.g. when picking Eldritch Invocations as a Warlock)\n- Added \"Apply Level Filter when Opening on Actor\" Config option to Other Options & Features Importer\n- Improved compatibility with the \"Item Linking\" module when using Replacement Data Compendiums\n- Fixed crash when attempting to use the Level Up button\n- Fixed crash when drag-drop importing a class to a sheet\n- Fixed crash when attempting to open the Polymorpher\n- Fixed \"Large Import\" warning failing to render\n- Fixed Blocklist failing to apply to class starting equipment choices\n- Fixed \"Move Token Name Onto Token\" Config option failing to apply unless other Token Config options were also active\n- _[Note that this update does *not* add support for dnd5e v3.0.0. Maybe Soon:tm:.]_"
	},
	{
		"ver": "1.75.0",
		"date": "2024-02-04",
		"title": "That Update (Part One)",
		"txt": "- Added initial support for dnd5e v3.0.x (and dropped support for previous v2.4.x)\n  - When the \"Import Packs to Actors as Constituent Items\" option is enabled (the default), imported items will now be added to their container item\n  - Added \"Identify when Importing\" Config option, and changed default to better support \"unidentified item\" changes\n  - Switched from black-background fallback icons to transparent-background versions of the same icons, to better match the system default. Additionally, switched some fallback icons to new system defaults.\n  - Reworked Vehicle Importer sheet item generation (notably for Spelljammer ships) to combine \"equipment\" and \"attack\" into a single \"weapon\" item, where possible\n  - Importers will attempt to appropriately set item `type`, where available\n  - Importers will attempt to appropriately set item concentration, where available\n  - (Various migrations to handle breaking changes, sheet changes, etc.)\n- Fixed crash when fetching compendium images\n- Fixed homebrew failing to load in various cases"
	},
	{
		"ver": "1.75.1",
		"date": "2024-02-05",
		"txt": "- Fixed Level Up button causing crash/failing to be added to sheet when \"Disable Experience Tracking\" is enabled\n- Tweaked styling of Level Up button to better match sheet buttons\n- Fixed opening an Importer via a \"Open Last-Used Importer\" button displaying an empty importer"
	},
	{
		"ver": "1.76.0",
		"date": "2024-02-11",
		"title": "Part Two",
		"txt": "- Added initial token Dynamic Rings support\n  - Added \"Enable Token Dynamic Rings\" Creature Importer Config option; when enabled, the Creature Importer will attempt to find and populate token \"dynamic ring\" options with an appropriate \"subject\" image during import\n  - Added various Creature Importer Config options allowing dynamic rings to be customized\n  - (Reworked Importer token-loading internals to better support similar changes and/or additional token modules in future)\n- Item Importer can now categorize \"loot\"-type items as art objects/gemstones\n- Reworked Config Editor \"color\" options to allow hex values to be easily viewed/input\n- (Brew) Added/improved fluff support for `feat`s, `optionalfeature`s, and `reward`s"
	},
	{
		"ver": "1.76.1",
		"date": "2024-02-19",
		"txt": "- Removed use of \"legacy\" dnd5e resources from Config options (although they may still be entered as \"custom\" resources)\n- Added support for non-homebrew content-specific fonts (i.e., Humblewood)"
	},
	{
		"ver": "1.77.0",
		"date": "2024-03-10",
		"title": "Light Work",
		"txt": "- Added Spotlight Omnisearch integration\n- Importers may now use `&Reference` enrichers in imported text; this can be controlled via the \"Use Enrichers\" Config option\n- Overhauled Importer compendium use, improving accuracy of SRD/replacement content lookup and icon acquisition\n- Improved Pop Out compatibility with dnd5e 3.0.x sheets _[all credit to the maintainer of the PopOut! module for their fixes to the dnd5e itself; Plutonium's Pop Out may soon be sunset in favour of PopOut!]_\n- Improved compatibility with Material Plane module (hopefully)\n- Fixed style naming collision with dnd5e 3.0.x sheets; style naming collision with Combat Tracker Extensions module\n- Fixed \"Compact Chat\" Config option failing to apply to chat message headers\n- Fixed Level Up button required role check being ignored in some cases\n- Fixed Creature Importer failing to import \"x/rest\" spells\n- Fixed journal link clicks navigating to top of chapter instead of correct heading\n- (Brew) Improved Table Importer handling of non-standard roll formulas\n- (Brew) Fixed Importers failing to load and apply `\"foundry<X>\"` data"
	},
	{
		"ver": "1.78.0",
		"date": "2024-03-23",
		"title": "Contents May Differ",
		"txt": "- Added initial support for dnd5e v3.1.x (and dropped support for previous v3.0.x)\n  - General compatibility fixes\n  - Importers can now set concentration modifiers (bonuses, advantage, etc.), where available\n  - The \"Fast Animations\" UI Config option now additionally affects the show/hide speed of various accordion elements\n  - Importers can now create \"summon\"-type actions, although these are not yet meaningfully populated _[more to come In A Future Update:tm:]_\n- The Item Importer can now import items to \"container\"-type items, when opened from an item's sheet header\n- Improved handling of items in containers in Directory Cleaner and Item Cleaner tools, with additional UI and filtering option\n- The Equipment Shop no longer allows spending more gold than is available, unless the new \"Allow Over-Spending\" Config option is enabled\n- Fixed missing directory context menu items (\"Set as Rivet Target\", \"Clear Plutonium Flags\", etc.)\n- Fixed display of inline headers in imported content"
	},
	{
		"ver": "1.78.1",
		"date": "2024-03-24",
		"txt": "- Importers may now generate `[[/save ...]]` enrichers, if the \"Use Enrichers -> Save DC\" Config option is enabled\n- Improved active effect calculation performance\n- Tweaked Importer caching to reduce memory usage when using multiple importers"
	},
	{
		"ver": "1.78.2",
		"date": "2024-03-26",
		"txt": "- Fixed wrong Importers being shown when opening the Import Wizard on a compendium\n- Fixed incorrect `@name` roll data in embedded documents\n- Fixed Importers never rendering `[[/damage ...]]` enrichers"
	},
	{
		"ver": "1.78.3",
		"date": "2024-04-02",
		"txt": "- Improved compatibility with MidiQOL module\n- Improved compatibility with Loot Sheet NPC 5E module\n- Improved compatibility with Tidy 5e Sheets module\n- Synced 3d token index from 3D Canvas Token Collection module, adding ~400 models to this list of those which the Creature and Vehicle Importers can use during import\n- Fixed Background Importer attempting to load non-existent file in some cases"
	},
	{
		"ver": "1.79.0",
		"date": "2024-04-23",
		"title": "Lost in the Sauce",
		"txt": "- (Reworked Importer source loading to better enable future changes)\n\t- Added missing abbreviation aliases to source lists (i.e. searching \"PHB\" will now show the \"Player's Handbook\" source)\n\t- Fixed selecting a source (e.g. \"5etools\") which includes another source's content (e.g. \"Monster Manual\") creating duplicate list items\n\t- _[Note that this represents a major piece of internal rejigging; expect bugs]_\n- Importers may now generate `/damage` enrichers which include the trailing damage type\n- Added grid info for Vecna: Nest of the Eldritch Eye and new Curse of Strahd battlemaps (thanks @ Lyra)\n- Reworked Importer rendering to (hopefully) reduce rare OoM crashes\n- Fixed Rivet failing to import to compendiums\n- Fixed Importers failing to correctly enable \"Dynamic Token Ring\" unless one or more effects was active\n- (Brew) Fixed crash when importing unknown vehicle speed modes"
	},
	{
		"ver": "1.80.0",
		"date": "2024-05-06",
		"title": "Bit Dark In Here",
		"titleAlt": "Through a Glass, Darkly",
		"txt": "- Added \"Preferred Color Scheme\" Config option, with a choice between \"Browser Default\", \"Light\", and \"Dark\". _[This will eventually be controlled by Foundry v12+'s option of the same name, once Foundry rolls out color scheme support to all major apps]_\n- The Map Importer may now fetch wall data from the new \"Plutonium Scenes\" repository (<https://github.com/TheGiddyLimit/plutonium-scenes> -- contributions welcome)\n- Improved placement of map region pucks\n- Changes to `CONFIG.DND5E.currencies` are now respected, provided they are made prior to the `\"ready\"` hook firing\n- Fixed Supernatural Gifts and Rewards failing to import\n- Fixed Importers incorrectly transferring status-inflicting effects to own actor\n- Fixed rare Importer crash when importing features with specific requirements\n- Fixed rendering of `@card[...]` and `@itemMastery[...]` tags\n- (Brew) Added support for `\"foundrySceneWalls\"`, and initial support for `\"foundrySceneLights\"` on map `\"image\"` entries\n- (Brew) Added support for `\"displayName\"` on `\"packContents\"` items\n- (Brew) Fixed search integrations (Quick Insert; Spotlight Omnisearch) failing to load when homebrew is force-selected in the World Data Source Selection\n- (Brew) Fixed token URL being incorrectly constructed when using \"site reference\" token info"
	},
	{
		"ver": "1.80.1",
		"date": "2024-05-21",
		"txt": "- Added \"Adventure/Book Name\" as folder option to Map Importer\n- Added optional arguments to \"Create Named Token\" API method (`\"backgroundUrl\"`, `\"font\"`, `\"textColor\"`, and `\"textShadowColor\"`)\n- Added \"Minimum Permission Level for <X>\" config for all directory tools\n- Improved Map Importer by-name list sorting\n- Fixed Class Importer duplicating Unarmored Defense active effects; other similar effects\n- Fixed Importers double-importing \"required\" features from options pickers\n- The Creature Importer will now use shorthand embedded item references in descriptions where possible, to better support moving imported actors to/from compendiums\n- Fixed Map Importer journal note puck sizing in rare cases\n- Fixed Map Importer failing to respect \"Generate Scene Thumbnails\" Config option; fixed Map Importer double-generating scene thumbnails\n- Fixed Map Importer failing to generate unique names for unnamed maps\n- Fixed Creature Importer failing to recognize some wildcard token path formats when using \"Customize and Import\" flow\n- Fixed Adventure/Book Importer duplicating maps on sequential imports\n- Fixed Directory Deduplicator false positives when de-duplicating imported scenes\n- Fixed styling of sheet Level Up button; other minor elements\n- Improved compatibility with Template Macro module\n- Improved compatibility with Effect Macro module\n- (Brew) Added post-import \"consumed item resource\" linkage step to various Importers, ensuring consistent linking regardless of import order\n- (Brew) Fixed Importers failing to handle `\"anyProficientTool\"` expertise"
	},
	{
		"ver": "1.81.0",
		"date": "2024-05-26",
		"title": "Double Vees Up",
		"txt": "- Added v12 version _[see: <https://github.com/TheGiddyLimit/plutonium-next/releases/tag/v1.81.0>]_\n- Added compatibility for dnd5e 3.2.x\n  - The Item Importer can now set metric units when the \"Convert Item Weights to Metric\" Config option is enabled\n  - The Item Importer now uses the \"Optional Attunement\" Attunement mode, where appropriate\n  - Importers now use the \"Ritual Only\" spell preparation mode, where appropriate\n  - The Feat and Other Options & Features Importers now set \"Required Level\", where appropriate\n- Added more Dynamic Ring \"subject\" tokens\n- Added Dynamic Ring support to the Object Importer _[with a whopping 3 tokens available]_\n- Fixed Map Importer by-name list sorting in the presence of decimal numbers\n- (Brew) Fixed `optionalfeature` references failing to be generated/loaded in the presence of homebrew"
	},
	{
		"ver": "1.81.1",
		"date": "2024-05-27",
		"txt": "- Added Vecna: Eve of Ruin map grid data (thanks @ Lyra)\n- Fixed Feat and Other Options & Features Importers crashing when importing prerequisite-less entries\n- (v12) Fixed crash when measuring distance from a token"
	},
	{
		"ver": "1.82.0",
		"date": "2024-06-23",
		"title": "Cauldronomicon",
		"txt": "- Added Tasha's Cauldron of Everything \"summon\" creature versions\n- Added \"Populate Summons Profiles\" Config option, enabled by default. When enabled, a \"summon\" spell may have its summon data populated with Plutonium-specific IDs; attempting to summon a creature with the spell will first import that creature (to a configurable folder), and then continue the standard summon flow.\n- Added enchantments to Tasha's Cauldron of Everything Optional Features\n- Added \"Spellwrought Tattoo\" mode to the Spell Importer, as an additional alternative to importing a spell in \"Spell Scroll\" mode. Note that this is only available when using the Tasha's Cauldron of Everything module, as Spellwrought Tattoos are not supported by the default `dnd5e` system.\n- Added icons to various Tasha's Cauldron of Everything features, items, and spells which previously lacked them\n- Reworked Config \"compendium\" fields from plain text to a widget which:\n  - Allows a compendium to be added by drag-and-drop\n  - Allows a compendium to be clicked on to open/view that compendium\n- Added Phandelver and Below: The Shattered Obelisk and Tasha's Cauldron of Everything compendiums to default Importer \"Additional Data Compendiums\" lists\n- Added \"Use Advancement-Backing Compendium\" Config option. If enabled, Importers will copy advancement features to a custom compendium during import, allowing advancements to later be edited without losing features.\n- Added \"Copy ID\" button to compendium header menu\n- Added `*` as \"select all\" to Content Updater \"Select By...\"\n- Fixed Importer usage of advancements, ensuring that (among other things) imported features are displayed in the correct sheet section\n- Fixed \"Import via Plutonium?\" drag-drop prompt discarding document creation flags when continuing document creation\n- Fixed character HP increase active effect format being used in NPC actors\n- Fixed internal currency conversion reverting to 1:1:1:... coin exchange rates if a currency conversion value was missing (i.e., when using a module which modifies coin exchange rates)\n- (Brew) Added Item Importer support for simultaneous use of `\"bonusWeapon\"` and `\"bonusWeaponDamage\"`\n- (Brew) Added Item Importer support for `\"subEntities\"`"
	},
	{
		"ver": "1.82.1",
		"date": "2024-06-24",
		"txt": "- Fixed compendium Config migration failing on missing values"
	},
	{
		"ver": "1.82.2",
		"date": "2024-06-24",
		"txt": "- Fixed crash when loading class icons"
	},
	{
		"ver": "1.82.3",
		"date": "2024-06-24",
		"txt": "- Fixed advancements failing to be set when the Effect Macro module is active\n- Fixed crash when importing an exported Config\n- Fixed \"Create Named Token\" and \"Create Token from Image URL\" macros failing to set token image"
	},
	{
		"ver": "1.82.4",
		"date": "2024-07-10",
		"txt": "- Add \"Left-Align Scene Names\" UI option\n- Fixed Class Importer crash when importing placeholder subclasses\n- Fixed Deck Importer crash\n- Fixed rare crash when using \"Auto-Roll Multiattacks\" option\n- Fixed possible infinite loop when using \"Auto-Roll Multiattacks\" option with customized \"Auto-Roll Multiattack Names\" config\n- Fixed Art Browser failing to set token image when used in \"Tokens\" mode\n- (v12) Fixed Creature Importer crash when setting non-scaled dynamic token image\n- (Removed `game.modules.get(\"srd5e\")` API alias)"
	},
	{
		"ver": "1.83.0",
		"date": "2024-07-19",
		"title": "Three's a Crowd",
		"txt": "- Added support for dnd5e 3.3.x (while maintaining compatibility with 3.2.x and 3.1.x)\n  - The Spell Importer may now populate the \"Source Class\" field, where available\n  - Updated \"summon\" spell support to avoid crashes when using Plutonium summons\n- Adventure/Book Importer may now use `@Embed` when rendering embedded statblocks\n- Adventure/Book Importer now scans for and presents embedded statblocks for import\n- Added Quests from the Infinite Staircase map grid data (thanks @ Lyra)\n- Restored mistakenly-removed `game.modules.get(\"plutonium\").api`\n- Fixed crash when expanding list previews\n- Fixed Map Importer failing to re-link map notes links when re-importing an existing map in \"Update existing\" Duplicate Handling Mode\n- Fixed Table Importer crash when importing a table group from secondary flows (including from within the Adventure/Book Importer)\n- Fixed Adventure/Book Importer generating invalid UUID links for imported entities in rare cases\n- (v12) Fixed crash when opening the Bulk Prototype Token Editor's \"Configure Editor\" window"
	},
	{
		"ver": "1.83.1",
		"date": "2024-07-20",
		"txt": "- Fixed Adventure/Book Importers failing to combine same-source attached entities into single checkboxes\n- Fixed Importer duplicate handling confusing spells and items (i.e., \"Shield\" the spell, and \"Shield\" the item)\n- (Brew) Improved error handling when dereferencing class/subclass features\n- (Brew) Adventure/Book Importers now render stub table on un-imported `\"statblock\"` entry, rather than misleading \"Loading...\" text\n- (Brew) Fixed rare cases where known sources would not be given their color styling\n- (Brew) Fixed regression in error handling when loading adventure-/book-attached entities"
	},
	{
		"ver": "1.83.2",
		"date": "2024-07-20",
		"txt": "- Fixed Adventure/Book Importer crash when attempting to import specific adventures/books"
	},
	{
		"ver": "1.84.0",
		"date": "2024-08-18",
		"title": "Unusual Suspects",
		"txt": "- The Race Importer now populates skill/language advancements\n- The Trap Importer now tags basic attack-type effects as \"weapon\"s\n- Updated \"Quick Insert\" module integration to improve compatibility with version 3.y.z\n- Added Plutonium-specific tooltips/previews to Plutonium Quick Insert search results\n- Updated \"DFreds Convenient Effects\" module usage for compatibility with version 7.y.z\n- Improved compatibility with \"Polished UI\" module\n- Improved compatibility with \"Token Variant Art\" module\n- Added missing progress message for Importer \"Finalizing\" step\n- Converted Equipment Shop \"Allow Over-Spending\" boolean Config option to \"Minimum Permission Level For Over-Spending\"\n- Fixed Creature Importer adding weapon properties to natural/etc. weapon attacks\n- Fixed Class Importer setting incorrect HP advancements for non-sidekick classes when importing to an NPC actor\n- Fixed Content Updater crash when attempting to analyze imported decks in certain states\n- Fixed Importers polluting default token settings during import\n- (Brew) Improved Creature Importer handling of homebrew spellcasting levels\n- (Brew) Improved Creature Importer handling of non-standard passive perception values\n- (Brew) Fixed Item Importer failing to show specific variants for homebrew base items"
	},
	{
		"ver": "1.84.1",
		"date": "2024-08-22",
		"txt": "- Improved Quick Insert integration \"`@auto`\" context support\n- Fixed Bulk Prototype Token Editor failing to set token scale values\n- Fixed Creature Importer failing to set token scale values\n- Fixed rare crash when importing a class via the Class Importer\n- Fixed rare Importer crash when attempting to link consumables\n- Fixed World Content Blocklist failing to load blocklisted entities"
	},
	{
		"ver": "1.84.2",
		"date": "2024-09-15",
		"txt": "- Added \"Use Baldur's Gate 3 Icons\" Class Importer Config option (enabled by default)\n- Added \"Import Fluff Text to Description\" and \"Import Fluff Images to Description\" Class Importer Config options\n- Fixed tags-within-tags failing to be found by the Adventure/Book Importer as potential sub-entities to import\n- Fixed tags-within-tags rendering in journal entries created by Adventure/Book Importer\n- Fixed startup console error on player login when no GM is online\n- Fixed crash when using SRD compendiums as replacement compendiums\n- Fixed startup crash when using other game systems\n- Fixed advancement-backing compendium default permissions\n- Fixed Race Importer console warning when setting advancements\n- Removed border from Plutonium-imported images in journal entries\n- (Brew) Adventure/Book Importers now allow selection between multiple adventures/books defined in a single source \n- (Brew) Creature `\"token\"` information, referring to an existing site token, is additionally used to source a dynamic token subject (where available)\n- (Brew) Importers will now prefer linking, rather than embedding, `\"collapsed\"` `\"statblock\"` entries"
	},
	{
		"ver": "1.84.3",
		"date": "2024-09-20",
		"txt": "- Fixed Importer Image Preloader always re-downloading image URLs containing commas\n- Fixed rare \"Save Imported Images to Server\" Config option crash when attempting to create directories"
	},
	{
		"ver": "2.0.0",
		"date": "2024-10-31",
		"title": "Retrofuturistic",
		"titleAlt": "Trick *And* Treat",
		"txt": "- Dropped support for Foundry v11\n- Bumped required `libWrapper` dependency to `v1.13.0.0`\n- Added PHB'24 content; switched to 2024 rules as standard _[2014 module versions will remain available via <https://github.com/TheGiddyLimit/plutonium-next>]_\n  - Reworked Background Importer flow to better support '24 rules\n  - Added automatic migration for various data when using old classes/species/background\n    - Species and Backgrounds are forward-migrated per '24 character creation rules\n    - Additional spells are forward-migrated to '24 versions, where available\n    - Starting equipment items are migrated to '24 versions, where available\n  - Renamed various UI elements to better match '24 rules\n  - Various UI elements will now use/reference/link '24 content, rather than '14 content\n  - Added support for site-style version redirects when hovering a source-ambiguous hover link\n  - Added \"Rules Version\" Miscellaneous Config option, which can be switched between \"Modern (2024)\" and \"Classic (2014)\". Note that, for dedicated 2014 rules usage, a prior module version is preferred.\n- Added recursive feat/optional feature support; an optional feature may now grant a feat, which grants an optional feature, which grants a ...\n- The Species Importer will now populate advancements for: armor proficiencies; weapon proficiencies; tool proficiencies; damage resistances\n- The Background Importer will now populate advancements for: ability score increases; skill proficiencies; language proficiencies; armor proficiencies; weapon proficiencies; tool proficiencies; damage resistances\n- Added \"Include Mastery Text in Description\" Item Importer Config option\n- Revised Equipment Shop/Starting Equipment UI, adding more add/remove buttons, and allowing list left/right-click to add/remove items\n- Switched to \"Type\" for default sort column in Equipment Shop item list\n- Added \"Exclude Legacy\" Config option to search module integrations (Quick Insert; Spotlight Omnisearch)\n- Reworked Importer language handling, adding blocklist support, and an easier path to future expansion/future homebrew support\n- Reworked Importer weapon proficiency handling, adding blocklist support, and support for homebrew item proficiencies\n- Added Item Importer support for containers with a specified \"volume\" capacity (rather than weight/item capacity)\n- Reworked Config internals to validate loaded values earlier, and increase performance of fetching/setting values later _[you may see browser console warnings on startup as your old Config runs its initial self-heal]_\n- Reworked default advancement drag-drop suppression to handle additional edge-cases, and avoid timing hacks\n- Reworked rendering of some Importer dialogs, allowing vertical expansion when selecting an option with visible content which would overflow the dialog\n- The \"Pathfinder Tokens: Bestiaries\" integration will now use `dnd5e`-specific indexes in addition to `pf2e`-specific indexes, improving token coverage\n- Improved performance of Importer compendium caching when the same compendium is required multiple times in quick succession\n- Improved Auto-Roll Multiattack roller handling of '24-style names\n- Improved Creature Importer handling of various '24 summoned creature attributes\n- Improved Importer parsing of '24 on-rest recharge\n- Improved Importer parsing of '24 reactions\n- Improved Importer parsing of '24 \"Magic\" actions\n- Improved Importer parsing of '24-style feature use counts\n- Improved Class Importer handling of '24-style Unarmored Defense text\n- Added Spell Importer approximation of target info for common area types\n- Fixed Species Importer failing to match \"inverted\" name formats when searching (e.g. \"Forest Gnome\" instead of \"Gnome (Forest)\")\n- Fixed proficiency selectors failing to alphabetically sort proficiencies\n- Fixed Importers failing to show the count of visible list items on initial render\n- Fixed Importer hang when closing a feat selection dialog without selecting a feat\n- Fixed Recipe Importer failing to render ingredient lists\n- Fixed Rules Importer failing to list generated-from-book rules content\n- Fixed Creature Importer lair initiative formatting when using non-legacy NPC sheet\n- Fixed \"Pathfinder Tokens: Bestiaries\" integration failing to index tokens\n- Fixed Creature Importer failing to parse action/etc. recharge uses in some cases\n- (Server) Added \"folder max depth\" mod, as the \"Render >4 Levels of Folder Nesting\" option no longer functions in v12 without backend support\n- (Server) Hardened \"package operations\" security, moving it from \"guaranteed hole\" to \"merely very risky\"\n- (Brew) Added custom dynamic token subject support, via `\"foundryTokenSubjectHref\"`\n- (Brew) Added `\"bonusSenses\"` support to various importers, as a simplified alternative to specifying custom active effects\n- (Brew) Added `\"featProgression\"` support\n- (Brew) Fixed Class Importer failing to populate optional feature/feat progressions for no-feature-gained levels"
	},
	{
		"ver": "2.0.1",
		"date": "2024-11-01",
		"txt": "- Added Scions of Elemental Evil map grid data (thanks @ Lyra)\n- Fixed Spell Importer \"Spell Points\" mode breaking sheet layout"
	},
	{
		"ver": "2.0.2",
		"date": "2024-11-04",
		"txt": "- Added \"Allow Import Redirects for `@tag` Links\" Config option (enabled by default); with this option enabled, clicking a link rendered from a source-ambiguous `@tag` (e.g. `@spell[fireball]`) will attempt to import the '24 version rather than the '14 version\n- The Spell Importer will now approximate rudimentary targeting information for single- and multiple-target spells\n- Fixed player-specific Config settings (i.e., for non-GM users) incorrectly hiding all GM-set values until \"Reset\"\n- Fixed deprecation warnings when posting whisper chat messages\n- Fixed Importers failing to set damage types for '24 content\n- Fixed Table Importer failing to import `9x-00` d100 results in some cases"
	},
	{
		"ver": "2.1.0",
		"date": "2024-11-18",
		"title": "Housing Crisis",
		"txt": "- Added rudimentary bastion Facilities Importer\n- Added Equipment Shop \"Use Rarity Pricing\" option (disabled by default). If enabled, and using \"Modern (2024)\" rules, magic items will be given prices according to their rarity and the \"Magic Item Rarities and Values\" DMG'24 table\n- Added 'Minimum Permission Level for \"Show Players\"' Config option\n- Improved compatibility with the \"5e-Sheet Resources Plus\" module\n- Fixed Importers failing to set correct proficiencies when importing an entity with mixed skill/tool proficiencies\n- (Brew) Fixed migrations failing to be applied to files loaded from URL"
	},
	{
		"ver": "2.1.1",
		"date": "2024-11-23",
		"txt": "- The Creature Importer will now automatically migrate statblock spells to '24 versions when using '24 rules mode\n- Added \"Hide Update Notifications\" Config option (disabled by default _[:^)]_\n- Added grid info for DMG'24 maps (thanks @ Lyra)\n- (Brew) Fixed automatic '14 migration of UA: Strixhaven subclasses"
	},
	{
		"ver": "2.1.2",
		"date": "2024-12-02",
		"txt": "- (Compatibility for site changes)"
	},
	{
		"ver": "2.1.3",
		"date": "2024-12-09",
		"txt": "- Added Config option to disable \"Auto-Switch Sidebar Tabs\" when importing\n- Added line width approximation to Spell Importer target approximation\n- Fixed junk log warning when waiting for some custom Importer UIs (Polymorpher; Ability Score Improvement \"Choose a Feat\") to render\n- Fixed `@classFeature`/`@subclassFeature` tags failing to import item on click\n- Fixed some journal Importers overwriting instead of skipping duplicates when using \"Skip duplicates\" Duplicate Handling Mode\n- Fixed importing to table failing to set associated compendium in resulting table row\n- Fixed Creature Importer failing to scale innate spells in some cases\n- Fixed Importer crash when attempting to save image with \"Base Media URL\" Config option set\n- (Brew) Added support for feat progression on feats"
	},
	{
		"ver": "2.2.0",
		"date": "2024-12-31",
		"title": "Technicality",
		"txt": "- Added support for dnd5e 4.1.x, and dropped support for dnd5e 3.x.y\n  - _[Note that this represents a complete rewrite of much of the module's internals. There will be bugs; caveat emptor.]_\n  - Overhauled Foundry \"Item\" importers; importers will now attempt to generate appropriate activities for imported documents. Additionally, more importers will attempt to set attack/saving throw/etc. information, and more in-depth content parsing is done generally, when compared to previous versions.\n  - Overhauled Bastions Importer to populate \"facility\" items\n  - The \"Rules Version\" Config option now has a \"Use game setting\" mode (which is now the default)\n  - The \"Set Value From Rarity\" Item Importer Config option, and fixed Equipment Shop population of specific variant prices to correctly match book values\n  - The \"Use Spell Points\" Config option now implements point scaling via a custom formula, allowing spells to be scaled on cast (provided the \"Enabled, and Unlock Slots\" mode is used)\n  - Reworked Actor Multiattack Roller to support activities\n  - The Spell Importer will now attempt to populate a spell list display for newly-imported spells\n  - (Various other minor fixes and improvements)\n- Improved Creature Importer cache loading performance on first creature import (>5 seconds faster on my machine)\n- The \"Preferred Color Scheme\" Config option now has a \"Use game setting\" mode (which is now the default)\n- When using the active effect \"Find Active Effect Attribute Key\" UI on an item's effects, the results now include possible actor attribute keys\n- Added partial workaround for linking `@tag` names containing square brackets\n- Fixed World Content Blocklist failing to apply to classes if any subclass for that class was not blocklisted\n- Fixed Adventure/Book Importer handling of non-embeddable inline entities\n- Fixed Class Importer double-population of skill activities\n- (Brew) Added \"pointPool\" resource support\n- (Brew) Fixed homebrew migrations failing to apply to uploaded files"
	},
	{
		"ver": "2.2.1",
		"date": "2025-01-01",
		"txt": "- Added \"Import Features to Description\" Class Importer option\n- Fixed starting equipment display when using '14 rules"
	},
	{
		"ver": "2.2.2",
		"date": "2025-01-02",
		"txt": "- Fixed Class/Subclass Feature Importer crash when importing feature which is present in SRD compendiums"
	},
	{
		"ver": "2.2.3",
		"date": "2025-01-07",
		"txt": "- Various improvements and fixes to the Creature Importer\n  - Added support for more styles of innate at-level-X spell\n  - Expanded parsing support for damage expressions; half-damage text; conditional damage formats\n  - Fixed various damage false-positives when generating activities\n  - Fixed over-eager activity damage merging, which could merge unrelated damage rolls into prior attack/save activities in some cases\n  - Fixed spells failing to populate when importing a creature to a compendium\n  - Fixed crash when clicking \"plus PB\" rollers\n  - Fixed \"plus PB\" rolls/DCs failing to generate matching values in activities\n  - Fixed \"Regional Effects\" activities having junk activation values\n- Added tolerance for invalid system rules version\n- Fixed crash when opening a character sheet when the \"Level Advancement without XP\" system Levelling Mode setting is used\n- Fixed Adventure/Book Importer \"Set folder path for <x> import\" buttons failing to show importer's configured folder path\n- Fixed Plutonium-configured Rules Version failing to override system-configured Rules Version for Plutonium-specific usage"
	},
	{
		"ver": "2.2.4",
		"date": "2025-01-19",
		"txt": "- Added \"Unsaved Changes\" prompt when attempting to close World Data Source Selector and/or World Content Blocklist with unsaved changes\n- Added \"Exclude Modern\" Config option, the inverse of the existing \"Exclude Legacy\" Config option, to search module integrations\n- Improved compatibility with the \"Tidy 5e Sheets\" module's 4.x ApplicationV2 sheets\n- Improved compatibility with the \"System Customizer\" module, fixing a potential startup crash\n- Improved Importer parsing of various activity information\n  - Creature swarm damage with additional rider damage\n  - Creature damage with complex/multi-part/conditional rider damage\n  - Creature activity targeting\n  - Creature self-item-charge-consuming activities\n  - Creature \"automatic hit\" to-hit\n  - Creature non-damaging attacks\n  - Player activity ranges\n  - Spell multi-target targeting\n- Improved Trap Importer rendering of trap description\n- Fixed crash when attempting to expand previews in Creature Importer list\n- Fixed Importer crash when finalizing an import to a synthetic token actor\n- Fixed rare Class Importer crash when building descriptions for classes/subclasses\n- Fixed Class Importer failing to consider blocklist when applying internal \"reprinted\" filtering to sub-features\n- Fixed Equipment Shop/Item Importer failing to halve rarity-based cost for consumables\n- Fixed Importer crash when setting expertise\n- Fixed Creature Importer producing broken links for items which refer to lists of other items (eye rays; breath weapons)\n- Fixed crash when clicking a non-'24-redirected `@tag`\n- Fixed Class Importer failing to migrate subclass spells to '24 versions when importing a '14 subclass under '24 rules\n- Fixed rare roll crash on missing actor spellcasting ability\n- Plutonium's \"Report a Bug\" form now includes Foundry's basic \"Support Details\" information\n- (Added thumbnail image for module in Setup screen)\n- (Rivet) Added Chrome Manifest V3 extension version"
	},
	{
		"ver": "2.2.5",
		"date": "2025-01-21",
		"txt": "- Improved Creature Importer handling of \"Flee, Mortals!\" retainers and companion\n- Fixed hidden crash when loading feature pickers for features with sub-feature references"
	},
	{
		"ver": "2.3.0",
		"date": "2025-01-22",
		"title": "Second-Hand Smoke",
		"txt": "- Added support for dnd5e 4.2.x (maintaining support for dnd5e 4.1.x)\n  - Added \"Metric Volume\" Config options; support for setting metric volumes on containers in Items importer\n  - Added explicit \"Use game setting\" option to Importer Config option metric settings (previously this was implicit regardless of option chosen)\n  - Various minor Importer improvements (Vehicle Importer feature type tweaks; Creature Importer telepathy, habitat, and treasure support; Item Importer \"energy cell\" ammo type support)\n- Adventure/Book Importers now expand lists of `@creature` tags into lists of embeds (and embedded statblocks, under 4.2.x)\n- Fixed Importer failing to pre-populate actor ID when importing temp actor documents, leading to invalid links in some embedded items"
	},
	{
		"ver": "2.3.1",
		"date": "2025-02-05",
		"txt": "- Added support for Dynamic Token Ring (where available) to the Vehicle Importer\n- Added support for half-PB spell recharge to various Importers\n- Improved Spell Importer target approximation for single- and multi-target spells\n- Fixed Level Up button being non-interactable when using \"Level Advancement without XP\" system Leveling Mode\n- Fixed \"Preferred Color Scheme\" Config option not being player-editable\n- Fixed Creature Importer mis-identifying \"check\" DCs as \"save\" DCs in some cases\n- Fixed crash when using non-actor compendiums as actor Additional/Replacement Data Compendium\n- Fixed Creature Importer crash when importing a creature with a \"Parry\" reaction, when the Midi QOL module is active"
	},
	{
		"ver": "2.3.2",
		"date": "2025-02-07",
		"txt": "- The Class Importer prefixes class/subclass feature names with \"Level <x>: ...\" in Modern mode\n- Fixed rare Class Importer crash when building class/subclass descriptions"
	},
	{
		"ver": "2.4.0",
		"date": "2025-02-16",
		"title": "Triskaidekaphilia",
		"txt": "- Added support for dnd5e 4.3.x (maintaining support for dnd5e 4.2.x)\n- Adventure/Book Importers may now redirect attached '14 content to '24 versions during import, where available\n- Fixed Spell Importer failing to add basic \"Cast\" activity if no other activities were generated\n- Improved Spell Importer target approximation for line spells\n- Improved Feature Importer handling of resource consumption; Importers should now be more likely to add \"use-self-item\" resource consumption to created activities\n- Added Hold Back The Dead map grid and wall data (thanks @ Lyra)\n- (dnd5e 4.1.x) Fixed Creature Importer crash when importing a creature with treasure\n- (Brew) Improved Map Importer support for externally-specified wall data\n- _[(v13) Added initial v13-compatible version (Patron-only, until Foundry v13 stable is released)]_\n- _[(v13) Replaced \"Disable Animations\" and \"Avoid Disabling Animations for Ruler Movement\" options with \"Use ALT To Skip Token Animations\" option]_"
	},
	{
		"ver": "2.4.1",
		"date": "2025-02-18",
		"txt": "- Fixed default Equipment Shop \"Category\" filter preferring generic variants over specific variants"
	},
	{
		"ver": "2.4.2",
		"date": "2025-02-23",
		"txt": "- Fixed Creature Importer failing to apply '24 creature initiative proficiency\n- Fixed Importers failing to apply \"Default Weapon Target\" option\n- Fixed Importers failing to display '14 weapon/tool proficiencies when in legacy rules mode\n- Fixed Importers failing to create \"consumes-self\" activity data in some cases\n- (Rivet) Added \"Allow Actor Overwrite Imports\" (disabled by default) Config option; this prevents Rivet from attempting to clobber existing actors when importing an actor with the \"Target Document\" set to an actor"
	},
	{
		"ver": "2.4.3",
		"date": "2025-03-02",
		"txt": "- When customizing an actor's token using the \"Customize and Import...\" flow, \"Dynamic Token Ring\" will now be automatically disabled for that actor\n- Fixed Spell Importer producing junk activities for spells in the '14 SRD\n- Fixed '14-version-locked imports using '24 art for sheet items\n- Fixed Spell Importer approximating target areas for spell attacks\n- _[(v13) Updated for compatibility with v13 Testing 2 (Patron-only, until Foundry v13 stable is released)]_\n- _[(v13) Enabled and revised now-supported rollable table header menu items; compendium header menu items]_\n- _[(v13) Tweaked compact styling to support sticky folder scrolling]_\n- _[(v13) Fixed \"Clear Plutonium Flags\" context menu option failing to clean flags from nested embedded documents]_\n- _[(v13) Fixed crash when using the rollable table \"Row Cleaner\" tool]_\n- _[(v13) Fixed crash when importing a creature with non-standard AC value]_\n- _[(v13) Fixed various minor styling bugs]_"
	},
	{
		"ver": "2.5.0",
		"date": "2025-03-24",
		"title": "Touch Class",
		"txt": "- Added activities and effects for Player's Handbook '24 class features _[though not subclass features, Yet:tm:]_\n- Expanded Item Importer \"equipment\" handling (notably to include \"clothes\" items)\n- Item specific variants will now prefer legacy base items when using \"Legacy (2014)\" Rules Version\n- The Creature Importer will now prefer relative UUIDs over absolute UUIDs when generating \"Spellcasting ...\" sheet item text, improving usability when imported to a compendium\n- The Class/Subclass Feature Importer may (optionally) use class images as fallback if no icon is found for an imported feature\n- Fixed inconsistent loading of starting equipment when using only homebrew sources in the Class Importer\n- Fixed Importers failing to populate active effect \"origin\" in most cases\n- Fixed Creature Importer setting invalid AC formula when \"Use Static AC Values\" option is enabled\n- Fixed Adventure/Book Importers failing to migrate links to legacy creatures in some cases\n- Fixed Adventure/Book Importers duplicating imports of migrated legacy creatures\n- Fixed sheet Item Cleaner tool failing to sort by \"Type\"\n- _[(v13) Updated for compatibility with v13 Testing 3 (Patron-only, until Foundry v13 stable is released)]_\n- _[(v13) Added handling for ESC menu when \"Fast Animations\" UI option is enabled]_\n- _[(v13) Migrated \"Preferred Color Scheme\" Config option to always use new core \"Theme and Color Scheme - Applications\" setting, removing various undesirable edge-cases]_\n- _[(v13) Fixed 'Add \"Delete\" to Navbar Scene Context Menu' Config option having no effect]_"
	},
	{
		"ver": "2.5.1",
		"date": "2025-03-30",
		"txt": "- Fixed Vehicle Importer crash when importing a vehicle with weapons\n- Fixed Artificer infusions missing \"enchant\" activities\n- Fixed various activity/effect data typos\n- Fixed crash when attempting to report an error before UI notifications are available for use\n- _[(v13) Updated for compatibility with v13 Testing 4 (Patron-only, until Foundry v13 stable is released)]_\n- _[(v13) Fixed `Show Folder Linked by @UUID[Folder.] on Click` Config option, and added automatic parent-folder expansion]_"
	},
	{
		"ver": "2.6.0",
		"date": "2025-04-20",
		"title": "Supporting Cast",
		"txt": "- Added activities and effects for Player's Handbook '24 subclass features\n- Added Spellcasting \"Preparation Formula\" value population for '24 classes\n- The Item Importer will now generate basic \"Cast\" activities for items with attached spells\n- Added filters to source selection UIs (notably in the Import Wizard). These allow an undesirable source (e.g. a \"WIP\" or \"Invalid\" homebrew) to be filtered out.\n- Importers may now render descriptions in imported active effects\n- Revised Importer use of UUIDs (notably around \"Summon\" and new \"Cast\" activities) to produce \"valid\" UUIDs, while maintaining Plutonium-required data\n  - While this future-proofs against an import bricking your world, it has the downside of making Plutonium-specific fake-UUIDs hard to read. The following API methods are therefore made available:\n    - Generating a UUID; `game.modules.get(\"plutonium\").api.util.uuidFauxCompendium.getCustomUuid({tag: \"spell\", text: \"Fireball|XPHB\"})`\n    - Checking if a UUID is a Plutonium UUID; `game.modules.get(\"plutonium\").api.util.uuidFauxCompendium.isCustomUuid(uuid)`\n    - Unpacking a Plutonium UUID; `game.modules.get(\"plutonium\").api.util.uuidFauxCompendium.getCustomUuidInfo(uuid)`\n- Revised \"Create Named Token\" macro to use a token border/background appropriate to the configured game \"Rules Version\". This may be overridden with the `styleHint: \"<one|classic>\"` option.\n- Fixed various inconsistencies in custom system/effect/activities data for pre-2024 sources\n- Fixed Quick Insert/Spotlight Omnisearch integration failing to index some fluff images\n- Fixed Warlock always-prepared spells failing to import with \"Pact Magic\" spell preparation mode\n- Fixed Item Importer setting incorrect ability check ability for '24 tools\n- Fixed Map Importer incorrectly scaling walls in the presence of grid scaling\n- Fixed Importers failing to set temporary document (i.e., when created by clicking a link to view an entity which is not present in the world) permissions in some cases\n- Fixed Importers failing to set valid activity images in some cases\n- _[(v13) Updated for compatibility with v13 Testing 5 (Patron-only, until Foundry v13 stable is released)]_\n- _[(v13) Removed \"Skip Token Animation When ALT Key Held\" Config option, in favor of using the new `SHIFT+TAB` key combo when dragging a token (which enables teleport movement)]_"
	},
	{
		"ver": "2.6.1",
		"date": "2025-04-23",
		"txt": "- (Brew) Fixed Importer handling of \"Fine\"/\"Diminutive\"/\"Colossal\" token sizes\n- (Brew) Fixed Class Importer crash when loading a class with deprecated-format fluff"
	},
	{
		"ver": "2.6.2",
		"date": "2025-04-25",
		"txt": "- Fixed Level Up button failing to recognize legacy subclass imports\n- Fixed log warning spam when evaluating an expression which contains `@statuses. ...`"
	},
	{
		"ver": "2.7.0",
		"date": "2025-05-03",
		"title": "13 Btw",
		"txt": "- Added support for Foundry v13. _[Note that the \"current\" manifest URL now points to the v13 version. See <https://github.com/TheGiddyLimit/plutonium-next/releases> for v13/v12 version-specific manifest URLs.]_\n- Added support for dnd5e 4.4.x/5.0.x (and removed support for previous dnd5e versions)\n  - (v12) Added support for dnd5e 4.4.x (and removed support for previous dnd5e versions)\n  - (v13) Added support for dnd5e 5.0.x (and removed support for previous dnd5e versions)\n  - Updated Polymorpher to use new system transformation dialogue\n  - (v13) Updated sheet compatibility for Plutonium menus; actor Level Up button; Plutonium-specific drag-and-drop\n- The Imem Importer may now set casting ability for attached spells, where available\n- Fixed Spell Importer failing to set resource consumption for imported spells\n- Fixed Item Importer handling of attached spells with specified casting level\n- Fixed crash when opening non-actor \"cast\" activity created by an Importer\n- Fixed \"Token Scale\" Config option failing to be applied in actor Importers\n- Fixed Class Importer excessively filtering linked optional features for '14 subclasses on '24 classes\n- Fixed Loot Generator failing to set item quantity when drag-dropping loot to an actor\n- (v13) Fixed Importer windows failing to move to front when re-opened\n- (v13) Migrated various Foundry API usages away from deprecated versions\n- (v13) Consolidated the look of dialog windows\n- (v13) Fixed crash when opening Loot Generator\n- (v13) Fixed position of backend/Rivet status pips when A/V is active\n- (v13) Fixed sidebar and scene bar context menu additions"
	},
	{
		"ver": "2.7.1",
		"date": "2025-05-12",
		"txt": "- Added \"Grapple\" and \"Shove\" actions to optionally-created \"Unarmed Strike\" item, which is now created by default when importing a class/subclass\n- Split out GitHub-specific image-saving Config options, which are default-enabled to (hopefully) ease rate-limit issues\n- Fixed crash when attempting to import a hazard from an `@tag`\n- (v13) Fixed over-eager application of custom active effect config styling\n- (v13) Fixed Item Importer window positioning\n- (v13) Fixed various UI issues caused by bad style layering\n- (Brew) Fixed crash when loading items with resource-based attached spells"
	},
	{
		"ver": "2.8.0",
		"date": "2025-05-18",
		"title": "Improovede Splelign",
		"txt": "- Added activities and effects for Player's Handbook '24 spells\n- Added workaround for GitHub URLs (used in homebrew/prerelease content) failing to load due to rate limits\n- (v13) Fixed Polymorph temporary actor GM-only chat \"Delete\" button always being hidden\n- (v13) Fixed tall proficiency/etc. selection windows failing to scroll; fixed various minor styling issues\n- (v13) Fixed crash when right-clicking a compendium entry\n- (v13) Fixed duplicate Importer drag-drop handling on Firefox"
	},
	{
		"ver": "2.8.1",
		"date": "2025-06-01",
		"txt": "- Overhauled Species and Background Importers to generate more/better activities\n- Species and Background Importers now link gained feats from advancements of created species/background items\n- Added support for drag-dropping tags; search integration results to \"summon\"- and \"cast\"-type activities, to automatically populate Plutonium-style ephemeral actor/spell item links\n- Fixed Level Up button failing to finalize class/subclass feature item consumption info\n- Fixed compatibility with the LANCER system _[:^)]_, and added `dnd4e` and `lancer` as compatible game systems\n- Fixed Map Importer scaling of light positions (though not yet radius) from external scene data\n- (Brew) Added support for scene regions in external scene data"
	},
	{
		"ver": "2.9.0",
		"date": "2025-06-14",
		"title": "Oddments",
		"txt": "- Added activities and effects for Player's Handbook '24 feats, optional features, race features and items\n- The '\"Secret\" Attack Description' Config option has been renamed to '\"Secret\" Action Descriptions', and will now wrap additional actions (breath weapons, etc.) in \"secret\" blocks\n- The Item Importer will now generate \"Utilize\" activities for '24 tools\n- Improved compatibility with the \"Cauldron of Plentiful Resources\" module\n- Migrated \"Add Audio as Sound Effect\" support from \"Monks Little Details\" to \"Monk's Sound Enhancements\" (MSE)\n- Fixed imported MSE sound effects referencing unplayable URLs, and added support for customizing \"Base Media URL (audio)\" source to match existing \"image\" options\n- Fixed Importers failing to finalize consumption links when imported via the quick-import button in list views\n- Fixed the Spell Importer failing to set consumption information in the presence of custom activities\n- Fixed the Item Importer failing to set weapon reach\n- Fixed the Item Importer failing to give a baseline consumption amount to consumable items\n- Fixed the Importer Image Preloader referencing an outdated host\n- (v13) Fixed \"Embedded URL\" journal page failing to fill full journal height\n- (v13) Fixed crash when drag-dropping `@tags`; search integration results"
	},
	{
		"ver": "2.9.1",
		"date": "2025-06-25",
		"txt": "- Improved compatibility with the \"Ready Set Roll for D&D5e\" module\n- Fixed crash when drag-dropping `@tags`; search integration results\n- (Brew) The Class Importer may now auto-generate prepared spell advancements"
	},
	{
		"ver": "2.9.2",
		"date": "2025-06-28",
		"txt": "- Added Dragon Delves grid data (thanks @ Lyra)"
	},
	{
		"ver": "2.9.3",
		"date": "2025-07-17",
		"txt": "- Added activities and effects for Dungeon Master's Guide '24 items\n- Improved compatibility with the \"Monk's Combat Details\" module\n- Fixed Creature Importer failing to transform some ability modifiers for summoned creatures\n- Fixed Creature Importer failing to parse \"plus\"/\"minus\" special hit points\n- Fixed linked summon stats failing to refresh on character item/effects change\n- Fixed active effect variables failing to resolve in some cases\n- Fixed crash when loading additional Foundry-specific data in the Class Importer\n- Fixed Changelog viewer using an invalid changelog URL\n- Fixed search integrations failing to display non-legacy content when in \"Exclude Modern ('24)\" mode\n- Fixed Equipment Shop using limited filter set, despite having magic items available\n- Fixed Class Importer failing to populate prepared spell progression for '24 classes\n- Fixed Spell Prepared Toggler list failing to render\n- Fixed CORS issue when loading images in rare cases\n- Fixed \"Plutonium Import\" button appearing in temporary document header menus\n- (v13) Fixed \"Import\" button missing from temporary document header menu\n- (Brew) Fixed `\"foundryRaceFeature\"` data defined at a \"race\" level failing to apply at a \"subrace\" level"
	},
	{
		"ver": "2.9.4",
		"date": "2025-07-18",
		"txt": "- Fixed Plutonium UUIDs used in bastion facility \"harvesting\" spam-importing items when interacting with sheet\n- Fixed crash when resolving some active effect variables"
	},
	{
		"ver": "2.10.0",
		"date": "2025-08-09",
		"title": "QoLegacy",
		"txt": "- Added \"Automatically Update Blocklist from Rules Version\" Config option (enabled by default), which will attempt to sync Blocklist entries with your current rules version ('14 or '24) on world startup\n- Reworked \"Quick Insert\"/\"Spotlight Omnisearch\" module integration \"Exclude...\" options, to allow content to be automatically included/excluded based on rules version (now default)\n- Split \"NPC HP Roll Mode\" Config option into \"NPC HP Roll Mode\" and \"NPC HP Roll Mode (Summons)\", to allow summoned NPCs to retain standard hit points\n- Fixed crash when importing loot from the site Loot Generator via Rivet\n- Fixed Blocklist failing to apply to content in list picker windows\n- Fixed temporary actors, imported via e.g. the \"Quick Insert\" module integration, having the effects of their embedded items transferred to the parent actor\n- (v13) Added \"Use Importer when Using 'ADD ...' Button on Actor\" Config option (set to \"Prompt\" by default; this can be adjusted similarly to the \"Use Importer when Drag-Dropping Items to Actors\" Config option); when attempting to add e.g. a class to a sheet, Plutonium may now be used via the prompt \n- (v13) Fixed directory buttons failing to hide when \"Hide Directory Buttons\" Config option is enabled\n- (v13) Fixed sheet menu options failing to be added to \"group\" actor sheets"
	},
	{
		"ver": "2.11.0",
		"date": "2025-08-15",
		"title": "Always Split the Party",
		"txt": "- (v13) Added support for dnd5e 5.1.x, and dropped support for dnd5e 5.0.x. _[Note that the v12 version is still supported, for the time being, and continues to support dnd5e 4.4.x]_\n- (v13) Added migration for junk subclass advancements on startup\n- (v13) Added Item Importer and Spell Importer (as spell scrolls) support for encounter sheets\n- (v13) Migrated \"Embedded URL\" journal page type to AppV2, and removed \"Embedded URL (Legacy)\" journal page type\n- (v13) The Creature Importer now populates the new actor \"special\" speed with any previously-unhandled speeds (e.g. alternate speeds granted in different transformation modes)\n- (v13) The Creature Importer now populates the new initiative advantage/disadvantage roll mode\n- (v13) Fixed drag-dropping compendiums to compendium Config fields\n- (v13) Fixed crash when rendering empty importer list\n- (v13) Tweaked active effect UI layout styling to be more consistent through config updates, while offering a larger \"Value\" input field\n- (v13) Fixed various minor styling issues with interactable elements\n- Fixed tooltips failing to load when hovering items on temporary actors (e.g. those imported via the Quick Insert module integration)\n- Fixed Creature Importer failing to set summoner-matching token disposition when summoning a creature via a summon activity\n- Fixed Class Importer generating junk advancements on subclasses\n- Fixed Class Importer failing to generate subclass prepared spells advancements\n- Fixed Config case-insensitive handling of compendium IDs"
	},
	{
		"ver": "2.12.0",
		"date": "2025-09-07",
		"title": "Autonomicon",
		"txt": "- (v13) Updated Plutonium Addon: Automation integration; updated internal automation generators to match current automation landscape\n- (v13) Added support for \"Spellcasting Method\"/\"Preparation\" to Importers; Prepared Spell Mass-Toggler\n- (v13) Added \"Unwrap Long Compendium Names\" Config option\n- Added \"Minimum Permission Level for Directory Buttons\" Importer option, for anyone brave enough to give their players full access to the buttons\n- Updated '24 PHB automations\n- Added Foundry-style rendering to links in Loot Generator output\n- (v13) Fixed possible startup crash due to conflict with other modules\n- (v13) Fixed sizing of \"Embedded URL\" journal entry content\n- (v13) Fixed backend mod \"custom login\" styling support\n- (v13) Fixed \"Fix ESC Key\" failing to detect when the main menu is open\n- (v13) Fixed Streamer Mode failing to obfuscate module name in settings; module management\n- (v13) Fixed Importer crash when attempting to show title-less modal window\n- (v13) Fixed Creature Importer crash when importing to an existing actor\n- (v13) Fixed application of \"Wrap Long Folder Names\" Config option\n- (v13) Fixed rare non-blocking error when initializing chat handlers\n- Fixed Class Importer failing to set prepared spell class/subclass sources\n- Fixed Action Importer failing to set activation type"
	},
	{
		"ver": "2.12.1",
		"date": "2025-09-07",
		"txt": "- (Fixed broken build)"
	},
	{
		"ver": "2.12.2",
		"date": "2025-09-09",
		"txt": "- (v13) Improved Level Up button styling when using Tidy5e Sheet\n- (v13) Fixed doubled actor sheet menu items when using Tidy5e Sheet\n- (v13) Fixed Creature Importer crash when importing a creature with a \"Parry\" ability  when using Automation Addon"
	},
	{
		"ver": "2.12.3",
		"date": "2025-09-17",
		"txt": "- (v13) The Creature Importer now attempts to generate cast activities on imported spellcasting items\n- (v13) Improved compatibility with v13 fork of \"Simple Calendar\" the module\n- Improved compatibility with the \"Moulinette Media Search\" module\n- (v13; Automation) Fixed loaded activities losing required IDs"
	},
	{
		"ver": "2.12.4",
		"date": "2025-10-04",
		"txt": "- (v13) Fixed crash when attempting to apply compendium Ownership Updater changes\n- (v13) Further improved Level Up button styling when using Tidy5e Sheet\n- (v13) Fixed non-GM-user crash when attempting to add Level Up button to a sheet when \"Level Advancement without XP\" dnd5e option is used in conjunction with disabling \"Allow Individual Rests\" dnd5e option\n- (v13) Fixed crash when attempting to import items to a container on an actor\n- Fixed Rivet failing to set dice roll mode when using the \"Send Rolls\" option with \"Whisper Rolls\" disabled\n- Fixed Class Importer requiring manual dice input when testing validity of roll formula\n- Fixed Map Importer failing to uniquely name maps, thereby making them un-importable, in some cases\n- Fixed Map Importer combat map grids using non-standard (i.e., not \"5 ft.\") grid sizing\n- Fixed input prompt modals failing to open in some cases\n- Improved compatibility with the \"Terrain Height Tools\" module\n- (Brew) Added support for `\"foundryAdvice\"`, which appends provided entries (as a Foundry-specific hint inset) to imported descriptions"
	},
	{
		"ver": "2.12.5",
		"date": "2025-10-08",
		"txt": "- (v13) Migrated deprecated API usage\n- (Added support for main site changes)"
	},
	{
		"ver": "2.12.6",
		"date": "2025-10-30",
		"txt": "- (v13) Fixed \"Import\" button failing to appear in temporary document menu when using Tidy5e Sheet\n- (v13) Fixed advancement flow being incorrectly invoked when adding a Plutonium-imported class to a sheet via the compendium browser\n- (v13) When using metric unit options, fixed Importers failing to output metric units in some cases\n- Added map grid data for Heroes of the Borderlands (thanks @ Lyra)\n- Manually-added blocklist entries are now tracked separately from automatically-added blocklist entries, preventing removal of manually-added entries when using the \"Automatically Update Blocklist from Rules Version\" Config option\n- Added various customization options to the \"Display Missing Health\" Config option/feature: \"Hide Missing Health on Defeated Tokens\", \"Bloodied Text Color\", \"Only Display Missing Health as Bloodied\", \"Bloodied Text\"\n- Added default icons for imported fighting styles to Feat/Optional Feature Importers\n- Added fallback on subclass image to Subclass Feature Importer when no subclass feature image is available\n- Switched to GitHub \"release\" download links over `raw.` links for module install/download, hopefully alleviating GitHub \"429\" install errors\n- Switched to \"identifier\"-based matching for Unarmed Strike, preventing item re-creation if the original has been renamed\n- Importers will now respect core \"Ring Enabled\" token override settings\n- Applied PHB'24 2.1.0 update to activities/effects\n- Fixed Creature Importer failing to set senses in some cases\n- Fixed Background Importer doubling feature text when importing to the items directory\n- Fixed Importers failing to set save challenge ability on activities\n- (Brew) Fixed Importer crash when attempting to load file which contains species versions"
	},
	{
		"ver": "2.12.7",
		"date": "2025-11-02",
		"txt": "- (v13) Added Tidy5e sheet compatibility for the 'Use Importer when Using \"ADD ...\" Button on Actor' Config option\n- (v12) Fixed crash when importing a creature with the \"Enable Token Dynamic Rings\" Config option enabled"
	},
	{
		"ver": "2.12.8",
		"date": "2025-11-09",
		"txt": "- (v13) Fixed Tidy5e sheet compatibility for the 'Use Importer when Using \"ADD ...\" Button on Actor' Config option using incorrect libWrapper patch mode\n- (v13) Fixed Content Updater progress percentage display\n- (v13) Fixed Content Updater updating additional unwanted fields (e.g. spell \"source class\")\n- Added map grid data for Welcome to the Hellfire Club and Forgotten Realms: Adventures in Faerûn (thanks @ Lyra)\n- Fixed importing an entity with a choice of feats failing to display the \"select feat\" dropdown\n- Fixed Spell Importer failing to update spell preparation when using \"Replacement Data Compendiums\" Config option\n- Fixed Importer crash when importing save activities with no challenge ability\n- Fixed additional cases where Importer could fail to set save activity challenge ability"
	},
	{
		"ver": "2.12.9",
		"date": "2025-11-13",
		"txt": "- Switched to \"disposition\"-based toggles for \"Display Missing Health\" Config option, allowing different settings to be used for friends/foes\n- Added \"Include Property Text in Description\" Item Importer option, which allows the body text of properties to be rendered while still skipping the header\n- Fixed Spell Importer failing to set save activity challenge ability"
	},
	{
		"ver": "2.12.10",
		"date": "2025-11-20",
		"txt": "- (v13) Improved compatibility with the \"Monk's TokenBar\" module\n- Added map grid data for Astarion's Book of Hungers and Netheril's Fall (thanks @ Lyra)"
	},
	{
		"ver": "2.13.0",
		"date": "2025-11-29",
		"title": "Mors Ab Alto",
		"txt": "- (v13) Added support for dnd5e 5.2.x (maintaining support for dnd5e 5.1.x)\n- Added \"Elemental Airship\" support to Vehicle Importer\n- The Vehicle Importer will now approximate token/vehicle \"size\" via crew/passenger capacity, if no size/dimension information is available\n- Added map grid data for Lorwyn: First Light (thanks @ Lyra)\n- Importers will now prefer URL-encoded image paths, where available, to improve compatibility with other modules\n- Fixed drag-dropping to a Tidy5e sheet from e.g. the Quick Insert module creating a copy of the dropped document in the sidebar"
	},
	{
		"ver": "2.13.1",
		"date": "2025-12-14",
		"txt": "- (v13) Fixed Class Importer cantrip/spell picker dialog failing to scroll on small displays\n- Added Species Feature Importer fallback on species image when no feature-specific image is available\n- Fixed Macros compendium pack failing to contain any macros\n- Fixed Map Importer failing to apply homebrew scene data in some cases\n- Fixed chain/rope item type/activities; fixed Unarmed Strike activity names; fixed class feature activity typos\n- (Brew) Added region support to Map Importer\n- (Brew) Fixed double-encoding of already-encoded image URLs"
	},
	{
		"ver": "2.13.2",
		"date": "2025-12-14",
		"txt": "- Fixed Importers setting invalid activity IDs"
	},
	{
		"ver": "2.13.3",
		"date": "2025-12-15",
		"txt": "- Fixed compatibility issue with the Midi QOL module"
	},
	{
		"ver": "2.13.4",
		"date": "2025-12-21",
		"txt": "- Added Map Importer support for importing vehicle floor plans\n- Added \"automatically managed\" display to automatically-added Blocklist entries, which can no longer be manually removed _[as refreshing would cause them to regenerate anyway]_\n- Added grid data for Fated Flight of the Recluse maps (thanks @ Lyra)\n- Fixed Creature Importer setting incorrect dynamic token scale in some cases\n- Fixed Creature Importer failing to link legandary/mythic spellcasting actions in \"Legendary/Mythic Actions\" 'header' item"
	},
	{
		"ver": "2.13.5",
		"date": "2025-12-29",
		"txt": "- (v13) Fixed Class Importer generating '24-style Unarmed Strike when using 2014 rules\n- Added map grid data for vehicle maps (thanks @ Lyra)\n- Fixed Background Importer crash when importing a background with custom features\n- Fixed \"Render >4 Levels of Folder Nesting\" Config option failing to apply on initial load\n- (Brew) Fixed prerelease/homebrew content having inconsistent source \"Rules Version\"\n- (Brew) Fixed `\"additionalSpell\"` class list references failing to fully populate\n- (Brew) Added speculative `tokenHref3d` support to Creature/Vehicle/Object Importers "
	},
	{
		"ver": "2.13.6",
		"date": "2026-01-12",
		"txt": "- (v13) Fixed drag-dropping to a _non-player_ Tidy5e sheet from e.g. the Quick Insert module creating a copy of the dropped document in the sidebar\n- Tweaked World Content Blocklist auto-management strategy to avoid auto-managed values getting \"stuck\"\n- Exposed Equipment Shop via the API (`game.modules.get(\"plutonium\").api.equipmentShop.pOpen`)\n- Fixed Importers failing to set \"allow critical damage\" on items in some cases\n- Fixed Importers importing junk activity consumption when importing via Rivet, or when importing to a directory\n- Fixed duplicate \"Languages\" sheet item for '14 species when importing under '24 rules\n- Fixed UI flicker when opening Import Wizard\n- Fixed Equipment Shop \"Add All\" button adding items with invalid sources\n- Fixed Quick Insert drag-drops failing to trigger the full Importer flow\n- (Brew) Added `foundryMonster*` support to Creature Feature Importer"
	},
	{
		"ver": "2.13.7",
		"date": "2026-01-13",
		"txt": "- Fixed Importer crash when no prerelease content/homebrew is available (e.g. on a network error)"
	},
	{
		"ver": "2.13.8",
		"date": "2026-01-13",
		"txt": "- (v13) Fixed rare crash when initially rendering Import Wizard\n- Fixed crash when opening Import Wizard for the first time in a world\n- Fixed \"Render >4 Levels of Folder Nesting\" Config option crashing when game contains chat messages on load"
	},
	{
		"ver": "2.13.9",
		"date": "2026-01-15",
		"txt": "- (v13) Fixed drag-drop of rendered `@tag`s to a Tidy5e sheet\n- Fixed Importer crash when migrating '14 homebrew"
	},
	{
		"ver": "2.13.10",
		"date": "2026-01-21",
		"txt": "- (v13) Added support for dnd5e 5.2.5\n- (v13) Fixed Spell Importer setting junk area shape in some cases, which could result in a crash when attempting to use the spell\n- Fixed Level Up button class-picker \"Confirm\" failing to register inputs"
	}
]
